{"title":"EXPLOITED COLLEGE GIRLS - Golden - Painful Anal Sex 720p *NEW*","uid":11103868,"size":2119854156,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:01bc6e013813a13fd0643ed7979b77fb60134ad0&amp;dn=EXPLOITED+COLLEGE+GIRLS+-+Golden+-+Painful+Anal+Sex+720p+%2ANEW%2A&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"beta2008x","files":1,"time":1411700929,"description":"  &lt;a href=&quot;\nhttp://imgboxxx.com/viewer.php?file=am8ch_gdn.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgboxxx.com/viewer.php?file=am8ch_gdn.jpg&lt;/a&gt;\n  &lt;a href=&quot;\nhttp://imgboxxx.com/viewer.php?file=0ojbd_ecg_14_09_25_golden_.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgboxxx.com/viewer.php?file=0ojbd_ecg_14_09_25_golden_.jpg&lt;/a&gt;\n\n\nOn the ride to our top secret Ex Co Gi filming location, first timer Golden proclaims that not only has she had plenty of anal sex, she absolutely loves the orgasms she gets from it. Yes, that noise you hear off camera is Jay cracking a huge CHALLENGE ACCEPTED smile. Anal lovers, we know it's been a while, but rejoice, sit back, get the jerk lotion out of the fridge and settle in for some classic Ex Co Gi Style Painal Sex(TM).\n\nThis update starts off as most do: small talk, girl strips, pretends to act shy, smash cut to a high def camera 2 inches from her vagina (yes, we see you are shy, your taint is still blushing), Jay fingers her to orgasm, etc. etc. If you've seen 5 updates in your life you know how the beginning goes, but don't be fooled into thinking that this is a typical update! Oh, no. Just about the time Golden drops to her knees to get into the classic Ex Co Gi Blowjob Pose(TM) things get Very Interesting as we proceed to the Good Stuff(TM).\n\nUpon first look, Golden has a prim and proper, milfy appeal about her. She's curvy, almost but not quite too curvy. Like she's a two pint Ben and Jerry's binge away from chubby, but hasn't crossed that line. When she gets to her knees and looks up at the camera as she bathes Jay's cock with her tongue, however, all pretense of proper disappears - kind of like the way Jay's cock disappears down her throat. This girl knows her way around a dick. Between sucking Jay's balls and deep throating his whole rod, she wraps her tongue around it in some sort of feline move she may have actually invented.\n\nOnce Jay gets her on the bed things get even better. He starts off fucking her on her back, and when he's sure the oven's been suitably preheated, flips her over to get access to that ass. The first glimpse you get of Golden's fine backside should elicit, at least, a 'wow' or a 'holy shit' even possibly a 'got day-um'. It's that nice. It's well proportioned, it's big but not too big, it's bouncy, it's got some subtle tan lines. And Jay's gonna fuck it.\n\nDespite plenty of lube and enthusiasm, Golden hadn't quite bargained for the size of the package she's getting delivered around back. But she puts her hips into it and pushes back up on Jay and she grits her teeth until she takes it all. It turns out to be just too tight a squeeze and Jay ends up giving her a break and finishing in her pussy, serving up a nice big creampie.\n\t\t","torrent":{"xt":"urn:btih:01bc6e013813a13fd0643ed7979b77fb60134ad0","amp;dn":"EXPLOITED+COLLEGE+GIRLS+-+Golden+-+Painful+Anal+Sex+720p+%2ANEW%2A","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"01bc6e013813a13fd0643ed7979b77fb60134ad0","infoHashBuffer":{"type":"Buffer","data":[1,188,110,1,56,19,161,63,208,100,62,215,151,155,119,251,96,19,74,208]},"announce":[],"urlList":[]}}