{"title":"Foxtrot (1982)","uid":12202179,"size":802030130,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:058777ea3621f4d3fdeedf8d3da36562d2c8d327&amp;dn=Foxtrot+%281982%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"GreatKey","files":1,"time":1438855781,"description":"cover &lt;a href=&quot;\nhttp://aveimage.biz/?cmd=browse&amp;view=1&amp;id=1131&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://aveimage.biz/?cmd=browse&amp;view=1&amp;id=1131&lt;/a&gt;\npreview &lt;a href=&quot;\nhttp://aveimage.biz/?cmd=browse&amp;view=1&amp;id=1132&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://aveimage.biz/?cmd=browse&amp;view=1&amp;id=1132&lt;/a&gt;\n\n\nTitle: Foxtrot\nYear: 1982\nCountry: USA\nDirector: Cecil Howard\nStarring: Linda Vale, Marilyn Gee (as Marissa Constantine), Marlene Willoughby, Merle Michaels, Samantha Fox, Sandra Hillman, Sharon Mitchell, Tiffany Clark, Vanessa del Rio, Veronica Hart, Tess Mayo, Alan Adrian, Bobby Astyr, David Morris, Jack Silver, Jack Teague (as Jake Teague), R. Bolla (as Richard Bolla), Ron Jeremy, David Davidson, Fred J. Lincoln (as F.W. Lincoln), John Christopher, Cecil Howard (as Ward Summers)\nTime: 01:14:29\nSize: 743 Mb\nResolution: 352x240\nType of file: AVI\nAbout: New Year's Eve casts an urgency unlike any other day of the year as people all over America revel in the infinite possibilities of the coming year. Cecil Howard's Foxtrot follows the lives of several oversexed New Yorker's on the last day of the year as they plan and prepare for what they hope will be a night of unforgettable passion. The countdown is on and the stage is set as the Luther's prepare to host a New Year's Eve gala where the lives of all the characters will intertwine. New bonds will be forged and old promises broken creating a permanent divide between the all too familiar past and the all too blind future. With an in telligent script by Ann Randall and superb camera work from Felix Daniel, Cecil Howard coaxes genuine, realistic performances and arousing sexuality from an all-star cast. Jack Teague plays the perverted millionare who will have sex with anyone... but his wife. R. Bolla is the conservative but curious neighbor to Marlene Willoughby's Zelda, an erotic writer. Sandra Hillman plays the baby-sitter who decides that New Year's Eve is the time to lose her virginity and Ron Jeremy plays the sailor who discovers his girlfriend is cheating on him... with another woman! Vanessa Del Rio and Tiffany Clark are both objects of desire for the aforementioned Teague. Linda Vale plays the mother to Marilyn Gee's Alice, a young but notorious starlet who is willing to do anything to get a starring role. Samantha Fox and Veronica Hart round out this all star cast of characters who each in their own way have have pitted themselves in a race against time. Released in 1982 (prior to AVN awards)Foxtrot was nominated for 13 AFAA awards winning Best Picture, Director, Screenplay, Music and Editing. Gerard Damiano (Deep Throat) said it was &quot;far and away, the best film of the year&quot;","torrent":{"xt":"urn:btih:058777ea3621f4d3fdeedf8d3da36562d2c8d327","amp;dn":"Foxtrot+%281982%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"058777ea3621f4d3fdeedf8d3da36562d2c8d327","infoHashBuffer":{"type":"Buffer","data":[5,135,119,234,54,33,244,211,253,238,223,141,61,163,101,98,210,200,211,39]},"announce":[],"urlList":[]}}