{"title":"Yattering - discography [Metal] (1996 - 2005) (mp3)","uid":11082014,"size":345267989,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:08bf19adb6ebaea838e80082b02d1a622872420c&amp;dn=Yattering+-+discography+%5BMetal%5D+%281996+-+2005%29+%28mp3%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"TetsElPilsen","files":-1,"time":1411418874,"description":"Yattering - discography [Metal] (1996 - 2005) (mp3)\n\nPoland's YATTERING originally formed in 1991, with the current line-up coalescing in 1996. Comprised of Svierszcz (bass &amp; vocals), Hudy (guitar) and Zabek (drums), YATTERING wrote and recorded their first two demo cassettes, Promo 96 and The Sick Society, establishing YATTERING as a young, up-and-coming band forging insanely technical and brutal death metal. YATTERING's third demo was comprised of two tracks, one of which ended up on the legendary Thrash`EmAll magazine's &quot;Blood to Come&quot; sampler, providing needed exposure for the band. Performances at numerous concerts and festivals contributed to the band`s growing reputation as one of the best live acts in Poland.\n\nIn January 1998, YATTERING entered Selani studios and began work with producer Andy Bomba (Vader, Christ Agony, Behemoth) on their debut album Human`s Pain, subsequently released through Moonlight Productions. The album turned out to be the best Polish debut of 1998 and saw the band topping many reader and writer polls. Word of YATTERING`s sound started to emanate abroad, establishing the band as Poland's &quot;next candidates&quot; to succeed internationally after Vader. In September 1998, the band recorded the Exterminate EP, which contained blistering covers of Brutal Truth's classic Ill Neglect and Slayer's Ditto Head. Following the release of the debut, YATTERING made numerous live appearances, including tours with Devilyn, Krabathor and Count de Nocte. Such intense live activity created a need for another guitar player and brought Thrufel into the fold.\n\nThe beginning of 1999 marked certain conflicts with Moonlight Productions, which eventually forced YATTERING to re-align and sign with Massive management, home to Vader, Christ Agony, DECAPITATED and others. Soon after, YATTERING signed with France's Season of Mist label, who released the band`s second album, the dizzying Murder`s Concept. Soon after the release of the record, the band`s drummer, Zabek, filled in as a temporary replacement for Vader`s Docent, who was unable to perform during their summer gigs and the European tour with NILE, Six feet under, Cryptopsy, Enslaved and ThyryfhIng. YATTERING played two prestigious gigs together with Marduk and Angel Corpse in November `99. Relapse Records, after hearing the magnitude of YATTERING's compositions, approached the band and asked them to contribute 3 of their older demo tracks for an Underground Series release entitled Polish Assault, which also featured crushing demos from Polish acts LOST SOUL, DECAPITATED and DAMNABLE.\n\nPolish Assault was released simultaneously with the Relapse version of Murder`s Concept in Novemember 2000. Poland's YATTERING are the epitome of the young, fast-rising new breed of technical death metal. Murder's Concept, the band's second full-length, is radically brutal without cessation and sees YATTERING contriving its musical assassinations with an obtuse, intricate mixture of violence and brilliance. YATTERING's innate, intrinsic power discharges like a fragmenting grenade, as scalding guitar-work and battering drumming incessantly stab and defile those daring enough to confront the band's audio-homicide. The concept of YATTERING's murder is fine butchery, a small guide on how to musically skin a human being properly and let it live as long as possible.\n\nYATTERING:\nSvierszcz - bass &amp; vocals\nHudy - guitar\nZabek - drums\nThrufel - guitar\n\nYear: 1996 - 2005\nCountry: Poland\nGenre: Technical Brutal Death Metal\nCodec: Mp3\nBitrate: 128 - 320Kbps\n\nTRACKLIST:\nYattering_-_(1996) The sick society (demo)\nYattering_-_(1998) Human's pain\nYattering_-_(2000) Murder's Concept\nYattering_-_(2003) Genocide\nYaterring_-_(2005) III","torrent":{"xt":"urn:btih:08bf19adb6ebaea838e80082b02d1a622872420c","amp;dn":"Yattering+-+discography+%5BMetal%5D+%281996+-+2005%29+%28mp3%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"08bf19adb6ebaea838e80082b02d1a622872420c","infoHashBuffer":{"type":"Buffer","data":[8,191,25,173,182,235,174,168,56,232,0,130,176,45,26,98,40,114,66,12]},"announce":[],"urlList":[]}}