{"title":"v's Recommended Games Nindendo DS pack 2014-09-29.7z","uid":11130104,"size":14570715570,"categoryP":"games","categoryS":"other","magnet":"?xt=urn:btih:08e827142a38ad097a66995b012ddb9713a00cdb&amp;dn=v%27s+Recommended+Games+Nindendo+DS+pack+2014-09-29.7z&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":1,"time":1412027775,"description":"Why the /v/ Recommended Games Wiki? Well any list is going to be subjective as hell, but if you're like me and don't want to have to sift through a bunch of shovelware every time you want to play a game, I think this is a damn good starting point for a collection.\n\nIn addition to the clean ROMs, I have included pre-patched games with translation patches, and an un-dub patched version of Retro Game Challenge since I'm a fan of Game Center CX and I wanted to hear Arino's actual voice.\n\nIn the archive there is a &quot;~notes.txt&quot; file. This says what database I used to verify that set and sometimes explains why a certain game is missing, or why a game is named differently than what the database has it marked as.\n\nIf any of the patched games give you trouble, check its entry on romhacking.net or Google to see if it's compatible with your emulator or a known issue before making a post. I tried to make it clear as to what patches where used so they can easily be looked up for this reason among others.\n\nIf any game gives you trouble on your flash card, try to find out if it's compatible with your flashcard or a known issue before posting.\n\nI won't help you set up emulators, so don't ask.","torrent":{"xt":"urn:btih:08e827142a38ad097a66995b012ddb9713a00cdb","amp;dn":"v%27s+Recommended+Games+Nindendo+DS+pack+2014-09-29.7z","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"08e827142a38ad097a66995b012ddb9713a00cdb","infoHashBuffer":{"type":"Buffer","data":[8,232,39,20,42,56,173,9,122,102,153,91,1,45,219,151,19,160,12,219]},"announce":[],"urlList":[]}}