{"title":"Hydraulic Empire","uid":12262563,"size":172690281,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:0caeea3dbed5f2b7d7ee8f2012de4457d2c6028e&amp;dn=Hydraulic+Empire&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"polan32","files":2,"time":1440191795,"description":"Title: Hydraulic Empire\nGenre: Action, Casual, Indie, RPG, Simulation, Strategy\nDeveloper: Solitude Entertainment \nPublisher: Solitude Entertainment\t\nRelease Date: 31 Jul, 2015\nCrack: ALiAS\n\nSystem Requirements:\nOS: Windows XP \nProcessor: Atom Z3740D \nMemory: 2 GB RAM \nGraphics: Intel Integrated HD4000 \nDirectX: Version 10 \nHard Drive: 700 MB available space \n\nAbout This Game\n&quot;Hydraulic Empire looks to be that entry into the genre that I have been waiting for.&quot; - indiegames.com \n\nWhat is it? \n\nHydraulic Empire is a Tower Defense game with RPG elements focusing on strategy, interactions between mobs, and persistent upgrades. What we are doing with Hydraulic Empire is taking the best of what we have experience over the years, and then we are adding elements that are unique. \n\nHow much Content is there? \n\nWe have over 20 levels (21 at launch and we will continue to add more as time goes on), 10 mobs, 10 towers, a builder that levels as you play, and tons of mob interactions. All in all at launch there is about 15 hours of gameplay. \n\nWhats Different about our TD? \n\nTower Defenses are not new, and they are not evolving much anymore. We aim to change that by adding in a variety of unique mob interactions. We are also adding in tons of RPG elements and we have a hero/builder that will allow you to take part in more of the battle. \n\nMob interactions are our major innovation. Where as they are not 100% new to the tower defense genre, they are typically simple or not very interesting. We have taken this to the next level, and centered our game squarely around them. Mob interactions will take place all over a level, and will change where and how you choose to build in a level. The interactions vary greatly based on which mob die in which order. This aspect of the game has given the game almost endless replay ability. Most of our mobs will interact with at least 2 or 3 other mobs. Some interactions open up new interactions, and others will lock out some interactions. \n\nA Taste of the Story \n\n&quot;Peace had been a dream, and the light of its hope has been overshadowed by a new enemy. My own people have turned on me. For what reason, I do not yet know. But there is no option but to fight, if for nothing else but the undying dream of peace at least. I am the First Lieutenant General of the Great Mech Army, but you may call me the Keeper, for I protect the dreams of many. And I call to you for aid. The mobs close in, thirsty for the land we won through fearsome attrition. And I am the only one who now stands in their way.&quot;\n\n1. Run Setup.exe                                                          \n2. Have Fun!!!!","torrent":{"xt":"urn:btih:0caeea3dbed5f2b7d7ee8f2012de4457d2c6028e","amp;dn":"Hydraulic+Empire","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0caeea3dbed5f2b7d7ee8f2012de4457d2c6028e","infoHashBuffer":{"type":"Buffer","data":[12,174,234,61,190,213,242,183,215,238,143,32,18,222,68,87,210,198,2,142]},"announce":[],"urlList":[]}}