{"title":"Hordes Reformed - Europa Universalis IV mod","uid":11096500,"size":38521,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:0eea231dd4c9fc1397570c3d3d1043fb34107ee0&amp;dn=Hordes+Reformed+-+Europa+Universalis+IV+mod&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Nimbleton","files":-1,"time":1411603722,"description":"Hordes Reformed - Europa Universalis IV mod\n\n\nDESCRIPTION\nA mod to make playing the horde nations more enjoyable. \n\nVersion 1.08 \n- Fixed the missing national ideas. \n\n\n- Added compatiability with Dei Gratia (if you want to Oirat Horde and the Mongol Khanate to use the governments from my mod, you need to change their government in the Dei Gratia files to steppe_horde_hr) \n- Removed the dip reduction effect during certain events. \n- Tribal events changed to be more balanced \n- Steppe Hordes can now reform into a new government type: Reformed Steppe Horde \n- Steppe Hordes once westernised can reform into a new government type: Western Steppe Horde \n- Reforming the government can be done with any full idea group. \n- Mongols has been added as a formable nation (controlling Mongolia, Central Asia and Manchu regions) \n- Yuan has been added as a formable nation (controlling Mongolia and Manchu regions ) \n- Ilkhanate has been added as a formable nation (controlling Persia and Middle East regions ) \n- Added back in the Sacking event when a horde wins a siege on an non-horde nation. \n- Added random defection for enemies of the hordes during war. \n- Added Raid event that gives manpower to the horde and takes it from the target non-nomad nation \n- Expanded the Steppe Nomad unit choice. Infantry choices mirror the Indian choices, whilst Cavalry choices mirror the Muslim choices \n- Added a Kazan History event, allowing Kazan to become a protectorate of Moscovy and follow Ivan's ambitions, or reject them and allow Moscovite-Kazan relations to suffer. \n","torrent":{"xt":"urn:btih:0eea231dd4c9fc1397570c3d3d1043fb34107ee0","amp;dn":"Hordes+Reformed+-+Europa+Universalis+IV+mod","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0eea231dd4c9fc1397570c3d3d1043fb34107ee0","infoHashBuffer":{"type":"Buffer","data":[14,234,35,29,212,201,252,19,151,87,12,61,61,16,67,251,52,16,126,224]},"announce":[],"urlList":[]}}