{"title":"NubileFilms - Aidra Fox, Kimmy Granger - Roommate Seduction","uid":12274007,"size":156813563,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:0f59adc707d84c3703d261e734551f2c20345c33&amp;dn=NubileFilms+-+Aidra+Fox%2C+Kimmy+Granger+-+Roommate+Seduction&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":5,"uploader":"Ctrlme","files":1,"time":1440328448,"description":"-----------------------------------------------------------\nNubileFilms - Aidra Fox, Kimmy Granger - Roommate Seduction\n-----------------------------------------------------------\nScreenshots: &lt;a href=&quot;\nhttp://imgctrl.com/image/N9x&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgctrl.com/image/N9x&lt;/a&gt; &lt;a href=&quot;\nhttp://imgctrl.com/image/N96&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgctrl.com/image/N96&lt;/a&gt;\n-----------------------------------------------------------\nKimmy Granger arrives home with her boyfriend Johnny Castle. The couple is ready for a hot time, but when Kimmy goes to her room she finds her roommate Aidra Fox passed out naked in her bed! That's okay; Kimmy is happy to include Aidra in her lovemaking and Aidra is happy to be seduced into an impromptu threesome with Kimmy and Johnny. Soon all three of them have worked their way out of their clothes in anticipation of a hot sexy time.\n\nThe moment Kimmy and Aidra have gotten Johnny out of his shorts, they press him down onto the bed so that they can enjoy giving him a blowjob together. They bring their warm hands into the mix to enhance Johnny's pleasure as they take turns licking and sucking his long thick cock until it is rock hard and ready to fuck.\n\nAidra is the lucky lady who gets to climb onto Johnny's dick first. She sinks slowly onto his fuck stick, taking a moment to get used to the feeling of complete fullness before pumping her hips in a tittie bouncing stiffie ride. Kimmy kneels by Aidra's side, using her magic fingers to rub her lover's clit until Aidra is screaming her ecstasy.\n\nPulling out of Aidra's heat, Johnny rolls Kimmy onto her back and then slides right in to her tight twat. While Kimmy is having her pussy pounded by Johnny, Aidra plants her snatch right on Kimmy's face so that the brunette can give pleasure as well as receiving it. She only climbs off when Kimmy's moans of eagerness indicate that she's getting closer and closer to cumming.\n\nThe trio rearranges themselves so that Aidra and Johnny can have spooning sex while Aidra finishes Kimmy off by slamming her fingers in and out of Kimmy's fuck hole in time to Johnny's thrusts in her pussy. The moment Kimmy's body starts humming with orgasmic ecstasy, she pops onto her knees and goes to work rubbing Aidra's clit until her roommate joins her in the land of bliss.\n\nThe girls aren't totally satisfied yet, so Johnny is happy to delay his own pleasure and keep playing stud. When Kimmy gets up on her hands and knees, he eagerly slides into her snatch from behind to give her a doggy style pussy pounding.\n\nAidra desires some additional action, too, which she achieves by climbing on top of Kimmy so that Johnny's every thrust forward sends Kimmy's ass rubbing against Aidra's clit. The unique pressure leaves Aidra right on the edge of another orgasm, so that when Johnny pulls her towards him to get her fuck hole filled she cums quickly.\n\nAidra's pulsing pussy walls leave Johnny unable to delay his own climax a moment longer. He barely pulls out of Aidra's twat before he explodes, covering Aidra's slit and Kimmy's ass with his love. The girls sample Johnny's cum, enjoying the flavor of his love.\n-----------------------------------------------------------\nIf you like this torrent, please post a comment!\n\nDon't forget to seed!","torrent":{"xt":"urn:btih:0f59adc707d84c3703d261e734551f2c20345c33","amp;dn":"NubileFilms+-+Aidra+Fox%2C+Kimmy+Granger+-+Roommate+Seduction","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0f59adc707d84c3703d261e734551f2c20345c33","infoHashBuffer":{"type":"Buffer","data":[15,89,173,199,7,216,76,55,3,210,97,231,52,85,31,44,32,52,92,51]},"announce":[],"urlList":[]}}