{"title":"Otis Taylor - Clovis People, Vol  3 - FLAC","uid":11131262,"size":295524079,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:155da347d1cb82ae6fd5db331e27b60028afea85&amp;dn=Otis+Taylor+-+Clovis+People%2C+Vol++3+-+FLAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"mindcrasher","files":-1,"time":1412047026,"description":"Taylor was born in Chicago and moved at a young age to Denver, Colorado where he grew up. He originally grew up playing the banjo, but his father wanted him to be a jazz musician. Upon hearing that the banjo was originally an African instrument turned almost exclusively into a white bluegrass instrument in part through the derogatory black-face minstrel shows of the 19th century, Taylor dropped the banjo and began to focus solely on the guitar and harmonica. He played music professionally both in Europe and the United States in a variety of blues-oriented bands, including Zephyr, until 1977, when he left the music industry for other pursuits, including becoming an antique dealer.\n\nTaylor returned to music in 1995, and as of 2008, has released nine blues albums on several record labels. His music tends to focus on the hard realities of life, especially relating to the black community. Some common themes in his music are murder, racism, poverty, and the need for redemption. To date, Taylor has twelve Blues Music Awards nominations while White African was named 'Best Artist Debut'.\nwiki\n","torrent":{"xt":"urn:btih:155da347d1cb82ae6fd5db331e27b60028afea85","amp;dn":"Otis+Taylor+-+Clovis+People%2C+Vol++3+-+FLAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"155da347d1cb82ae6fd5db331e27b60028afea85","infoHashBuffer":{"type":"Buffer","data":[21,93,163,71,209,203,130,174,111,213,219,51,30,39,182,0,40,175,234,133]},"announce":[],"urlList":[]}}