{"title":"Skin Flicks (1978)","uid":12172376,"size":1311032682,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:15ca31e4c1286766c18bf9e05830d66ed91867d9&amp;dn=Skin+Flicks+%281978%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"GreatKey","files":1,"time":1438251592,"description":"cover &lt;a href=&quot;\nhttp://aveimage.biz/?cmd=browse&amp;view=1&amp;id=1047&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://aveimage.biz/?cmd=browse&amp;view=1&amp;id=1047&lt;/a&gt;\npreview &lt;a href=&quot;\nhttp://aveimage.biz/?cmd=browse&amp;view=1&amp;id=1048&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://aveimage.biz/?cmd=browse&amp;view=1&amp;id=1048&lt;/a&gt;\n\n\nTitle: Skin Flicks\nYear: 1978\nCountry: USA\nDirector: Gerard Damiano\nStarring: Bethanna (as Beth Anna), Heather Young (as Coleen Davis), Jill Munroe (as Jill Monroe), Sharon Mitchell, Gina Harlow, Dory Devon (as Marisa Lyon), Victoria Corsaut (as Victoria Corsaint), Jamie Gillis, Joey Silvera (as Joseph Scott), Hershel Savage (as Loel Laiter), Tony Hudson, Tony Mansfield, Beerbohn Tree (as Beerbohm Tree), R. Bolla (as Bob Kerman), Gerard Damiano\nTime: 01:25:22\nSize: 1.19 GiB\nResolution: 706x480\nType of file: AVI\nAbout: During the late 1970's, director Gerard Damiano was without a doubt at the top of the adult film industry. Every film he shot during the era was a subtle masterpiece of erotic entertainment. Damiano focused on character in his films, crafting believable scenarios and situations for them to explore. The result was a style of sexvid that hasn't been seen since - psychologically driven yet intensely sexual. This 1978 opus focuses on the making of a porn flick, but it doesn't take the standard 1Ccasting couch 1D approach to the subject. Instead, Damiano focuses on the seedier side of the business, letting the camera capture the backstage machinations between an ambiguous actor and his sleazy strip-club-owning financier. Things really take a turn for the dramatic when youthful porn starlet Colleen Davis gets kidnapped by twisted stalker Jamie Gillis. Jamie's character has convinced himself that Colleen wants him as much as he wants her, so he abducts her and subjects her to his every wanton whim. In the end the question lingers - who's really taking advantage of Colleen, her director or her kidnapper? You'll be surprised by the shocking answer. Well written and beautifully shot, 18Skin Flicks' is without question one of the classics of plot-driven 70's porn","torrent":{"xt":"urn:btih:15ca31e4c1286766c18bf9e05830d66ed91867d9","amp;dn":"Skin+Flicks+%281978%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"15ca31e4c1286766c18bf9e05830d66ed91867d9","infoHashBuffer":{"type":"Buffer","data":[21,202,49,228,193,40,103,102,193,139,249,224,88,48,214,110,217,24,103,217]},"announce":[],"urlList":[]}}