{"title":"Essentials - Hellblazer v1 (1988-1989)","uid":12141875,"size":246482562,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:17872b36aca2224bb871c7c96661e646c7c012bf&amp;dn=Essentials+-+Hellblazer+v1+%281988-1989%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":6,"uploader":"Archivist_of_the_Damned","files":14,"time":1437360794,"description":"Essentials - Hellblazer v1 (1-13, Annual 1; 1988-1989)\n\nThe not-exactly hard-boiled, occult detective's success launched the Vertigo line and provided its longest lasting series.  Alan Moore's blue-collar mage first appeared in the second volume of Swamp Thing and proved to be a breakout character.\nThe character owes a great deal to Michael Moorcock's Jerry Cornelius and the work of J.G. Ballard, but that being said, creator Moore and Jamie Delano handily crafta character that truly became emblematic of the late '90's and early '90's.  \n\nDelano crafts a truly horrific history for John Constantine that is unflinching in its depiction of Constantine, and his pride, as his own worst enemy.  The scope of the initial story arc &quot;Original Sins&quot; is quite wide with John venturing to Africa, New York, and of course, London.  &quot;The Devil You Know&quot; is the second story arc which ties up plot threads from the first arc and finally provides the gruesome details of what exactly happened in Newcastle (the Exorcist pales in comparison). Delano is a genius and it's an atrocity that he isn't as popular as Alan Moore or Clive Barker outside the comic field.  \n\nTreat your sslf to one of the best series beginnings in comics, but definitely leave a light burning","torrent":{"xt":"urn:btih:17872b36aca2224bb871c7c96661e646c7c012bf","amp;dn":"Essentials+-+Hellblazer+v1+%281988-1989%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"17872b36aca2224bb871c7c96661e646c7c012bf","infoHashBuffer":{"type":"Buffer","data":[23,135,43,54,172,162,34,75,184,113,199,201,102,97,230,70,199,192,18,191]},"announce":[],"urlList":[]}}