{"title":"Yoot Tower (Sim Tower 2) ISO image. Eng","uid":12218509,"size":425457409,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:18a81a82b673847e65165a928826e2a4605b9443&amp;dn=Yoot+Tower+%28Sim+Tower+2%29+ISO+image.+Eng&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"montoya86","files":3,"time":1439300921,"description":"This is the succesor to Sim Tower!\n\nThis torrent contains an ISO image of the US version, so you can burn or play it in a virtual machine, I also included a guide with hints and tricks for the game and all the scenarios which I didn't write but is very good.\n\nThe game is designed to run in Windows 9x, so bear it in mind: If you use Linux, Mac, or any modern form Windows, you should use a Virtual Machine. The free version of VirtualBox with Windows 98 installed on it does a very good job for me.\n\nThe game will run directly under Linux and Mac if you use wine, but you are going to need the cracked T2.exe from any abandonware page, as it won't detect the CD: I just did an ISO image from the ORIGINAL CD, so no crack to be found here.\n\nYou can also burn the image and try to install it, I tested it and works perfectly fine.\n\nIf you are using the Virtual machine method, and you run the game you'll get a warning asking you to switch to 256 colour mode: Just ignore it: The game will roon smooth anyway while a virtual machine with less colours than your physical machine will go really slow!","torrent":{"xt":"urn:btih:18a81a82b673847e65165a928826e2a4605b9443","amp;dn":"Yoot+Tower+%28Sim+Tower+2%29+ISO+image.+Eng","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"18a81a82b673847e65165a928826e2a4605b9443","infoHashBuffer":{"type":"Buffer","data":[24,168,26,130,182,115,132,126,101,22,90,146,136,38,226,164,96,91,148,67]},"announce":[],"urlList":[]}}