{"title":"The Twilight Zone - A Kind Of Stopwatch","uid":11073777,"size":168783872,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:1b335b5a2efd4632d3192b3c5716ea73ef887d0a&amp;dn=The+Twilight+Zone+-+A+Kind+Of+Stopwatch&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Mooseleg8","files":-1,"time":1411309505,"description":"Patrick Thomas McNulty, an obnoxious blow-hard who has an opinion for every possible situation and topic there is. People find him insufferable: his co-workers, the regulars at the bar he frequents, his boss as well. McNulty submits a grocery list of suggestions to really turn Cooper Corporations around. His boss, Mr. Cooper, dislikes his ideas wanting to keep his business simple. Cooper discards McNulty, along with all of his ideas. Patrick returns to his local watering hole. The bartender Joe has a talk with McNulty, trying to help him realize that the problem may be McNulty's personality, and the fact that he is responsible for alienating everybody. However, he doesn't drive everyone away tonight. There's one strange little man in a bar who seems as desolate and lonely as he is. A bizarre foreign man by the name of Potts. Well, misery loves company. Patrick buys him a beer. Potts is touched. These poor two seem to be made for each other. Patrick offers him the gift of friendship.","torrent":{"xt":"urn:btih:1b335b5a2efd4632d3192b3c5716ea73ef887d0a","amp;dn":"The+Twilight+Zone+-+A+Kind+Of+Stopwatch","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1b335b5a2efd4632d3192b3c5716ea73ef887d0a","infoHashBuffer":{"type":"Buffer","data":[27,51,91,90,46,253,70,50,211,25,43,60,87,22,234,115,239,136,125,10]},"announce":[],"urlList":[]}}