{"title":"Dead Can Dance - Dead Can Dance (1984) 2008 MFSL-SACD-DFF","uid":11098604,"size":1535040894,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:1b910fc7f6bc9e3780231132ca78dfead19a0ce5&amp;dn=Dead+Can+Dance+-+Dead+Can+Dance+%281984%29+2008+MFSL-SACD-DFF&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"hal4000","files":-1,"time":1411634733,"description":"Dead Can Dance is an English-Australian musical project that formed in 1981 in Melbourne by Lisa Gerrard and Brendan Perry. The band relocated to London, England, in May 1982. Australian music historian Ian McFarlane described Dead Can Dance's style as &quot;constructed soundscapes of mesmerising grandeur and solemn beauty; African polyrhythms, Gaelic folk, Gregorian chant, Middle Eastern mantras and art rock.&quot;\n\nEarly punk backgrounds and the like behind them, Perry and Gerrard created a striking, dour landmark in early-'80s atmospherics on their first, self-titled effort. Bearing much more resemblance to the similarly gripping, dark early work of bands like the Cocteau Twins and the Cure than to the later fusions of music that would come to characterize the duo's sound, Dead Can Dance is as goth as it gets in many places. Perry and Gerrard's wonderful vocal work -- his rich, warm tones and her unearthly, multi-octave exaltations -- are already fairly well established, but serve different purposes here. Thick, shimmering guitar and rumbling bass/drum/drum machine patterns practically scream their sonic connections to the likes of Robin Guthrie and Robert Smith, but they still sound pretty darn good for all that. When they stretch that sound to try for a more distinct, unique result, the results are astonishing. Gerrard is the major beneficiary here -- &quot;Frontier&quot; explicitly experiments with tribal percussion, resulting in an excellent combination of her singing and the rushed music. Then there's the astonishing &quot;Ocean,&quot; where guitar and chiming bells and other rhythmic sounds provide the bed for one of her trademark -- and quite, quite lovely -- vocal excursions into the realm of glossolalia. Perry in contrast tends to be matched with the more straightforward numbers of digital processing and thick, moody guitar surge. The album ends on a fantastic high note -- &quot;Musica Eternal,&quot; featuring a slowly increasing-in-volume combination of hammered dulcimer, low bass tones, and Gerrard's soaring vocals. As an indicator of where the band was going, it's perfect.\n\nDFF files extracted with Scarletbook\n &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/10942620/Scarletbook-SACD-Extractor&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/10942620/Scarletbook-SACD-Extractor&lt;/a&gt;\n\nfrom the 2008 Mobile Fidelity Sound Lab SACD.\n\nSACD-ISO-DFF-1Bit-2.8Mhz.","torrent":{"xt":"urn:btih:1b910fc7f6bc9e3780231132ca78dfead19a0ce5","amp;dn":"Dead+Can+Dance+-+Dead+Can+Dance+%281984%29+2008+MFSL-SACD-DFF","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1b910fc7f6bc9e3780231132ca78dfead19a0ce5","infoHashBuffer":{"type":"Buffer","data":[27,145,15,199,246,188,158,55,128,35,17,50,202,120,223,234,209,154,12,229]},"announce":[],"urlList":[]}}