{"title":"Sylwia Wiesenberg - Tonique Addicted to Movement DVDRip [MP4]","uid":12266273,"size":1778097926,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:29fa561e653ae20e7faee3e503eae6370fcc8352&amp;dn=Sylwia+Wiesenberg+-+Tonique+Addicted+to+Movement+DVDRip+%5BMP4%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"elessedilgirl","files":5,"time":1440240972,"description":"Tonique Addicted to Movement was created to help you make movement an integral part of your life, so that you become addicted to motion and never stop moving. It reflects my addiction to movement and my obsession with the human body and its unlimited possibilities. The human body is the greatest machine ever created. Treat your body well and challenge it with the proper workouts, and then reap the rewards! Tonique Addicted to Movement helps you to sculpt and firm your entire body. Tonique Addicted to Movement invites you to challenge yourself, to change the way your body works and to see the transformation. It is a giant step towards true fitness and a new lifestyle, using fitness as your tool to create a more confident you. Tonique Addicted to Movement was designed to be a step up from Tonique Premier the introductory workout to my method. A bit more than an hour long, it builds your confidence and teaches your body to adapt to a higher level of intensity. Addicted to Movement will help you build physical and mental toughness, elevate your fitness to the next level and prepare you to face the greater challenges of Tonique Born To Move and Tonique Femme Fatale with a positive attitude and a smile on your face! It will hurt so good! For those new to Tonique method, Tonique is not just fitness. It represents an entire lifestyle. It is about YOU and helping you understand and respect your body; to challenge it and push it further, to love it and to feel confident in it. I want you to love the body you own. However, if you want to feel and look great, you must respect yourself and your body. Feed it properly, hydrate it and move. Once you master your needs and desires, you can fully appreciate your body and you will feel confident in it. Respect Yourself with Movement. Become Positively Addicted!\n\nAddicted to Movement 1.18.46\nExpress 16.15\nSway 10.03\nVerve 7.13\nFace to Face (Interview) 20.52 (Lower Bit Rate - 834 kbps)\n\nVideo; x264; 720*480 (16:9); 1758 kbps; 29.970 fps\nAudio; aac; 160 kbps; 2 ch; 48.0 Khz","torrent":{"xt":"urn:btih:29fa561e653ae20e7faee3e503eae6370fcc8352","amp;dn":"Sylwia+Wiesenberg+-+Tonique+Addicted+to+Movement+DVDRip+%5BMP4%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"29fa561e653ae20e7faee3e503eae6370fcc8352","infoHashBuffer":{"type":"Buffer","data":[41,250,86,30,101,58,226,14,127,174,227,229,3,234,230,55,15,204,131,82]},"announce":[],"urlList":[]}}