{"title":"The Final Countdown Update (collection) ","uid":12163022,"size":28568816540,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:2d5de2decdf93a61c80ce10c03177dd412d9275c&amp;dn=The+Final+Countdown+Update+%28collection%29+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"one_last_round","files":33,"time":1437958373,"description":"The Final Countdown Update (collection) by Billy Crone\n\nMostly Christian Sermons:  Lectures with PowerPoints with some video clips.  Each video is about an hour.\n\nYou can download the videos here:\n\nAll 30 Studies on USB Flash Drive\nEASILY copy files and share with friends\nDVD Quality Video\nWatch on computer or smart TV with USB video port\nFree INTL shipping\n\nThings are changing fast! We're hurtling toward eternity at breakneck speed. Pastor Billy Crone brings us this first update to the popular Final Countdown series.\n\nThe ultimate sign that you're headed for the worst day of your life would have to be this...You wake up one morning only to realize that your family has suddenly disappeared. So you run to turn on your TV to see what's happening and there you watch a special worldwide news report declaring that millions of people all over the planet have simply vanished. As you spy the Bible on the coffee table, it suddenly dawns on you that your family was right after all when they kept telling you about the rapture of the Church. Then to your horror, you realize that you've been left behind and have been catapulted into mankind's darkest hour, the 7-year Tribulation that really is coming upon the whole world. But thankfully, God is not only a God of wrath; He's a God of love as well. And because He loves you and I, He has given us many warning signs to show us that the Tribulation is near and that His 2nd Coming is rapidly approaching. Therefore, The Final Countdown takes a look at 10 signs given by God to lovingly wake us up so we'd give our lives to Him before it's too late. These signs are the Jewish People, Modern Technology, Worldwide Upheaval, The Rise of Falsehood, The Rise of Wickedness, The Rise of Apostasy, One World Religion, One World Government, One World Economy, and The Mark of the Beast. Like it or not folks, we are headed for The Final Countdown. Please, if you've haven't already done so, give your life to Jesus today, because tomorrow may be too late!","torrent":{"xt":"urn:btih:2d5de2decdf93a61c80ce10c03177dd412d9275c","amp;dn":"The+Final+Countdown+Update+%28collection%29+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2d5de2decdf93a61c80ce10c03177dd412d9275c","infoHashBuffer":{"type":"Buffer","data":[45,93,226,222,205,249,58,97,200,12,225,12,3,23,125,212,18,217,39,92]},"announce":[],"urlList":[]}}