{"title":"FIFA 14 by EA SPORTS ANDROID","uid":12120802,"size":22091042,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:30b2e9bbd199c3fc4a937ad99aabe017aa57f122&amp;dn=FIFA+14+by+EA+SPORTS+ANDROID&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":3,"uploader":"Moroj","files":1,"time":1436819748,"description":"REAL PLAYERS. Real team. THIS LEAGUE.\nWelcome to the most authentic football simulation for devices running Android. Immerse yourself in the exciting game: feel every ball and strike, engage in an intense struggle in the selection and defense - and all this with the new touch control. Find yourself in the place of the players from the world of real football with the regime of EA SPORTS â„¢ Football Club Match Day. Always be in the game!\n\nFeel the excitement\nIt features 33 leagues, 600 licensed teams and more than 16,000 players. From the English Premier League and the Spanish La Liga, German Bundesliga, and other football championships. Get fame 34 real-life stadiums. And for the first time on mobile devices working for you English, French, German, Italian and Spanish commentators!\n\nCRAZY MATCH DAY\nWith Football Club Match Day you will feel the rhythm of life of your favorite club. Play games in the real world of football in the best leagues. Every injury, disqualification and any command change will be reflected in the game - no matter where you are, real football will always be with you!\n\nCreate unique teams in the ULTIMATE TEAM\nCollect and share, buy and sell players FIFA, to create your dream team. Select the style and tactics, team uniforms, and much, much more. Participate in tournaments, earn coins and spend on new players and necessary items to improve your club. Compete for free or purchase playsets. The choice is limitless!\n\nNEW INTUITIVE TOUCH CONTROL\nNavigate through the field, holding and dragging players. Give transmit the touch, spending on the screen to perform a blow - it's the least of what you are capable of! C new intuitive touch control FIFA 14 the most popular sport will report every movement of your fingers.\n\nLight up the STYLE FIFA\nThe new soundtrack offers popular artists from the Empire of the Sun to Vampire Weekend. Such a grand playlist could only give you a FIFA!\n\nWant more ?!\nPerfect game and get access to three distinct modes: the coach, tournament and quick match","torrent":{"xt":"urn:btih:30b2e9bbd199c3fc4a937ad99aabe017aa57f122","amp;dn":"FIFA+14+by+EA+SPORTS+ANDROID","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"30b2e9bbd199c3fc4a937ad99aabe017aa57f122","infoHashBuffer":{"type":"Buffer","data":[48,178,233,187,209,153,195,252,74,147,122,217,154,171,224,23,170,87,241,34]},"announce":[],"urlList":[]}}