{"title":"Volgarr the Viking v1.33b","uid":11087339,"size":154799454,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:3172dc3d40b288015ee868a2b93b136a1e156ef2&amp;dn=Volgarr+the+Viking+v1.33b&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Lamasu","files":-1,"time":1411431799,"description":"Remember when games were tough? Return to the Golden Age of arcades with an all-NEW hardcore action experience that pulls no punches. Volgarr the Viking possesses all the hallmarks of the true classics - simple controls, high challenge, and meticulous design - combined with hand-made pixel animation, an epic soundtrack, and buckets of blood. Flex your gaming muscles and step into the arena with Volgarr the Viking. We dare you.\n\n- Classic hardcore arcade action!\n- Seven worlds to explore across 30+ maps\n- 40+ unique traps and enemies, including screen-filling bosses\n- Thousands of frames of handcrafted pixel animation\n- Orchestrated soundtrack\n- Meticulous control design with full customization\n- Dinput and Xinput support for controllers\n- Steam achievements and leaderboards\n- Multiple paths through the game and multiple endings\n- Awesome retro-style game manual! \n\nIncludes GOG content (manual + wallpaper + avatars).\n\nChangelog:\nv1.33b:\n- Faster loading times - up to half the time it took before, depending on your machine.\n- Fixed invisible World 4 boss when using OpenGL render option.\nv1.33:\n- Fixed an exploit that allowed opening the same chest over and over again, gaining infinite gold (points) and items.\nv1.32:\n- Fixed game no longer properly checking the Steam Leaderboards and updating the local high score data (including ability to skip worlds) when playing on a different computer.\nv1.31:\n- Added an obvious message about skipping worlds you've completed before to make it clear that the game DOES include a form of progress-saving.\n- Added an optional OpenGL-based graphics engine, as a possible solution for anyone having issues with Direct3D on their system.\n- Added an optional SDL-based sound and music engine, which can be selected in the Sound Options menu (as long as the game can find SDL2.dll in your system's PATH somewhere or in the same folder as the game's .exe file - see http://www.libsdl.org/ for details), as a possible solution for anyone having issues with DirectSound on their system.\n- Added a new scaling filter to the Graphics Options menu, titled &quot;Bilinear X2&quot;, which should look crisper than Bilinear yet avoid the uneven pixel sizes seen with Point filtering (basically halfway between the two filters previously available). NOTE: This filter will not work on all resolutions on all systems - in the cases where it doesn't work it will look the same as normal Bilinear.\n- Fixed an incorrectly-looping ambient sound in the first level.\n- It is now possible to request a specific graphic/sound/music engine via command-line parameters, useful for troubleshooting when can't get to the pause menu. -graphics=# (1-dx9, 2-opengl, 3-dx7), -sound=# (0-no sound, 1-DSound, 2-SDL), -music=# (0-no sound, 1-DSound, 2-SDL), -soundquality=# (1-4, only applies to SDL currently).\n\nFor the full changelog, see changelog.txt.\n\n\nIf you like the game, support the developer, buy it!  &lt;a href=&quot;\nhttp://store.steampowered.com/app/247240/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://store.steampowered.com/app/247240/&lt;/a&gt;","torrent":{"xt":"urn:btih:3172dc3d40b288015ee868a2b93b136a1e156ef2","amp;dn":"Volgarr+the+Viking+v1.33b","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3172dc3d40b288015ee868a2b93b136a1e156ef2","infoHashBuffer":{"type":"Buffer","data":[49,114,220,61,64,178,136,1,94,232,104,162,185,59,19,106,30,21,110,242]},"announce":[],"urlList":[]}}