{"title":"ExploitedCollegeGirls - Sara NEW 20 August 2015","uid":12260700,"size":419517724,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:327d34759fd96810a5fa3a0c233607da4cab7016&amp;dn=ExploitedCollegeGirls+-+Sara+NEW+20+August+2015&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"xxxlavalxxx","files":2,"time":1440164899,"description":"Sara is just about perfect: perky tits with sensitive nipples, a sexy tan lined girl next door body, a pretty face and she just happens to be a bit of a nymphomaniac. How can we make that advanced psychological diagnosis from just a few bits of video? All nymphos have a tell - if a girl ever mentions that she doesn't masturbate because she has sex whenever she wants? Yeah, she a nympho.We get to know about Sara's free spirited ways in the behind the scenes interview where Jay rolls through his list of probing questions. While he covers the important stuff: threesomes, masturbation habits, etc. he finally gets an answer that stops him in his tracks. This is a guy who, until he met Sara, was certain that he had heard everything a girl could possibly call a turn on until Sara quietly mentions how sexy she finds shemales. It's simple math, she points out, she loves dicks and she loves titties, why not combine the two?Soon enough, Sara gets naked and ready for sexy time. Jay starts in with his fingers on her meaty, bare pussy and then things get wetter and more intense when he switches to a vibrator. Judging by the way she squirms and moans and the way her pussy creams up, Jay must be doing something just right. Before she is too far gone, he has her drop to her knees for oral. Which leads to a fantastically slow and sensual beej that awesomely transforms into some fully inverted deep throat face fucking.As always, Jay's dying to get at that creamy pussy and he pulls Sara up to the bed to fuck her. He drills her on her back, then he pulls her onto the bed to clean his dick with her tongue for a bit as he finger bangs her. When he flips her onto his lap for some serious cowgirl pounding, she's totally blissed out. Finally, Jay puts her on her knees and allows her to liberate a couple of full spurts directly into her waiting mouth. So, yeah, she a nympho.\nTags: Deep Throat, Blowjob, Ball Licking, Facial, Sex Toys, Amateur, Casting, POV, Hardcore\n &lt;a href=&quot;\nhttp://imgdone.com/viewer.php?file=61294151756463364369.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgdone.com/viewer.php?file=61294151756463364369.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://imgdone.com/viewer.php?file=95508503842447652619.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgdone.com/viewer.php?file=95508503842447652619.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:327d34759fd96810a5fa3a0c233607da4cab7016","amp;dn":"ExploitedCollegeGirls+-+Sara+NEW+20+August+2015","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"327d34759fd96810a5fa3a0c233607da4cab7016","infoHashBuffer":{"type":"Buffer","data":[50,125,52,117,159,217,104,16,165,250,58,12,35,54,7,218,76,171,112,22]},"announce":[],"urlList":[]}}