{"title":"Dallas Cowboys Cheerleaders Making the Team S09E08 The Payoff WE","uid":11118866,"size":194959051,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:32bc7018e0af6f353ba0d995b35b2d2a24440ecb&amp;dn=Dallas+Cowboys+Cheerleaders+Making+the+Team+S09E08+The+Payoff+WE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"herbsmokinfreak","files":1,"time":1411888966,"description":"FINALE\n\nThe final day of training camp has everyone nervous because Kelli and Judy might take a squad of less than 36. After some tough decisions, fear turns to elation as the final team is announced. Things start to become real at the squad photo as the girls get their uniforms and take a photo that will forever cement their place in DCC history. Meet the team brings about the first performance. Lead by the show group, the girls pull off a high level stage show without much rehearsal. Kelli takes the girls camping, and team bonding begins at the hog hunt. However, a turn of events sends everyone running for cover. Game day is excitement and memories that will last a lifetime, but there is some unexpected drama as nerves start getting to a few girls. Will the rookies be able to uphold the famed DCC reputation and have a flawless performance? Melissa Rycroft makes a surprise visit to congratulate the girls on their dreams coming true. \n\n\nIt was a great year. Sad to see Vivianne go but you can't cure crazy. \n\nHave a great year DCC!! See you all next year, Thanks for watching.\n\nEnjoy!\n\n420","torrent":{"xt":"urn:btih:32bc7018e0af6f353ba0d995b35b2d2a24440ecb","amp;dn":"Dallas+Cowboys+Cheerleaders+Making+the+Team+S09E08+The+Payoff+WE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"32bc7018e0af6f353ba0d995b35b2d2a24440ecb","infoHashBuffer":{"type":"Buffer","data":[50,188,112,24,224,175,111,53,59,160,217,149,179,91,45,42,36,68,14,203]},"announce":[],"urlList":[]}}