{"title":"Creedence Clearwater Revival (1968, flac)","uid":12141658,"size":391864341,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:3373c8fbcdcf5dc639a2b555162ded80df30c6f6&amp;dn=Creedence+Clearwater+Revival+%281968%2C+flac%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":5,"uploader":"Archivist_of_the_Damned","files":26,"time":1437356866,"description":"Creedence Clearwater Revival (1968, flac)\n\nThe eponymous first album of the San Francisco group that would ultimately be associated with Southern musical traditions. It's hard to wrap your head around the fact that CCR came from San Francisco because of their idiosyncratic sound compared to the psychedelic rock usually characterized from the city.  John Fogerty was thinking along those same lines when he deliberately recorded a cover of Dale Hawkin's &quot;Susie-Q&quot; as a acid-washed tour de force complete with disembodied voices with cymbal crashes.  He wanted a single that sounded progressive enough to be played on local rock stations, yet still retain the ability to attract dancers through a rock-solid hook. \n\nWhile the album isn't as strong overall as later attempts, it does provide vital seeds for what would become Southern Rock in the Seventies and would ultimately transform modern country music.  However, CCR's musical roots of R&amp;B and Rock'n' Roll mix with their own peculiar chemistry to create a new sound merely steps away from their influences - Swamp Rock.  &quot;Susie-Q&quot; is transformed from a rockabilly rave-up into an intense, brooding rumination that borders on obsession.  Hawkin's signature reverb-drenched riff is cut to one string and slowed down to create an ominous atmosphere.  \n\nScreaming Jay Hawkins's &quot;I Put a Spell on You,&quot; is turned into a guitar-driven powerhouse awash.  &quot;Ninety-Nine and a Half,&quot; is an overpowering rendition of the Wilson Pickett classic that pits Fogerty's voice against a whiplash rhythm section that should have been released as a single instead of &quot;Porterville&quot; or &quot;Walking on Water.&quot;\n\nA solid disc that shows the band still growing into its legendary sound which would dominate the charts during the next two years.  Enjoy!","torrent":{"xt":"urn:btih:3373c8fbcdcf5dc639a2b555162ded80df30c6f6","amp;dn":"Creedence+Clearwater+Revival+%281968%2C+flac%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3373c8fbcdcf5dc639a2b555162ded80df30c6f6","infoHashBuffer":{"type":"Buffer","data":[51,115,200,251,205,207,93,198,57,162,181,85,22,45,237,128,223,48,198,246]},"announce":[],"urlList":[]}}