{"title":"Simple Scene, Sensational Shot (Photography) [PDF] [StormRG]","uid":11101849,"size":27798693,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3900536b9cb121ec64eb9615ebdaf08eeac1e738&amp;dn=Simple+Scene%2C+Sensational+Shot+%28Photography%29+%5BPDF%5D+%5BStormRG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"krystine","files":-1,"time":1411678352,"description":"Simple Scene, Sensational Shot: Artistic Photography from Any Environment\nAuthor: Simon Bond\nPublished: 2012\nPublisher: Focal Press\nISBN: 9780240821108\nFormat: Retail PDF\nReader Required:Adobe Reader, Foxit, Nitro, Adobe Digital Editions\n\nTested on the above readers with no problems on laptop and Android tablet. \nDon't hesitate to PM me if you have any questions or problem with the download, as comments on the torrent are easy to miss. \nPlease allow a couple seconds for the seedboxes to kick in, then it should move pretty quick.\nEnjoy! \n\n\nHow many of us have put the camera away after a holiday to a far off exotic location? This book will show you how to make the most of your local area to make outstanding photos. A wealth of techniques and creative approaches will open your eyes to the beauty that surrounds you everywhere, and make you see the world with new eyes. Not only is the book packed with technical tips, but there's a chapter which can act as your guide as you explore anywhere with a camera. This book will also take you through different approaches to making a series of photos, for your own enjoyment or display, so you can create masterpieces that tell a story from their place on the wall, not just your memory card. Having read this book you'll never put the camera down in your neighborhood, and when you do travel to that exotic destination you can expect even more stunning results from your photography than ever before.","torrent":{"xt":"urn:btih:3900536b9cb121ec64eb9615ebdaf08eeac1e738","amp;dn":"Simple+Scene%2C+Sensational+Shot+%28Photography%29+%5BPDF%5D+%5BStormRG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3900536b9cb121ec64eb9615ebdaf08eeac1e738","infoHashBuffer":{"type":"Buffer","data":[57,0,83,107,156,177,33,236,100,235,150,21,235,218,240,142,234,193,231,56]},"announce":[],"urlList":[]}}