{"title":"Pip-Boy 3000 Live Wallpaper v1.16 APK (Android)","uid":12212752,"size":2191285,"categoryP":"applications","categoryS":"android","magnet":"?xt=urn:btih:3d8a01d833ea0726ac304877474936c2ae3f0d31&amp;dn=Pip-Boy+3000+Live+Wallpaper+v1.16+APK+%28Android%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Pahly","files":1,"time":1439151885,"description":"Transform your device into a Pip-Boy 3000 from Fallout 3 and New Vegas, with this fully animated and customizable live wallpaper!\n\nFeatures:\nAnimated background and foreground scanlines\nExtremely customizable and easy to use Settings menu\nMaterial Design! (for Settings menu)\nConfigurable opacity, color, thickness, animation speed, framerate, font size and more!\nIncludes 8 preset color themes, including classic Fallout 3 green and New Vegas amber, as well as a new color changing Rainbow theme and a Battery theme that changes from green to red to indicate your phone's battery level!\nAllows the use of custom colors so you can style your Pip-Boy as you prefer\nEmblems from various factions and organizations across the Wasteland which you can apply to your Pip-Boy's background\nUI frames with built-in clock, battery indicator and date widgets that are both toggleable and resizable\nRuns on both low and high DPI devices, with plenty of settings to help tweak things for your specific needs. Change animation speeds, effect opacity/transparency, change themes or specify your own colors! Check your battery and the time with toggle-able widgets, or select an emblem to show your support for various Fallout factions like the Brotherhood of Steel and the Enclave.\n\nThis app is fan-made and is in no way official. The development of this app is in no way affiliated with Bethesda Game Studios or Zenimax. Fallout, Pip-Boy 3000, Brotherhood of Steel are all registered trademarks of Zenimax and Bethesda Softworks.\n\nWhat's in this version : \nNew Emblems for Great Khans and Vault Boy!\nNew Themes: Clean, Projector and Grid. Recommend turning off background scanlines for these particular themes.\nBrightness Preference: Many of you have complained that your background is a bit too dark, so I've added a brightness slider in the settings menu to help you boost your brightness!\nThese features were all user suggestions, so thanks to everybody coming up with new ideas for the app! Let me know what else you want to see in coming updates\nRequired Android O/S : 2.1+","torrent":{"xt":"urn:btih:3d8a01d833ea0726ac304877474936c2ae3f0d31","amp;dn":"Pip-Boy+3000+Live+Wallpaper+v1.16+APK+%28Android%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3d8a01d833ea0726ac304877474936c2ae3f0d31","infoHashBuffer":{"type":"Buffer","data":[61,138,1,216,51,234,7,38,172,48,72,119,71,73,54,194,174,63,13,49]},"announce":[],"urlList":[]}}