{"title":"DC Talk - Welcome to the Freak Show ","uid":11083426,"size":4356847616,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:4349451df4f4f2a88843d4fd6450bd07273b5846&amp;dn=DC+Talk+-+Welcome+to+the+Freak+Show+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":3,"uploader":"odntht","files":1,"time":1411432161,"description":"Welcome to the Freak Show is the name of a live audio and video recording by DC Talk. Chronicling the Jesus Freak Tour in the spring of 1996, they were released separately two months apart in 1997 on CD and VHS, respectively. A DVD version was later released in 2003. Each version has been certified gold by the RIAA (audio for 500,000 units and video for 50,000 units sold). Track listings differ slightly between the two. Select videos included a bonus audio disc that remains one of the rarest recordings in the DC Talk catalog. The audio version won the 1998 Grammy Award for Best Rock Gospel Album.\n\ni've been looking this dvd and cant find in anywebsite, so i've buyed and now sharign with you guys!\ni not a regullar seeder, so i'll seed when i can, but i promisse to try to seed always in the night till morning (UTCâˆ’3) in brazilian time, i'ts almost the same in most US.\n\nand i wanna keep this torrent 4ever till i live, so if this torrent die, just mail me \nand i'll try to put back in line!\n\nthanks and if u really enjoy this band, please buy their cds and dvds!\nand sorry for my english, i'm brazilian, so non-english native speaker\n:P\n","torrent":{"xt":"urn:btih:4349451df4f4f2a88843d4fd6450bd07273b5846","amp;dn":"DC+Talk+-+Welcome+to+the+Freak+Show+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4349451df4f4f2a88843d4fd6450bd07273b5846","infoHashBuffer":{"type":"Buffer","data":[67,73,69,29,244,244,242,168,136,67,212,253,100,80,189,7,39,59,88,70]},"announce":[],"urlList":[]}}