{"title":"EXPLOITED COLLEGE GIRLS - Hailey - 19 Years Old 720p *NEW*","uid":11123461,"size":1900511585,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:43b040e7e41549c2dbe521f90a8ef94a20a31131&amp;dn=EXPLOITED+COLLEGE+GIRLS+-+Hailey+-+19+Years+Old+720p+%2ANEW%2A&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"beta2008x","files":1,"time":1411948012,"description":"   &lt;a href=&quot;\nhttp://imgboxxx.com/viewer.php?file=r5d7l_hyl.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgboxxx.com/viewer.php?file=r5d7l_hyl.jpg&lt;/a&gt;\n   &lt;a href=&quot;\nhttp://imgboxxx.com/viewer.php?file=qilfq_ecghailey720_s.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgboxxx.com/viewer.php?file=qilfq_ecghailey720_s.jpg&lt;/a&gt;\n\n\nThere's no better word for 19 year old Hailey than adorable. From her softly tan lined backside to her perfect teenage tits to her big, mischievous smile this girl is simply adorable. She's got this combination of prettiness, sexiness, and enthusiasm that make it a pleasure to watch her get fucked.\nJay makes a heck of a drive to find this girl out in some remote desert town and the ride back gives us plenty of time to get to know her. Alas, she's a pretty average 19 year old and the conversation dies up pretty quickly when we edit out the parts about pointless pop music, her philosophy on selfies and her favorite reality tv stars. Fortunately our man Jay always knows how to fill awkward silences - the same way he fills most voids: with his cock. He pulls off the interstate for a nice little road head session to allow Hailey to show off her oral skills. Despite having only begun giving blowjobs a few years ago, this girl is a natural and her skills are matched by her sexy enthusiasm.\nEventually they get back to the hotel for the actual shoot and things only get better. As Hailey selects a sex toy from the Ex Co Gi toybox, she can't help but slip the tip in her mouth, giving Jay the hint that's she not quite finished with the oral session from the car. When she drops to her knees, you can tell she loves sucking cock as much as we love watching her do it. Jay, however, wants a chance at that pussy so he moves her to the bed.\nHailey admitted early in the shoot that it had been a while since she had sex and it certainly shows. Jay fucks her pussy raw from angle after angle as she moans and pants her way to orgasm after orgasm. Eventually they end up in cowgirl where Hailey demonstrates amazing hip control as she rides Jay's cock to completion and lets him fill her pussy full of cum.\t","torrent":{"xt":"urn:btih:43b040e7e41549c2dbe521f90a8ef94a20a31131","amp;dn":"EXPLOITED+COLLEGE+GIRLS+-+Hailey+-+19+Years+Old+720p+%2ANEW%2A","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"43b040e7e41549c2dbe521f90a8ef94a20a31131","infoHashBuffer":{"type":"Buffer","data":[67,176,64,231,228,21,73,194,219,229,33,249,10,142,249,74,32,163,17,49]},"announce":[],"urlList":[]}}