{"title":"Europa Gooniversalis - Europa Universalis IV mod","uid":11096248,"size":8068014,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:448dfa574f9010c55526e2766f4271f834df2d34&amp;dn=Europa+Gooniversalis+-+Europa+Universalis+IV+mod&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Nimbleton","files":-1,"time":1411601794,"description":"Europa Gooniversalis - Europa Universalis IV mod\n\n\nDESCRIPTION\nEuropa Gooniversalis is a sort of grab-bag alternate history mod full of stuff that a bunch of Something Awful goons and I find interesting or entertaining. It started as a CK2+ conversion of a Khazaria game I played last year, but has grown quite a bit. I'm inspired by the EU3+ and Miscmods tradition of making the game more fun without unnecessarily complicating things. Here's a quick list of stuff:\n\nGeneral\nNon-western tech penalties have been lessened, and the monarch point penalties for some tech groups totally removed.\nNew religions (from the CK2 religion converter): Teotl (Aztec), Inca, Romuva, Zoroastrian, Norse, Tengri, and Fetishist.\nNew idea sets for: Swabia, Azerbaijan, Wales, Transylvania, Wallachia, Bhutan, Occitain nations, Bulgaria, Pannonia, Magna Graecia, Khazaria, Nanman, Shu, Wei, Wu, Yuan, Kansu, Iraq, Crete, Georgia, Persia, Walloon cultures, Flemish cultures, Afghanistan, Crete, Apache, Cree, Moldavia, Finland and Sicily, with more coming.\n\nSpecial gov types for Bhutan and Khazaria.\nExtra formable tags, lots of them retooled versions of stuff from Wiz's EU3+: Turkestan, Maghreb (a north african union), both normal and Muslim China, Great Albion (Scottish UK analogue), Occitania, Iberia, Arabia, Illyria, and more.\n\nWestern Europe\nThe major powers have been balkanized - England is divided into Wessex and Mercia, France has strong Occitain opponents in the south, Burgundy has no northern holdings, Spain faces a resurgent Al-Andalus, and Austria is a minor nation on the edge of a Swabian-led Holy Roman Empire.\nNorthern Europe Iceland is independent, as are Finland and Sameland. Oh, and all of these nations are Norse religion. Eastern Europe Bohemia is not part of the HRE, and is instead very close to Poland - the Polish-Bohemian Commonwealth is a possibility. Lithuania, Latgola and Estonia follow their native Romuva faith. Muscovy is totally gone - the major Russian power is Kiev, with close seconds in Novgorod and Tver. There are no Ottomans - Byzantium, though, has been split between Nicaea in the East and Thessalonica in the West. Bulgaria grabbed Constantinople during the initial civil war. Both nations want to take it back and reform the Empire by defeating the rival dynasty. Caucasus/Middle East The Jewish Khazar Khaganate rules a religiously-divided northern Caucasus. To the south, a strong, independent Armenian kingdom faces a very powerful Azerbaijan (thanks Wiz). The Mamluks are much weaker, holding Egypt and the Levant up to Jerusalem. Syria and Iraq are independent. Zoroastrian Persia is a thing, Timurids are pretty tiny and usually get eaten by their neighbor Khwarizm. Arabia is a formable tag. India/Asia The bigger nations of India are broken up so you don't always see Vijayanagar win. China is a totally different creature, divided into 13 different nations, some of which are based very loosely on the Three Kingdoms period. It's a thunderdome. Also: the mighty dragon kingdom of Bhutan stands ready to conquer the world. New World I have not touched this yet save to give the Aztec and Inca their proper religions from the CK2 converter. Some credits A bunch of SA goons, particularly Last Emperor and Obliterati, for help with China and bugfixes/ideas elsewhere. Also Dibujante, another goon, for contributing like a dozen idea groups. Holy â™¥â™¥â™¥â™¥ Dibujante owns. Yet another goon, TheBasqueGuy, contributed Prester John's ideas and flag. Sammvt (yet another another goon) did ideas for Iraq and Zoroastrian Persia. And all three Romanian nations, and Sicily, and Finland. Holy â™¥â™¥â™¥â™¥ he's done a lot. Wiz for CK2+ and EU3+, lots and lots of ideas and some stuff poached wholesale by /gsg/ mod which I've taken here. (Arabia, Illyria, etc) Pirie Zanhuf for Walloon, Flemish and Cretan ideas. DarkCrawler for Thessalonica and Nicaea's flags! The Re-Reconquista mod is partially integrated. Lulu's campaign tweaks partially integrated (about half a dozen extra tags!). TweaksnFixes (again, here on Steam - not integrated but may in the future). Better Terra Incognita is integrated. The Kingdom of God mod for the papacy is integrated. Colony Name Change mod is integrated. World Colonization by edwardianed. Dravidian Mod (multiple formable tags in India) integrated. Cosmopolitaine -&gt; Francois integrated. NeonDT for Florence. Bleergh for the Graphical Map ImprovementSome other stuff I've forgottten probably.","torrent":{"xt":"urn:btih:448dfa574f9010c55526e2766f4271f834df2d34","amp;dn":"Europa+Gooniversalis+-+Europa+Universalis+IV+mod","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"448dfa574f9010c55526e2766f4271f834df2d34","infoHashBuffer":{"type":"Buffer","data":[68,141,250,87,79,144,16,197,85,38,226,118,111,66,113,248,52,223,45,52]},"announce":[],"urlList":[]}}