{"title":"SUPER DISTRO v2.5.61","uid":12216290,"size":80156584,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:47a301a307529e6f6e488db5307c6f49390018d0&amp;dn=SUPER+DISTRO+v2.5.61&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"dauphong","files":1,"time":1439236688,"description":"CONQUER THE BATTLEFIELD WITH SUPER-POWERED ABILITIES AND THE SKILL OF YOUR HOARDING!\n\n&quot;SUPER DISTRO&quot; is a hard-as-nails (Seriously, Who comes up with these idioms?) 2D platformer in the style of retro games such as Megaman, Super Mario Bros 2: The Lost Levels and other such rage-inducing classics. Taking &quot;Difficult gameplay&quot; to a whole new level - SUPER DISTRO is not for the faint-of-heart. You will die again and again. The weak need not apply - Only those who are determined to overcome impossible odds will find victory here and those are the rules of the land in SUPER DISTRO.\n\nIn the words of a certain sour-tasting character from a popular television show: &quot;We've have it all!&quot;\n\n&quot;SUPER DISTRO&quot; is hopefully unlike anything you've ever played before (We promise that's a good thing!) - Taking familiar staples of excellent games of yesteryear and throwing bucketloads of creativity and innovation (And wall-punching difficulty!) on top; You'll be delighted with the result! Everything has been loving handcrafted by a single guy (With a little help from his friends!) to make sure SUPER DISTRO a stupidly enjoyable, Yet rage-inducing experience","torrent":{"xt":"urn:btih:47a301a307529e6f6e488db5307c6f49390018d0","amp;dn":"SUPER+DISTRO+v2.5.61","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"47a301a307529e6f6e488db5307c6f49390018d0","infoHashBuffer":{"type":"Buffer","data":[71,163,1,163,7,82,158,111,110,72,141,181,48,124,111,73,57,0,24,208]},"announce":[],"urlList":[]}}