{"title":"Batman - The Animated Series","uid":12137737,"size":18500058057,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:4cda3fb5aa73beac3b9ad1c8ce6725f67bce52cc&amp;dn=Batman+-+The+Animated+Series&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"afronigga6","files":109,"time":1437260771,"description":"In 1992, the birth of Warner Bros. Batman: The Animated Series changed the animation and the Batman saga forever. Based out of the dark style of Tim Burton's 1989 movie, along with the new style of animation, the dynamic series spawned a new technique in animation using black backgrounds that would eventually be dubbed &quot;Dark Deco.&quot; Dark Deco gave every scene within Gotham an extraordinary look, redefining the image of the city. The series also revamped the classic characters, casting a unique perspective on their origins and personalities. The series included all the popular characters and even created some new ones. The most significant change was the transformation of the Dick Grayson/Robin character in the &quot;new&quot; 90's costume, resulting in a hipper more adult representation which the character has never seen. The Batman character continued to embody the dark image fans have come to love while maintaining the heroic qualities identified with the character.\n\nAnother significant change was the transformation of the Rogues Gallery of Villains. From the ever-popular Joker to the more obscure Clock King, the series displayed each villain's unique personality to perfection and introduced new characters, including the popular Ms. Harley Quinn. Although she wasn't born into the Batman universe until the seventh episode of the series, Harley quickly overshadowed such long time favorites as Catwoman and Poison Ivy. Thanks to the cartoon, Harley Quinn will be a staple in the Batman genre forever. \n\nIn Fall 1995, the final five episodes aired (85 total episodes were produced) and the curtain closed on Batman: The Animated Series. \nYes, shameless copying and pasting","torrent":{"xt":"urn:btih:4cda3fb5aa73beac3b9ad1c8ce6725f67bce52cc","amp;dn":"Batman+-+The+Animated+Series","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4cda3fb5aa73beac3b9ad1c8ce6725f67bce52cc","infoHashBuffer":{"type":"Buffer","data":[76,218,63,181,170,115,190,172,59,154,209,200,206,103,37,246,123,206,82,204]},"announce":[],"urlList":[]}}