{"title":"Schlumberger OFM Manager 2014.1","uid":12135466,"size":846615433,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:52779cf30ab74e4aa4c5f068af14df0d80d209d6&amp;dn=Schlumberger+OFM+Manager+2014.1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"yousef86","files":9,"time":1437166444,"description":"Schlumberger OilField Manager 2014.1 [OFM] | 807 MB\n===================================================\n\n\nSchlumberger, the world's leading supplier of technology, integrated project management and information solutions to customers working in the oil and gas industry worldwide, presents OilField Manager (OFM) 2014.1 - last release a powerful suite of modules developed by Schlumberger Information Solutions and designed to aid in the day-to-day surveillance and management of oil and gas fields.\n\nOilField Manager (OFM) is a powerful suite of modules developed by Schlumberger Information Solutions and designed to aid in the day-to-day surveillance and management of oil and gas fields. OFM provides an intuitive, user-friendly interface enabling you to view, modify, and analyze production and reservoir data within the Microsoft Windows environment. You can also perform basic and/or complex analyses for individual or multiple completions, groups of well, an entire field, or several fields. OFM is the ideal tool for all work environments and users. OFM is ideally suited for the occasional user, yet sophisticated enough for advanced petroleum engineering analysis. Whether at the well site, office, or home OFM enables you to access or load data from both local desktop and corporate repositories, such as Oracle and SQL Server databases\n\nKey features of this release:\n-----------------------------\n\nThis release focuses exclusively on extensibility, through a .NET API. The API will be &quot;exposed&quot; at two levels in the application: firstly in the form of plugins which will act like existing System Functions. These are termed Plugin Functions, and it is intended that the end user be empowered to create them. At a higher level, Plugin Analyses will function as if they were native OFM modules, i.e. they can have their own ribbon icons, Analysis pane representations, Properties pane, and most importantly, their own visualization space. While this level is expected to be beyond the abilities of the casual, day-to-day end user, nevertheless the API offers clients the ability to build into the application their own IP (e.g. in-house fluid correlations) or customized workflows that may be client- or location-specific, and as such unlikely to form part of the normal\ncommercialization processes for OFM.\n\nAcknowledging that the API is a significant departure from the conventional way of using OFM, a new and separate &quot;Getting Started with the OFM API&quot; document is also included\n\nAbout Schlumberger\n-----------------=\n\nSchlumberger is the world's leading supplier of technology, integrated project management and information solutions to customers working in the oil and gas industry worldwide. Employing approximately 115,000 people representing over 140 nationalities and working in approximately 85 countries, Schlumberger provides the industry's widest range of products and services from exploration through production.\n\nInstructions:\n-------------\n1. Unrar and install the app.\n2. Replace original .dll with the patched one","torrent":{"xt":"urn:btih:52779cf30ab74e4aa4c5f068af14df0d80d209d6","amp;dn":"Schlumberger+OFM+Manager+2014.1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"52779cf30ab74e4aa4c5f068af14df0d80d209d6","infoHashBuffer":{"type":"Buffer","data":[82,119,156,243,10,183,78,74,164,197,240,104,175,20,223,13,128,210,9,214]},"announce":[],"urlList":[]}}