{"title":"Bangkok Room Maid Buggered For New Handbag","uid":12156676,"size":671105748,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:56672185319fe7e08b1d2ef710a8c5fb2017d2fa&amp;dn=Bangkok+Room+Maid+Buggered+For+New+Handbag&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"sarah.jensen","files":1,"time":1437797870,"description":"Get a cheap fucking gorgeous street slut with the perfect figure to do whatever you want. I dressed Melba up in a too short skirt and stockings and got her to clean my apartment. Great watching that clean my tables. Don't fancy your fat ugly wife that needs a divorce. I can do what I want with Melba. I fucked her up the ass, deep between her lovely little buttocks in her tight clean smelling sphincter. I promised her enough money for a new fake handbag and she said she would do anything. I slapped in in irons, put her in the big wooden stocks, and buggered her up the ass again. Fucking lovely. She does anything for a little money. Ask her what she wants and she will request a fortune, expect a new car and a house on a big estate. If you were stupid enough to buy it for her, she would never open her legs again. Lovely slim legs, small round pert bottom, slim hips and my ejaculate in her anus. Probably not just mine. Hundreds of guys regularly fuck her up all three holes, but if you want to make her respectable you can, and she will be your biggest headache. Not mine. I treat her well on video. High definition super sleek, ass quenching beautiful bugger babe","torrent":{"xt":"urn:btih:56672185319fe7e08b1d2ef710a8c5fb2017d2fa","amp;dn":"Bangkok+Room+Maid+Buggered+For+New+Handbag","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"56672185319fe7e08b1d2ef710a8c5fb2017d2fa","infoHashBuffer":{"type":"Buffer","data":[86,103,33,133,49,159,231,224,139,29,46,247,16,168,197,251,32,23,210,250]},"announce":[],"urlList":[]}}