{"title":"Hod - Serpent  mp3 (2009)","uid":11119546,"size":88250700,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:58e3194f837b2e14077091e271032c03d4c3a41c&amp;dn=+Hod+-+Serpent++mp3+%282009%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"analogkid6103","files":7,"time":1411898669,"description":"\nHod is not an acronym. It is not H.O.D. It is Hod. Can we all get it straight now? Hod is creating what the world needs and fears the most; REAL FUCKING METAL!!! Our debut album &quot;Serpent&quot; was released April 14th 2009 on Ibex Moon Records. The album was recorded in Austin, Texas with Stuart &quot;Batlord&quot; Laurence of Agony Column/Ignitor producing it. The mastering was done by Proscriptor of Absu. You can order the album atAll major stores should have a copy of it as well, and if they don't, kill them! We are currently in the works on our second full length album also to be released on Ibex moon records sometime later this year (2010). We've had some lineup changes in the band. Some good. Some bad. All for the better of the band. You can't stop US!!! The Serpent shall consume you.\n\nHod has played many shows over the years with bands such as Watain, Napalm Death. Death Angel, D.R.I.,Dark Funeral, Incantation, Goreaphobia, Impiety, Goatwhore, Destroyer 666, Immolation, Black Witchery, Absu, Gravehill, Cardiac Arrest, Destruction, Rotting Christ and so on.\n\nWe also did a US tour with Monstrosity in 2009. We did some dates on the Campaign for Death Metal Purity Tour 2010. We were a support act for Marduk on their Seven Bowls of Wrath US tour 2011. We played the Gathering of the Beastial Legions Fest 5 in Los Angeles, Cali with Autopsy, Incantation, Divine Eve, and more.\nWe played the Central Illinois Metal Fest in 2011.\n\nWe were part of the Limb Splitter II comp put out by Ossuary Industries.\n\nWe are currently finishing our new album &quot;Book of the Worm&quot; for an undetermined label at the moment.\n\nTracklist:\n\n1.Victims (06:09)\n2.Ritual of Vengeance (04:16)\n3.God of Darkness and Winter (06:32)\n4.Nine Days (05:34)\n5.Demoralizer (04:37)\n6.Harbinger of Death (04:46)\n7.The Serpent of the Nightmare Empire (04:53)\n","torrent":{"xt":"urn:btih:58e3194f837b2e14077091e271032c03d4c3a41c","amp;dn":"+Hod+-+Serpent++mp3+%282009%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"58e3194f837b2e14077091e271032c03d4c3a41c","infoHashBuffer":{"type":"Buffer","data":[88,227,25,79,131,123,46,20,7,112,145,226,113,3,44,3,212,195,164,28]},"announce":[],"urlList":[]}}