{"title":"We Can Be Heroes - COMPLETE SERIES - Season 1","uid":12286178,"size":1261289589,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:594fd71d68fd3399fba106050ed3935e03e55003&amp;dn=We+Can+Be+Heroes+-+COMPLETE+SERIES+-+Season+1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":3,"uploader":"7436746","files":7,"time":1440475284,"description":"From Wikipedia:\nWe Can Be Heroes: Finding the Australian of the Year (often shortened to We Can Be Heroes and mostly known as The Nominees outside of Australia) is an Australian mockumentary TV series starring and created and co-written by Chris Lilley and Ryan Shelton and directed by Matthew Saville.[1]\n\nIt follows the story of five unique Australians, who have each made a large achievement and been nominated by friends and family for the Australian of the Year award.\n\nIt premiered on 27 July 2005, and concluded on 31 August 2005. It was shown on the ABC on Wednesday nights at 9:00pm. There are six episodes, with each episode running for 30 minutes. The show is broadcast in the United Kingdom on FX, in the United States on the Sundance Channel, and in Canada on The Comedy Network. In Australia, The Comedy Channel currently airs the series as part of their Aussie Gold block hosted by Frank Woodley.\n\nThe show won a Logie Award for most outstanding comedy and Chris Lilley won the Best New Talent Logie for his performance in the show","torrent":{"xt":"urn:btih:594fd71d68fd3399fba106050ed3935e03e55003","amp;dn":"We+Can+Be+Heroes+-+COMPLETE+SERIES+-+Season+1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"594fd71d68fd3399fba106050ed3935e03e55003","infoHashBuffer":{"type":"Buffer","data":[89,79,215,29,104,253,51,153,251,161,6,5,14,211,147,94,3,229,80,3]},"announce":[],"urlList":[]}}