{"title":"Wolf Hall S01E01 - Three Card Trick HDTV x264 - GHOST DOG","uid":12139842,"size":380152655,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:5e19ba8b5ee1d479409b6c1cb3d4e9152499ef54&amp;dn=Wolf+Hall+S01E01+-+Three+Card+Trick+HDTV+x264+-+GHOST+DOG&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"marxph","files":2,"time":1437325021,"description":"Historical drama chronicling the rise of Thomas Cromwell, the son of a humble blacksmith who became King Henry VIII's chief minister, as he navigated the corridors of power in the Tudor court.\n\nEpisode 1 of 6: Three Card Trick\n\nThomas Cromwell's patron, Cardinal Wolsey, is dismissed as lord chancellor and forced to flee his palace at York Place. The old noble families of England, jealous of their own right to advise the king, have long waited for this moment. His hopes of returning to the king's favour lie with the ever-loyal Thomas Cromwell.\n\nEight years ago, when Cromwell started working for Wolsey, the cardinal made an enemy of Thomas Boleyn by chastising him for his daughter Anne's far-from-virtuous reputation. As rumours circulated in court that Anne was secretly betrothed to Harry Percy, the cardinal insisted that no such match would be allowed.\n\nStill lacking a male heir, the king is desperate for an annulment from his marriage to Katherine of Aragon, claiming she was not a virgin on their wedding day. To Cromwell's dismay, the cardinal's efforts to persuade the Pope to grant the annulment are fruitless. An alliance between the Pope and Katherine's nephew, the holy Roman emperor, diminishes the cardinal's position even further.\n\nAs Henry grows impatient, the pressure increases on the cardinal. To add to this, rumours reach the cardinal that the king's new mistress is Anne Boleyn, who has sworn vengeance on him over Harry Percy.\n\nCromwell visits Anne, urging her that only the cardinal can secure what she wants, but Anne is unmoved. The duke of Norfolk, nervous of the cardinal's continuing proximity to the king, insists that Cromwell tell Wolsey to travel north to his archdiocese in York. A desperate Cromwell finally meets directly with Henry, but the king is nothing if not ambiguous. Will he recall the cardinal, or turn on him?\n\n===================================================================================\nSource.......: HDTV\nSize.........: 362MB\nFormat.......: mp4\nResolution...: 640x360\nVideo........: h.264, 703Kbps @ 25 fps\nAudio........: aac, 93Kbps, 48 KHz, 2 channels\n===================================================================================\n\nghost dog","torrent":{"xt":"urn:btih:5e19ba8b5ee1d479409b6c1cb3d4e9152499ef54","amp;dn":"Wolf+Hall+S01E01+-+Three+Card+Trick+HDTV+x264+-+GHOST+DOG","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5e19ba8b5ee1d479409b6c1cb3d4e9152499ef54","infoHashBuffer":{"type":"Buffer","data":[94,25,186,139,94,225,212,121,64,155,108,28,179,212,233,21,36,153,239,84]},"announce":[],"urlList":[]}}