{"title":"The God Delusion by Richard Dawkins [Retail epub] {Charm-Quark}","uid":12170785,"size":514062,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6044c136760ba9ca9abee1c08a3a7b09a70b3be4&amp;dn=The+God+Delusion+by+Richard+Dawkins+%5BRetail+epub%5D+%7BCharm-Quark%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Cquark","files":1,"time":1438175025,"description":"Book Description:\nA preeminent scientist -- and the worlds most prominent atheist -- asserts the irrationality of belief in God and the grievous harm religion has inflicted on society, from the Crusades to 9/11.With rigor and wit, Dawkins examines God in all his forms, from the sex-obsessed tyrant of the Old Testament to the more benign (but still illogical) Celestial Watchmaker favored by some Enlightenment thinkers. He eviscerates the major arguments for religion and demonstrates the supreme improbability of a supreme being. He shows how religion fuels war, foments bigotry, and abuses children, buttressing his points with historical and contemporary evidence. The God Delusion makes a compelling case that belief in God is not just wrong but potentially deadly. It also offers exhilarating insight into the advantages of atheism to the individual and society, not the least of which is a clearer, truer appreciation of the universes wonders than any faith could ever muster.\n\nAbout the Author:\nRichard Dawkins taught zoology at the University of California at Berkeley and at Oxford University and is now the Charles Simonyi Professor of the Public Understanding of Science at Oxford, a position he has held since 1995. Among his previous books are The Ancestors Tale, The Selfish Gene, The Blind Watchmaker, Climbing Mount Improbable, Unweaving the Rainbow, and A Devils Chaplain. Dawkins lives in Oxford with his wife, the actress and artist Lalla Ward","torrent":{"xt":"urn:btih:6044c136760ba9ca9abee1c08a3a7b09a70b3be4","amp;dn":"The+God+Delusion+by+Richard+Dawkins+%5BRetail+epub%5D+%7BCharm-Quark%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6044c136760ba9ca9abee1c08a3a7b09a70b3be4","infoHashBuffer":{"type":"Buffer","data":[96,68,193,54,118,11,169,202,154,190,225,192,138,58,123,9,167,11,59,228]},"announce":[],"urlList":[]}}