{"title":"Tushy - Riley Reid -{ Being Riley Chapter }- August 19, 2015","uid":12248818,"size":656619765,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:6081af6ad7c99569dfdae138485648fb1318326e&amp;dn=Tushy+-+Riley+Reid+-%7B+Being+Riley+Chapter+%7D-+August+19%2C+2015&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"VorTeK-ET","files":1,"time":1439977513,"description":"Beautiful Riley is a petite stunner who is known for being a good girl. She is bored and frustrated, being engaged and realising that she will only ever have sex with only one person is not something she wants for her future. She decides to escape rural Green view to see her friend Sarah, who lives in Los Angeles, a world away from what she is used to. She is relaxing in the bath when Sarah decides to join her for a bath time that gets more than a little steamy between them, including fingering and licking Riley's virgin ass. After they have pleasured each other totally, Sarah confesses that she has a very rich sugar daddy who pays for her lush lifestyle. When Sarah messages her from work to ask her to pick up her purse that she left at her friend's house, Riley is happy to help out. When she arrives, he is everything she could hope for, sexy, attractive and sophisticated. He picks up on Riley's attraction and it's not long before she is in his arms. He licks her soft pussy before she sucks on his hard dick and he enters her and making her moan with pleasure. She asks him to do something she's never done before - fuck her tight little asshole. He takes it slow, squeezing his thick shaft into her hot hole. She is soon taking his whole cock in her butt and loving every second. After banging her newly fucked asshole, he unloads his hot cumshot all over her sweet face.\n\n &lt;a href=&quot;\nhttp://s15.postimg.org/rknutdp3e/55d30dac0efdd.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://s15.postimg.org/rknutdp3e/55d30dac0efdd.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:6081af6ad7c99569dfdae138485648fb1318326e","amp;dn":"Tushy+-+Riley+Reid+-%7B+Being+Riley+Chapter+%7D-+August+19%2C+2015","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6081af6ad7c99569dfdae138485648fb1318326e","infoHashBuffer":{"type":"Buffer","data":[96,129,175,106,215,201,149,105,223,218,225,56,72,86,72,251,19,24,50,110]},"announce":[],"urlList":[]}}