{"title":"Monstercock: Trans Takeover 1 XXX 2015 (Trans500 Studios) WEB-DL","uid":12237832,"size":3204860544,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:630e416da9ceec80274edcafb63548b7f644dd25&amp;dn=Monstercock%3A+Trans+Takeover+1+XXX+2015+%28Trans500+Studios%29+WEB-DL&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":3,"uploader":"Ctrlme","files":4,"time":1439698930,"description":"Monstercock: Trans Takeover 1 XXX 2015 (Trans500 Studios) WEB-DL\n\nScreenshot(s): &lt;a href=&quot;\nhttp://imgctrl.com/image/NM4&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgctrl.com/image/NM4&lt;/a&gt;\n &lt;a href=&quot;\nhttp://imgctrl.com/image/NMJ&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgctrl.com/image/NMJ&lt;/a&gt;\n &lt;a href=&quot;\nhttp://imgctrl.com/image/NMK&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgctrl.com/image/NMK&lt;/a&gt;\n\nDescription: Monstercock: Tranny Takeover of course begins with Monstercock Ramon in the room with the cute Asian girl Mo who is wearing a pretty red dress. After a short chat, she strips and Ramon plays with her a bit and then she goes down on him. After a bit, they both lay down on the bed and Ramon fucks her from behind while she strokes herself. Then they switch to doggy style and then Ramon puts her on her back while he fucks her from above. Then Mo hops on Ramon cowgirl and rides him. They finish in the position they started in and Mo strokes herself until she cums all over her torso. Ramon then pulls out and adds to it. The next scene begins with Ramon cruising in the car with his friends just bullshitting. They pick up the lovely Carolina Estevez. Ramon doesn't hesitate to introduce himself. After chatting they're back at the hotel where Carolina shows off her body and her cock. She blows Ramon and then takes him in while they lay on the bed side by side and she strokes herself. They switch to cowgirl where she bounces on his cock showing off her thick ass. Then to doggy position and reverse cowgirl at the edge of the bed. Finally they go back to doggy style and Ramon finishes on her ass. Third up is Bia Bastos. She flaunts her body in the jacuzzi for a bit and then it switches to her in the bed with Ramon. She quickly unzips him and starts going down on him. After, she takes him in doggy style, then cowgirl, reverse, side by side while laying down and then a modified prone position. Ramon finishes by giving her a nice facial. The final scene is with Castro Supreme and Ramon sitting outside trying to figure out how to get some money. Ramon has a great idea and next scene we see them dressed up like 80s pimps. Castro is skeptical, but they go cruising in their oldschool chevy and pick up Venus Lux who is walking the streets trying to find clientele. They drive her back home and it isn't too long until she starts blowing both of them on her knees. She keeps blowing Ramon on the couch while Castro takes her in doggy style. Then Castro fucks her while she's on her back and Ramon is dipping his cock in her mouth. Next she hops on Ramon's cock cowgirl while she blows Castro, then she flips around reverse cowgirl. Ramon fucks her while she's on her back stroking herself and rimming Castro and she eventually cums. Then Castro and Ramon follow suit with facials. Afterwards the cameraman chats with Venus and she tells him her thoughts on the scene.\n\nLength:1:44:19\n\nScene 1: Mo\nScene 2: Carolina Estevez\nScene 3: Bia Bastos\nScene 4: Venus Lux\n\nâ˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…\n\n               If you like this torrent, please post a comment!\n            \n                            Don't forget to seed!\n\nâ˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…\n &lt;a href=&quot;\nhttps://pirates-forum.org/User-Ctrlme&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://pirates-forum.org/User-Ctrlme&lt;/a&gt;\n &lt;a href=&quot;\nhttps://thepiratebay.vg/user/Ctrlme/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://thepiratebay.vg/user/Ctrlme/&lt;/a&gt;","torrent":{"xt":"urn:btih:630e416da9ceec80274edcafb63548b7f644dd25","amp;dn":"Monstercock%3A+Trans+Takeover+1+XXX+2015+%28Trans500+Studios%29+WEB-DL","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"630e416da9ceec80274edcafb63548b7f644dd25","infoHashBuffer":{"type":"Buffer","data":[99,14,65,109,169,206,236,128,39,78,220,175,182,53,72,183,246,68,221,37]},"announce":[],"urlList":[]}}