{"title":"The.Pennine.Way.Complete.Series.1.ENG.SUBS.WEBRIP.[MPup]","uid":12195739,"size":1306258234,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:64f1987db0a98e34133b93179602eb6b0d612ac8&amp;dn=The.Pennine.Way.Complete.Series.1.ENG.SUBS.WEBRIP.%5BMPup%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"makinapufterpup","files":12,"time":1438735978,"description":"The.Pennine.Way.Complete.Series.1.ENG.SUBS.WEBRIP.[MPup]\n\nFormat: MPEG-4\nSize: 832x468\nDisplayAspectRatio: 16:9\nFrameRate: 25.000 fps\nAudioCodec: AAC\nChannels: 2 channels\nSamplingRate: 48.0 KHz\n\nThe.Pennine.Way.s01e01.ENG.SUBS.WEBRIP.[MPup]\n\nCelebrating the Pennine Way's 50th birthday. Paul Rose discovers how the route, which stretches from the Peak District in Derbyshire to the Scottish Borders, has changed.\n\n[img]http://extraimago.com/images/2015/08/04/0bbe36017f48adcbb4e22007b1723d83.jpg[/img]\n\nExplorer Paul Rose swaps Antarctica and the world's deepest oceans for the Pennine Way - as Britain's first national trail celebrates its 50th birthday.\n\nAt 268 miles long, the Pennine Way stretches from the Peak District in Derbyshire to the Scottish Borders. Paul discovers how much has changed along the route in the last half century - and finds out how the Pennine Way owes its existence to the right to roam movement in the 1930s.\n\nPaul hears about ghostly sightings along the trail and also meets actor and director Barrie Rutter to explore the literary roots of the south Pennines.\n\nThe.Pennine.Way.s01e02.ENG.SUBS.WEBRIP.[MPup]\n\nCelebrating the Pennine Way's 50th birthday. Paul Rose's journey along the Pennine Way takes him to the village of Malham in the Dales, where the Pennine Way was inaugurated.\n\n[img]http://extraimago.com/images/2015/08/04/ccd9cd654300bd8baa08717da952d6a4.jpg[/img]\n\nExplorer Paul Rose's journey along the Pennine Way takes him to the Yorkshire Dales. Fifty years ago, the Pennine Way was launched in the Dales village of Malham. Paul returns to hear from those who remember the opening ceremony. He also dons his climbing gear to have a crack at the limestone cliff face of Malham Cove. Paul also gets a front row seat at a sheep mart in Wensleydale - and enjoys a well-earned pint in Britain's highest pub.\n\nThe.Pennine.Way.s01e03.ENG.SUBS.WEBRIP.[MPup]\n\nCelebrating the Pennine Way's 50th birthday. Paul Rose heads to the North Pennines, enjoys white-water rafting down the River Tees and takes in the view at High Cup Nick.\n\n[img]http://extraimago.com/images/2015/08/04/ae7f242a489cce27ffac5224f94b676a.jpg[/img]\n\nPolar explorer Paul Rose heads for the North Pennines in the latest stage of his journey along the Pennine Way. As the route celebrates its 50th anniversary, he goes white-water rafting down the River Tees - and takes in one of Britain's best views at High Cup Nick. Paul also hears about a weather phenomenon unique to the Pennine Way, and spends a night at a remote mountain refuge close to the highest point of the Pennine Way.\n\nThe.Pennine.Way.s01e04.ENG.SUBS.WEBRIP.[MPup]\n\nCelebrating the Pennine Way's 50th birthday. Paul Rose heads into Northumberland on the final stage of his journey and makes a remarkable discovery at the Roman dig at Vindolanda.\n\n[img]http://extraimago.com/images/2015/08/04/d840cd9f130274ef9bf18c283bbdbaa1.jpg[/img]\n\nThe wilderness of rural Northumberland awaits explorer Paul Rose on the last stage of his Pennine Way journey. As the route celebrates its 50th birthday, Paul makes a remarkable discovery at the Roman archaeological dig at Vindolanda. He also finds out what lies beyond the red flags while on exercise with the Grenadier Guards - and why Pennine Way walkers can have a magical experience in the dark skies capital of Europe","torrent":{"xt":"urn:btih:64f1987db0a98e34133b93179602eb6b0d612ac8","amp;dn":"The.Pennine.Way.Complete.Series.1.ENG.SUBS.WEBRIP.%5BMPup%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"64f1987db0a98e34133b93179602eb6b0d612ac8","infoHashBuffer":{"type":"Buffer","data":[100,241,152,125,176,169,142,52,19,59,147,23,150,2,235,107,13,97,42,200]},"announce":[],"urlList":[]}}