{"title":"Lana Del Rey Collection {FLAC} vtwin88cube","uid":12138814,"size":2734682691,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:66ca32e03239c56e1b732db4625849437405bfee&amp;dn=Lana+Del+Rey+Collection+%7BFLAC%7D+vtwin88cube&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":9,"uploader":"vtwin88cube","files":129,"time":1437295928,"description":"Lana Del Rey\nCollection\n\n\n\n\n\nallmusic.com...\n\nVocalist Lana Del Rey makes atmospheric, orchestral, retro-'60s-sounding pop that showcases her torchy image and sensuous singing style. A native of Lake Placid, New York, Del Rey released both the &quot;Kill Kill&quot; single and a 2010 debut album under her given name, Lizzy Grant, tagging the album &quot;a.k.a. Lana Del Rey.&quot; It would be a few years before Grant would undergo a complete transformation into her alter ego, modeling the Lana Del Rey persona into a Hollywood pop femme fatale character. A video for the single &quot;Video Games&quot; appeared online in August of 2011 and drew considerable buzz, as did a secret show she performed at Brooklyn's Glasslands Gallery that September. Del Rey's EP, featuring the songs &quot;Video Games&quot; and &quot;Blue Jeans,&quot; was released in fall 2011. Amidst a heavy dose of hype, her debut album Born to Die was announced by Interscope for release early the following year. Del Rey cemented the anticipation around the album with an appearance on Saturday Night Live, becoming the first artist since Natalie Imbruglia in 1998 to perform on the show before the release of her debut album. Born to Die hit number one in several European countries, reached number two on the U.S. charts, and eventually sold several million copies worldwide. By the end of 2012, Del Rey had released her next work, a mini-album titled Paradise, with a trailer single called &quot;Ride.&quot; Songs from Paradise also found their way into the soundtrack of Tropico, a short film Del Rey worked on in collaboration with director Anthony Mandler. The strangely psychedelic take on biblical themes premiered at the Cinerama Dome in Hollywood in early December before being released online. The year 2014 saw the release of a much-anticipated Born to Die follow-up in the form of Ultraviolence, a somewhat darker and more mature look into Del Rey's sound produced by the Black Keys' Dan Auerbach. \n\n\nGenre................: Pop\nQuality..............: Free Lossless Audio Codec (FLAC)\nIncluded.............:Front Covers, auCDtect\n\n\n\n\nBorn To Die The Paradise Edition (2012)\n\nHeineken Music Hall, Amsterdam 05-29-2013\n\nLizzy Grant - No Kung Fu EP (2007)\n\nUltraviolence (Deluxe Explicit Edition) (2014)\n\nRemixes\n\nSoundtracks\n\nTHANKS for Seeding!\nCheers","torrent":{"xt":"urn:btih:66ca32e03239c56e1b732db4625849437405bfee","amp;dn":"Lana+Del+Rey+Collection+%7BFLAC%7D+vtwin88cube","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"66ca32e03239c56e1b732db4625849437405bfee","infoHashBuffer":{"type":"Buffer","data":[102,202,50,224,50,57,197,110,27,115,45,180,98,88,73,67,116,5,191,238]},"announce":[],"urlList":[]}}