{"title":"Napalm Death -  Utilitarian (Limited Edition) mp3  320k  2012 ","uid":11090306,"size":134042386,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:678314214585ade0ca762a73e330222a54924fcb&amp;dn=Napalm+Death+-++Utilitarian+%28Limited+Edition%29+mp3++320k++2012+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"analogkid6103","files":23,"time":1411511728,"description":"\nNapalm Death was originally called &quot;Civil Defence&quot; and started in Birmingham, a working class city, in 1982. Information about the background of the band during this period is very scarce, since they did little recording. Anyway, it started as a Punk rock project by high school student Nick Bullen, Miles Ratledge and some friends they met at school. At this stage, the band had a punk rock/hardcore sound and was strongly inspired by the band Crass and the anarchopunk scene that took place in England in the early 80's.\nAs this was a very different band, I have made a special page just with detailed information dealing with the origin of Napalm Death. For a bio, interview, notes and graphics of that era: EARLY NAPALM DEATH HOMEPAGE. This page wouldn't be possible without the help of Miles Ratledge and Stewart Lee, so a mighty thanks goes out to both of them.\nThis incarnation of Napalm Death didn't last very long though. In the beggining Napalm didn't sound like the holocaustic destruction that we know today, but they were more inspired by early punk bands and other underground acts such as Amebix and Crass.Within that style, the band recorded a few demos and a participation on the compilation &quot;Bullshit Detector#3&quot;, that being a compilation of punk bands made by Crass records, a label owned by Crass, a very political and socially aware british band. This is the first official Napalm Death studio recording. They were developing quite a strong following, and the band started to grow.\nMeanwhile, young guitarrist Justin Broadrick was playing by himself in a project called &quot;Final&quot;, which he taped in his room or wherever (and whenever) he could, and didn't do much else (Justin still plays and releases records under the name Final, together with Godflesh's bassist B.C.Green). Nick Bullen met Justin Broadrick in a record shop that both used to hang out in Birmingham. They had similar interests (Punk Rock, Metal, Throbbling Gristle...) and soon enough Justin was admitted into Nick Bullen's project. This was around May 1985, and with him came the very first metal sounds. &quot;Justin came about and presented a more metallic style, combined with loose Killing Joke playing&quot; says former drummer Mick Harris. They then recorded a legendary demo (Hatred Surge). On the Hatred Surge demo they had some funny pseudonymous. The line-up described on the tape is: Nik - Vox, Just - Guitar, Nuts - Bass, Rat - Drums.\nAfter recording the Hatred demo, The Rat got out (Harris says that they were having problems with him) and Mick Harris, a local fan who didn't even owned his own drum kit was admitted into the band. As he says: &quot;I had become a keen fan watching every local show and got the job I guess. (...) all I had was a pair of sticks and i wanted to go Maniac behind the kit&quot;. The band then became a three piece (with Nik Bullen taking over bass duties besides singing) and having Justin only on guitar and newcomer Mick on drums. &quot;It became more metal influenced as the three of us played more&quot; continues Mick.\n\nThen, they actually became the most extreme grindcore act ever. After getting in touch with Digby Pearsons, the owner of the small label &quot;Earache Records&quot;, through mutual friends, Napalm Death signed a deal and recorded half (yes, HALF of the songs!) of what was to be their debut album &quot;Scum&quot; in 1986. As Dig himself says: &quot;I first met them in 85 or 86, they had putted a demo out, and no one would touch it. But I listened to it, and I loved it, so I decided to put it out&quot;. The album was yet unreleased.\nAlthough ND was the first band who actually coined the word &quot;Grindcore&quot; to classify and define the type of music that they played, lots of other bands where already doing it for a while. Acts such as Siege, Repulsion, Macabre, S.O.B., Larm, Heresy, Criptic Slaughter, Nausea, Death and many others where all known for playing ultra fast and brutal songs. They didn't actually &quot;invented&quot; grindcore, but more like helped it evolve and go forward. Anyway, Napalm Death was the first to actually pigeonhole those bands within a style, and to establish themselves as kings of the genre.\n&quot;Grindcore was Micky's (Mick Harris) term&quot; says singer Mark Greenway: &quot;It didn't come from the press, we invented it&quot;. Concerning the definition of what is grind, he says:&quot;Grind can be anything from ultrafast thrash to really slow, heavy and dense music like early Swans&quot;. The grind scene was then beggining to take shape, and soon all bands would be led by Napalm Death.\nAt this time Nik Bullen was both playing the bass and singing but that was soon to change... As with everything in Napalm Death. In order to make things easier to Nik, a new bassist, Jim Whitley, was called, and Nik concentrated in singing.\nOn they went playing in small clubs and the like, gaining a small but loyal following.\nDuring one of the concerts, the band played with fellow noisiers Head of David (which was also a brutal band, but industrial like) and Justin, which was absolutely mad about the guys, was offered to play with them, provided that he left Napalm. He didn't think twice before leaving Grindcore for good, and joining Head of David on drums. Napalm Death didn't have a guitarrist anymore.\nNot long after Justin left, Nik Bullen ALSO left. According to Mick Harris he was loosing interest, showing up late for rehearsals, etc. He was asked to settle or get out. Obvioulsy he chose the latter, left the band and wen't to collage. (Later, he formed the ambient-dub-drum 'n' bass-industrial-dance-whatever combo &quot;Scorn&quot; with Mick Harris, but more of that in proper time). The lyrics sheet in Scum has a message from Mick Harris to both Nik and Justin, saying goodbye and telling them to keep together, which, to tell you the truth......they didn't!!!\nThe band was then reduced to Jim on Bass and Mick on Drums, and things were clearly not going anywhere this way.....they had to look for new members. Guitarrist Bill Steer played in a local grind band called Carcass, (you might have heard about them!!!) and given the afinity between the bands, he soon joined Mick and ND. Also, a new singer had been called: Lee Dorrian!! Yes!!! the king of screaming Grindcore himself! So now the band, whose original members where all gone (but Mick) had a new guitarrist (Bill), a solo singer (Lee), Mick on drums and Jim on bass, a lovely line-up.\nWith this line-up they recorded what was to become th B side of &quot;Scum&quot;, and the result was finally released trough Earache as MOSH 3. An instant hit among the underground community, Scum sold very well as soon as it was released (more than 90 thousand copies in England only). It caused an impact in extreme music that is felt 'till today, influencing bands from all around the world. This classic attempt against logical musical structure and good taste features seminal Grindcore classics such as &quot;Dragnet&quot;, &quot;Mind Control&quot;, and the yet to be surpassed &quot;You Suffer&quot;, an exquisite piece of composition which lasts for about 0.7 seconds (a world record for the world's shortest song maybe?)\nAfter the warm welcome from thrashers, punks, metalheads, moshers, grinders and the like, the band went on tour. Nevertheless, no stranger to line-up changes, ND lost another of its members. Jim was out of the band just before the tour for &quot;Scum&quot; was about to be (again for reasons unknown...as one can see Napalm Death is a rather misterious band). Enter Shane Embury, the guy with the ugliest hair in the history of Grindcore. After this small line-up change, they took part in two compilations (North atlantic noise attack and the Pathological), recorded two Peel sessions and a Split 7&quot; with japanese grinders S.O.B. On top of that, our adorable grinders went to Rich Bitch studio once more and recorded their second insult to moralistc society, the controversial classic &quot;From Enslavement to Obliteration&quot;.Napalm Death - 2012 - Utilitarian (Limited Edition)\n\nTracklist:\n\n01. Circumspect\n02. Errors In The Signals\n03. Everyday Pox\n04. Protection Racket\n05. The Wolf I Feed\n06. Quarantined\n07. Fall On Their Swords\n08. Collision Course\n09. Orders Of Magnitude\n10. Think Tank Trials\n11. Blank Look About Face\n12. Leper Colony\n13. Nom De Guerre\n14. Analysis Paralysis\n15. Opposites Repellent\n16. A Gag Reflex\n17. Aim Without An Aim [bonus]\n18. Everything In Mono [bonus]\n\nmp3, 320 kbps\nGenre:\tDeath\nSubgenre:\tGrindcore / Death Metal\nBitrate:\t320 k\nSize:\t127.83 MB\t\n23 files   Napalm Death Let it set the world on fire........seed........seed...","torrent":{"xt":"urn:btih:678314214585ade0ca762a73e330222a54924fcb","amp;dn":"Napalm+Death+-++Utilitarian+%28Limited+Edition%29+mp3++320k++2012+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"678314214585ade0ca762a73e330222a54924fcb","infoHashBuffer":{"type":"Buffer","data":[103,131,20,33,69,133,173,224,202,118,42,115,227,48,34,42,84,146,79,203]},"announce":[],"urlList":[]}}