{"title":"nAaojAaGI","uid":11081134,"size":19535708,"categoryP":"applications","categoryS":"android","magnet":"?xt=urn:btih:68de547c5d54f8ea0b112796b3c6350daa38c37c&amp;dn=nAaojAaGI&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Syncaine","files":-1,"time":1411407972,"description":"Old bum. He has no money, no job, no goals in life. Bum is happy only when it is possible to find another bottle of alcohol. It is a haven for the homeless, he is happy to have a drink. All the time he wanders through the city, if there is money, he gets drunk. This is his trick in life. In search of a bottle, the homeless have to overcome many difficulties. He jumps across the gap and climbs over rocks. Ahead of the long-awaited bottle. Yes, the old bum, tramp and alcoholic gads in search of the bottle and collects the butts. Help the homeless get to the bottles in nine stunning levels and do another bum happy.\n\nBelieve me, you will sit down on it. Simply tap the screen to jump bum.\nSweet and good graphics and warm subtle colors that will help you relax and get the most pleasant sensations. \nFunny sounds of the old bum studio quality increase realism game. He will whine, groan, and even fart, you may even be able to get him to piss.\nMusic in the style of rock will give you an adrenaline rush to feel like a bum.\n\n- = Features = - \n- Stunning graphics and cartoons warm subtle colors. \n- Bring you joy and make you happy as homeless. \n- Make a double jump for the best results. \n- Music tracks accompany you on adventures. \n- Funny sounds of the old bum studio quality. \n- Collect butts like real bums. \n- Pause to rest before the new records.","torrent":{"xt":"urn:btih:68de547c5d54f8ea0b112796b3c6350daa38c37c","amp;dn":"nAaojAaGI","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"68de547c5d54f8ea0b112796b3c6350daa38c37c","infoHashBuffer":{"type":"Buffer","data":[104,222,84,124,93,84,248,234,11,17,39,150,179,198,53,13,170,56,195,124]},"announce":[],"urlList":[]}}