{"title":"EnigmaT Set Rips { Cuts } - September 20th, 2014","uid":11064378,"size":714764998,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:68f9105315f92ca93ffdfe12b0235a83a49b3436&amp;dn=EnigmaT+Set+Rips+%7B+Cuts+%7D+-+September+20th%2C+2014&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"EnigmaT","files":75,"time":1411204224,"description":"A.R.D.I. &amp; Allam - ID (Original Mix) (Cut From ARDI Set)-enTc\nAbove &amp; Beyond - Black Room Boy (Maor Levi Deep Room Mix) (ABGT 097 Rip)-enTc\nAitra - Out Of Reach (Zeni Remix) (ABGT 097 Rip)-enTc\nAlesso feat. Tove Lo - Heroes (CoLL3RK &amp; Aventa Remix) (Cut From Shiver Set)-enTc\nAlfonso Maia - Team Trail (Original Mix) (Cut From Arc Quest Set)-enTc\nAly &amp; Fila -w- Stoneface &amp; Terminal - Universelab (ASOT 681 Rip)-enTc\nAndrew Rayel - Impulse (Bobina Remix) (Cut From Rayel Set)-enTc\nAndy Moor &amp; Lange feat. Fenja - Top Of The World (Joseph Areas Dirty Rock Remix) (Cut From Lange Set)-enTc\nAnother Note - Dominate Night (Andrew Lang Remix) (Cut From Feel Set)-enTc\nArgon &amp; Cobalt - Pantheon (Cut From Rayel Set)-enTc\nArmin van Buuren - Hystereo (Heatbeat Remix) (ASOT 681 Rip)-enTc\nBat For Lashes - Laura (Mark Knight &amp; Graffiti On Mars Remix) (Cut From Blake Set)-enTc\nBen Gold - Waterloo (Original Mix) (Cut From Gold Set)-enTc\nBilal El Aly - Atropine (Cut From Feel Set)-enTc\nBlake Jarrell - Cala Nova (Original Mix) (Cut From Tydi Set)-enTc\nBorealnight - Beyond the Silent Skies (Orchestral Mix) (Cut From El Jay Set)-enTc\nBorealnight - Beyond the Silent Skies (Orchestral Mix) (Cut From Uplift Set)-enTc\nCirez D - Accents (Original Mix) (Cut From Blake Set)-enTc\nCirez D - Revolution (Original Mix) (Cut From Blake Set)-enTc\nColdplay - A Sky Full Of Stars (DJ Sammy 2014 Edit) (Cut From Arc Quest Set)-enTc\nCubicolor - A New High (ABGT 097 Rip)-enTc\nCubicolor - A New High (Original Mix) (Cut From Blake Set)-enTc\nDan Thompson - ID (Original Mix) (Cut From ARDI Set)-enTc\nDreamy &amp; Ikerya Project - Perished Dreams (Ikerya Project Mix) (Set Rip)-enTc\nEhsun - Valles Marineris (Mike Sanders Remix) (Cut From El Jay Set)-enTc\nFloE - Timezone (Tolga Uzulmez Remix) (Cut From Feel Set)-enTc\nFrank Dattilo - Angel's City (Lafale Remix) (Cut From Uplift Set)-enTc\nGareth Emery - Global (Luke Bond Big Beat Bootleg) (ASOT 681 Rip)-enTc\nGareth Emery Feat. Gavin Beach - Eye Of The Storm (LTN Remix) (ASOT 681 Rip)-enTc\nGary Maguire - Beer Goggles (Curtis Young Remix) (Cut From Team140 Set)-enTc\nGlynn Alan - The Edge (Original Mix) (Cut From El Jay Set)-enTc\nGregory Esayan - Drawing The Life (ASOT 681 Rip)-enTc\nGrum - Straight To Your Heart (Original Mix) (Cut From Shiver Set)-enTc\nHarmonics Audio - Dreams (Original Mix) (Cut From Uplift Set)-enTc\nID - ID (Ikerya Project Remix) (Set Rip)-enTc\nIkerya Project - ID 001 (Set Rip)-enTc\nIkerya Project - ID 002 (Set Rip)-enTc\nIkerya Project - ID 003 (Set Rip)-enTc\nIkerya Project - ID 004 (Set Rip)-enTc\nIkerya Project - Lovely November (Club Mix) (Set Rip)-enTc\nIkerya Project - Morning Exercise (Set Rip)-enTc\nJan Fleck - Insect Society (Original Mix) (Cut From 2nd Phase Set)-enTc\nJaytech - Arrival (ABGT 097 Rip)-enTc\nJericho Ismael - Happy Days (Dub Mix) (Cut From Fisherman Set)-enTc\nKwabs - Walk (Sasha Remix) (ABGT 097 Rip)-enTc\nLee Osborne - Sky-Dweller (ASOT 681 Rip)-enTc\nLondon Grammar - Interlude (Nikhil Prakash Bootleg Remix) (Cut From Feel Set)-enTc\nLord Sonah - 1921 (Tzriker Euphoric Remix) (Cut From Uplift Set)-enTc\nLTN - Ending the Wisdom (ASOT 681 Rip)-enTc\nLTN feat. Christina Novelli - Feel like (Yeah) (Alexander Popov Dub Mix) (Cut From Gold Set)-enTc\nLuke Potter - Chance Worth Taking (ID Remix) (Cut From PvD Set)-enTc\nMake One - Young Hearts (GDJB Rip)-enTc\nMartin Garrix &amp; MoTi - Virus (GDJB Rip)-enTc\nMartin Graff &amp; Martin Soundriver - Wrath Of Nature (Cut From Feel Set)-enTc\nMaywave - Flowing Passion (UDM Remix) (Cut From Uplift Set)-enTc\nMilosh K - To The Top (Jens Jakob Remix) (Cut From El Jay Set)-enTc\nMino Safy - Around The Garden (Hazem Beltagui Remix) (ASOT 681 Rip)-enTc\nNikolay Kempinskiy Feat. Love Dimension - New Era (Puma Scorz Remix) (ASOT 681 Rip)-enTc\nParker &amp; Hansen - Gravity (16 Bit Lolitas Remix) (ABGT 097 Rip)-enTc\nPaul Thomas Russell G &amp; Steve Haines - Cafe Del Mar (Original Mix) (Cut From Blake Set)-enTc\nPaul Van Dyk &amp; Daniel Nitt - Nothing But Everything  (Cut From PvD Set)-enTc\nPlayme - For Love (Short Mix) (Cut From Uplift Set)-enTc\nPurple Stories - Devil Inside (GDJB Rip)-enTc\nR3dub - Tarabita (Cut From Fisherman Set)-enTc\nRaddle B &amp; Nellu L vs Marcprest - 7 Billion People 14 Billion Faces (Alex Shevchenko Remix) (Cut From Uplift Set)-enTc\nRene Ablaze - The Spirit of India (Cut From Uplift Set)-enTc\nScenica - ID (Original Mix) (Cut From ARDI Set)-enTc\nSilence Groove - Anise (Stan Arwell Remix) (Cut From Feel Set)-enTc\nSteve Brian &amp; Johnny Yono - Your Kisses (ASOT 681 Rip)-enTc\nSteven Force - Neptune Grass (Denis Sender Remix) (ASOT 681 Rip)-enTc\nSusana - Feel You Here (Beat Service Remix) (GDJB Rip)-enTc\nTepes - Awareness (Cut From Fisherman Set)-enTc\nThe Thrillseekers - This Is All We Have (Andy Moor Remix) (Cut From Lange Set)-enTc\nTommy Johnson - Son Of Light (ASOT 681 Rip)-enTc\nVlad Krotov - Not Afraid (Original Mix) (Cut From Arc Quest Set)-enTc\n","torrent":{"xt":"urn:btih:68f9105315f92ca93ffdfe12b0235a83a49b3436","amp;dn":"EnigmaT+Set+Rips+%7B+Cuts+%7D+-+September+20th%2C+2014","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"68f9105315f92ca93ffdfe12b0235a83a49b3436","infoHashBuffer":{"type":"Buffer","data":[104,249,16,83,21,249,44,169,63,253,254,18,176,35,90,131,164,155,52,54]},"announce":[],"urlList":[]}}