{"title":"Tensors for Physics [2015] [PDF]","uid":12165453,"size":7883826,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:69ddf6226d4a39d22f6b0f258bcf4caad6a2c8fc&amp;dn=Tensors+for+Physics+%5B2015%5D+%5BPDF%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"NoctDeath","files":3,"time":1438018210,"description":"Title: Tensors for Physics \nSeries: Undergraduate Lecture Notes in Physics \nAuthor: Siegfried Hess \nFormat: PDF \nHardcover: 440 pages \nPublisher: Springer; 2015 edition (April 26, 2015) \nLanguage: English \nISBN: 978-3319127866 \n\n\nThis book presents the science of tensors in a didactic way. The various types and ranks of tensors and the physical basis is presented. Cartesian Tensors are needed for the description of directional phenomena in many branches of physics and for the characterization the anisotropy of material properties. The first sections of the book provide an introduction to the vector and tensor algebra and analysis, with applications to physics, at undergraduate level. Second rank tensors, in particular their symmetries, are discussed in detail. Differentiation and integration of fields, including generalizations of the Stokes law and the Gauss theorem, are treated. The physics relevant for the applications in mechanics, quantum mechanics, electrodynamics and hydrodynamics is presented. The second part of the book is devoted to tensors of any rank, at graduate level. Special topics are irreducible, i.e. symmetric traceless tensors, isotropic tensors, multipole potential tensors, spin tensors, integration and spin-trace formulas, coupling of irreducible tensors, rotation of tensors. Constitutive laws for optical, elastic and viscous properties of anisotropic media are dealt with. The anisotropic media include crystals, liquid crystals and isotropic fluids, rendered anisotropic by external orienting fields. The dynamics of tensors deals with phenomena of current research. In the last section, the 3D Maxwell equations are reformulated in their 4D version, in accord with special relativity","torrent":{"xt":"urn:btih:69ddf6226d4a39d22f6b0f258bcf4caad6a2c8fc","amp;dn":"Tensors+for+Physics+%5B2015%5D+%5BPDF%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"69ddf6226d4a39d22f6b0f258bcf4caad6a2c8fc","infoHashBuffer":{"type":"Buffer","data":[105,221,246,34,109,74,57,210,47,107,15,37,139,207,76,170,214,162,200,252]},"announce":[],"urlList":[]}}