{"title":"Dead Can Dance - Spiritchaser (1996) 2008 MFSL-SACD-DFF","uid":11138722,"size":2199287188,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:6a30bfb1625ad6b0299851775abfaebbecbb2100&amp;dn=Dead+Can+Dance+-+Spiritchaser+%281996%29+2008+MFSL-SACD-DFF&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"hal4000","files":-1,"time":1412142080,"description":"Dead Can Dance is an English-Australian musical project that formed in 1981 in Melbourne by Lisa Gerrard and Brendan Perry. The band relocated to London, England, in May 1982. Australian music historian Ian McFarlane described Dead Can Dance's style as &quot;constructed soundscapes of mesmerising grandeur and solemn beauty; African polyrhythms, Gaelic folk, Gregorian chant, Middle Eastern mantras and art rock.&quot;\n\nDead Can Dance's final album Spiritchaser was something of an unusual release - it's not as much of an anomaly as the first album, but one can hear the duo wanting to stretch a bit more, however subtly. Perry and Gerrard's personal and creative tensions didn't stop them from creating another fine album, though there's a strong sense the group had finally reached a logical end. Essentially, Spiritchaser is a summing up rather than a push forward; it features all the usual elements of a Dead Can Dance album instead of further explorations to see what else could be done. Toward the Within contributors Ronan O'Snodaigh and Lance Hogan, as well as previous collaborator Peter Ulrich, appear on some tracks here, most specifically on the opening &quot;Nierika&quot; and &quot;Dedicace Outro.&quot; Both are laden with lots of percussion -- unsurprising when one realizes that five performers are creating the drumming! Outside of Turkish clarinet by Renaud Pion on the Beatles-sampling &quot;Indus,&quot; it's nothing but Perry and Gerrard throughout the album, with another combination and arrangement of multiple influences coming to bear. Both Perry and Gerrard are in fine voice throughout, their strong singing still the centerpiece of their work, but there's almost an air of predictability to their approaches at this point (perhaps explaining Perry's greater experimentation on his solo debut years later). Interestingly, overtly rock elements like Morricone-styled electric guitar appear at points amid the usual melange of various percussion instruments and arrangements. It works surprisingly well, indicating where the duo might have gone had they continued on. Spiritchaser ends on a strong note, the gentle, mysterious &quot;Devorzhum,&quot; a Gerrard-sung number that makes for a grand conclusion.\n\nDFF files extracted with Scarletbook\n     &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/10942620/Scarletbook-SACD-Extractor&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/10942620/Scarletbook-SACD-Extractor&lt;/a&gt;\n\nfrom the 2008 Mobile Fidelity Sound Lab SACD.\n\nSACD-ISO-DFF-1Bit-2.8Mhz.\n","torrent":{"xt":"urn:btih:6a30bfb1625ad6b0299851775abfaebbecbb2100","amp;dn":"Dead+Can+Dance+-+Spiritchaser+%281996%29+2008+MFSL-SACD-DFF","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6a30bfb1625ad6b0299851775abfaebbecbb2100","infoHashBuffer":{"type":"Buffer","data":[106,48,191,177,98,90,214,176,41,152,81,119,90,191,174,187,236,187,33,0]},"announce":[],"urlList":[]}}