{"title":"Pappanos Classical Voices s01e03 ENG SUBS WEBRIP [MPup]","uid":12117787,"size":668845170,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:6b4e07684f061a3a1ef2b301e117b6473d830490&amp;dn=Pappanos+Classical+Voices+s01e03+ENG+SUBS+WEBRIP+%5BMPup%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"makinapufterpup","files":4,"time":1436759708,"description":"Pappanos.Classical.Voices.s01e03.Mezzo-Soprano.ENG.SUBS.WEBRIP.[MPup]\n\nFormat: MPEG-4\nSize: 832x468\nDisplayAspectRatio: 16:9\nFrameRate: 25.000 fps\nAudioCodec: AAC\nChannels: 2 channels\nSamplingRate: 48.0 KHz\n\nAntonio Pappano explores the great roles and singers through the prism of the main voice types. He continues with the mezzo-soprano, often the rival or the villainess.\n\n[img]http://extraimago.com/images/2015/07/13/d539822054f141c5ea8c78bd91cf2ad5.png[/img]\n\n[img]http://extraimago.com/images/2015/07/13/49a2a29420bfa6cc6113a4868994525e.jpg[/img]\n\nSeries in which conductor Sir Antonio Pappano (music director of the Royal Opera House since 2002) explores the great roles and the greatest singers of the last hundred years through the prism of the main classical voice types - soprano, tenor, mezzo-soprano, baritone and bass. Through discussion, demonstrations and workshops, Pappano explores every aspect of the art of great singing.\n\nThe lowest female voice type, and the one closest to a woman's natural speaking voice, the mezzo-soprano only rarely plays the name part. But when she does - in Carmen, Samson et Dalila, and La Cenerentola - the fireworks begin. More often, she's the rival, and the villainess.\n\nAntonio explores the particular effect the mezzo voice has on the audience. Her low, sultry tones make her voice perfect for the earth goddess, but also the enchantress, the siren. But she has to sing nearly as high as the soprano. So how does she do it? What is the 'chest voice' and what effect does it have? How do you sing ugly to convey the evil of a character without destroying your voice, and at the same time unearth some redeeming qualities?\n\nAntonio finds out what makes the mezzo tick by looking at great performances from Giulietta Simionato, Kathleen Ferrier, Marian Anderson, Shirley Verrett, Cecilia Bartoli and Lorraine Hunt Lieberson, and taking soundings from Janet Baker, Christa Ludwig, Joyce DiDonato, Felicity Palmer and Sarah Connolly","torrent":{"xt":"urn:btih:6b4e07684f061a3a1ef2b301e117b6473d830490","amp;dn":"Pappanos+Classical+Voices+s01e03+ENG+SUBS+WEBRIP+%5BMPup%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6b4e07684f061a3a1ef2b301e117b6473d830490","infoHashBuffer":{"type":"Buffer","data":[107,78,7,104,79,6,26,58,30,242,179,1,225,23,182,71,61,131,4,144]},"announce":[],"urlList":[]}}