{"title":"[-FemaleAgent-] Lucy Li, Nika [-Busty Agents Strap On Surprise F","uid":12171000,"size":621987818,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:6bd6ad443338235ab5c58492f4601e88fd488dfe&amp;dn=%5B-FemaleAgent-%5D+Lucy+Li%2C+Nika+%5B-Busty+Agents+Strap+On+Surprise+F&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Upl0ad3rR","files":1,"time":1438183908,"description":"[-FemaleAgent-] Lucy Li, Nika [-Busty Agents Strap On Surprise For Slim Beauty-] --NEW-- 28-July-2015\n\n---:More From My Torrent's Here:---   &lt;a href=&quot;\nhttps://thepiratebay.se/user/Upl0ad3rR&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://thepiratebay.se/user/Upl0ad3rR&lt;/a&gt;\n\n---:ScreeNshotS:---  &lt;a href=&quot;\nhttp://imgfresh.com/image/14934.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgfresh.com/image/14934.html&lt;/a&gt;\n &lt;a href=&quot;\nhttp://imgfresh.com/image/14935.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgfresh.com/image/14935.html&lt;/a&gt;\n\nNika (28 mins). I'd brought my strap on dildo into work today and I was determined to use it on some lucky lady that came in for a casting and when the beautiful Nika walked through the door I knew instantly that she was the one. Nika was a shy, beautiful woman who wanted to do some modelling. We went through the usual questions and when I asked her to show me her figure her shyness kicked in. I had to explain that if she wanted good money then I and my clients would need to see her in her underwear. After agreeing she revealed a very beautiful figure with a nice, firm ass and a beautiful pair of small, pert breasts. My pulse began to quicken as I drank in her body with my eyes and I asked her if I could check that her breasts were real. I snapped her bra off and began to caress her breasts. I could hear her breathing get heavier and when I told her that if she pleasured me she would get a lot of jobs for a lot of money we were soon locked in a deep kiss. I walked her over to the couch and she sucked and groped my big, firm breasts before removing my knickers and licking my moist pussy. With a little instruction she soon had her fingers deep inside me and with her tongue flicking over my clit my orgasm built and hit me like a freight train of pleasure. Now it was her turn and after tasting her pussy juices with my tongue I got my strap on out and got her into the doggy style position. I slid my plastic phallus deep inside her tight pussy and she moaned and groaned with pleasure as I sawed it in and out of her. I built up the pace and she was soon convulsing on the end of my plastic cock as her orgasm shook her entire body with pleasure from head to toe. What an amazing casting and I loved fucking her with my plastic cock. A beautiful start to a beautiful day","torrent":{"xt":"urn:btih:6bd6ad443338235ab5c58492f4601e88fd488dfe","amp;dn":"%5B-FemaleAgent-%5D+Lucy+Li%2C+Nika+%5B-Busty+Agents+Strap+On+Surprise+F","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6bd6ad443338235ab5c58492f4601e88fd488dfe","infoHashBuffer":{"type":"Buffer","data":[107,214,173,68,51,56,35,90,181,197,132,146,244,96,30,136,253,72,141,254]},"announce":[],"urlList":[]}}