{"title":"Introduction to General Relativity, Black Holes and Cosmology","uid":12162086,"size":1893784,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6eb2e3209c52d21b17593c41e95a12fd45ea482f&amp;dn=Introduction+to+General+Relativity%2C+Black+Holes+and+Cosmology&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Cquark","files":1,"time":1437935395,"description":"Book Description :\nGeneral Relativity is a beautiful geometric theory, simple in its mathematical formulation but leading to numerous consequences with striking physical interpretations: gravitational waves, black holes, cosmological models, and so on.\n\nThis introductory textbook is written for mathematics students interested in physics and physics students interested in exact mathematical formulations (or for anyone with a scientific mind who is curious to know more of the world we live in), recent remarkable experimental and observational results which confirm the theory are clearly described and no specialised physics knowledge is required. The mathematical level of Part A is aimed at undergraduate students and could be the basis for a course on General Relativity. Part B is more advanced, but still does not require sophisticated mathematics.\n\nBased on Yvonne Choquet-Bruhat's more advanced text, General Relativity and the Einstein Equations, the aim of this book is to give with precision, but as simply as possible, the foundations and main consequences of General Relativity. The first five chapters from General Relativity and the Einstein Equations have been updated with new sections and chapters on black holes, gravitational waves, singularities, and the Reissner-Nordstrom and interior Schwarzchild solutions.\n\nThe rigour behind this book will provide readers with the perfect preparation to follow the great mathematical progress in the actual development, as well as the ability to model, the latest astrophysical and cosmological observations. The book presents basic General Relativity and provides a basis for understanding and using the fundamental theory","torrent":{"xt":"urn:btih:6eb2e3209c52d21b17593c41e95a12fd45ea482f","amp;dn":"Introduction+to+General+Relativity%2C+Black+Holes+and+Cosmology","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6eb2e3209c52d21b17593c41e95a12fd45ea482f","infoHashBuffer":{"type":"Buffer","data":[110,178,227,32,156,82,210,27,23,89,60,65,233,90,18,253,69,234,72,47]},"announce":[],"urlList":[]}}