{"title":"Men in War (1957) DVD9 Uncompressed - Robert Ryan, Aldo Ray [DDR","uid":11108589,"size":5643421696,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:703c608b8829b94a6281011608ff6ca1bebc0d3c&amp;dn=Men+in+War+%281957%29+DVD9+Uncompressed+-+Robert+Ryan%2C+Aldo+Ray+%5BDDR&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"SaM","files":-1,"time":1411761883,"description":"Men in War (1957) DVD9 Uncompressed - Robert Ryan, Aldo Ray [DDR]\n\nMen in War (1957) is a war film about the Korean War directed by Anthony Mann. \nIt stars Robert Ryan and Aldo Ray as the leaders of a small detachment of American soldiers cut off and desperately trying to rejoin their division. \nThe events of the film take place on one day; 6 September 1950. It was based on a 1949 World War II novel of the Normandy campaign Day Without End by Van Van Praag that was retitled Combat in 1951.\n\nSome sources claim that credited screenwriter Philip Yordan was actually fronting for the blacklisted Ben Maddow. The Pentagon refused any cooperation with the producer and condemned the film for its depicition of a US Army unit without discipline.\n\nMost of the same cast and crew made God's Little Acre the following year.\n\n    CAST:-\n    Robert Ryan as Lieutenant Benson\n    Aldo Ray as Sergeant Joseph R. &quot;Montana&quot; Willomet\n    Robert Keith as The Colonel\n    Phillip Pine as Sergeant Riordan \n    Nehemiah Persoff as Sergeant First Class Nate Lewis\n    Vic Morrow as Corporal James Zwickley\n    James Edwards as Sergeant Killian\n    L. Q. Jones as Sergeant Davis\n    Scott Marlowe as Private Meredith\n    Adam Kennedy as Private Maslow\n    Race Gentry as Private Haines\n    Walter Kelley as Private Ackerman\n    Anthony Ray as Private Penelli\n    Robert Normand as Private Christensen\n    Michael Miller as Private Lynch\n\nDirected by Anthony Mann\nProduced by Sidney Harmon\nWritten by Van Van Praag (novel)\nMusic by Elmer Bernstein\nRunning time 100-102 minutes\n\nMOVIE PLOT:- Men in War (1957)\nOn 6 September 1950, an exhausted platoon of the 24th Infantry Division is cut off. In addition to losing radio contact, the platoon is harassed by unseen North Korean infiltrators who silently kill the Americans and take their weapons. Platoon commander Lieutenant Benson (Ryan) has only vague instructions to reach a certain hill to link up with American forces.\n\nThe patrol stops a jeep driven by Sergeant &quot;Montana&quot; (Ray) and shell shocked passenger &quot;the Colonel&quot; (Robert Keith) from the First Cavalry Division. The Colonel is unable to speak and is tied to his seat. After the Battle of the Nakdong River, where &quot;our men fell like rain&quot;, the tough experienced Montana decided he and his Colonel, whom he treats like his father, have had enough of the war. Benson commandeers their jeep for his platoon's equipment and the battle-fatigued Corporal Zwickley.\n\nThe platoon makes its way towards the hill. Montana disobeys Benson by instinctively shooting a surrendering North Korean sniper, who turns out to have a concealed weapon inside his hat. Sergeant Killian is killed while covering the rear after absentmindedly filling his helmet net with flowers. Montana takes his place and feigns fatigue, luring the infiltrators into the open, where he kills them.\n\nThe cynical Montana transforms the platoon back into a military formation while also curing Zwickley's neurosis by slapping him around. The platoon successfully carries on through sniper attack, artillery barrage, and land mines.\n\nWhen they reach the hill, they find it held by the North Koreans. Montana shoots three enemy soldiers disguised as Americans after a North Korean prisoner is used as bait and killed by his own men. Benson and his men launch an attack, but Montana and the Colonel sit it out. The Colonel comes to his senses, joins the assault, and is killed. Shamed, Montana joins Benson. They use grenades and a flamethrower to destroy a pillbox and machine gun nest.\n\nOnly Benson, Montana, and Sergeant Riordan survive. When American reinforcements arrive, Montana produces a container of medals that the Colonel meant to award his men. Benson calls the roll as Montana throws the medals to the dead on the slope of the hill, while Elmer Bernstein's title song plays in the background.\n\nPRODUCTION NOTES:-\nUnable to get tanks and military extras from the Pentagon, both Mann and composer Bernstein concentrate on the landscape, in this case filmed at Bronson Canyon. Enemy soldiers are rarely seen, and the isolation of the platoon is strongly conveyed. Mann had previously made film noirs in the late 1940s and Westerns in the early to mid-1950s and combined elements of both in his first war film.\n\nTECHNICAL SPECIFICATIONS:-\nVideo Codec: MPEG-2\nVideo Bitrate: 6547 kbps\nVideo Resolution: 720x480\nVideo Aspect Ratio: 1.778:1\nFrames Per Second: 29.970\nAudio Codec:  AC3\nAudio Bitrate: 192kb/s CBR 48000 Hz\nAudio Streams:  1\nAudio Languages: English\nRunTime 102 mins\nSubtitles: None\nRipped by: Trinidad [DDR]","torrent":{"xt":"urn:btih:703c608b8829b94a6281011608ff6ca1bebc0d3c","amp;dn":"Men+in+War+%281957%29+DVD9+Uncompressed+-+Robert+Ryan%2C+Aldo+Ray+%5BDDR","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"703c608b8829b94a6281011608ff6ca1bebc0d3c","infoHashBuffer":{"type":"Buffer","data":[112,60,96,139,136,41,185,74,98,129,1,22,8,255,108,161,190,188,13,60]},"announce":[],"urlList":[]}}