{"title":"Legends (Mobi)","uid":11129828,"size":953712,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:72e7eaa030d18b6e765b7093c9a3295d606c5b81&amp;dn=Legends+%28Mobi%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Q-13","files":-1,"time":1412024433,"description":"Robert Littell is the undisputed master of American spy fiction, hailed for his profound grasp of the world of international espionage. His previous novel, The Company, an international bestseller, was praised as &quot;one of the best spy novels ever written&quot; (Chicago Tribune). For his new novel, Legends, Littell focuses on the life of one great agent caught in a &quot;wilderness of mirrors&quot; where both remembering and forgetting his past are deadly options. Martin Odum is a CIA field agent turned private detective, struggling his way through a labyrinth of past identities - &quot;legends&quot; in CIA parlance. Is he really Martin Odum? Or is he Dante Pippen, an IRA explosives maven? Or Lincoln Dittmann, Civil War expert? These men like different foods, speak different languages, have different skills. Is he suffering from multiple personality disorder, brainwashing, or simply exhaustion? Can Odum trust the CIA psychiatrist? Or Stella Kastner, a young Russian woman who engages him to find her brother-in-law so he can give her sister a divorce. As Odum redeploys his dormant tradecraft skills to solve Stella's case, he travels the globe battling mortal danger and psychological disorientation. Part Three Faces of Eve, part The Spy Who Came in From the Cold, and always pure Robert Littell, Legends'from unforgettable opening to astonishing ending'again proves Littell's unparalleled prowess as a seductive storyteller.\n\n\nBy Robert Littell\nPublished by Penguin Group in 2012\nMOBI 386 pages, English ","torrent":{"xt":"urn:btih:72e7eaa030d18b6e765b7093c9a3295d606c5b81","amp;dn":"Legends+%28Mobi%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"72e7eaa030d18b6e765b7093c9a3295d606c5b81","infoHashBuffer":{"type":"Buffer","data":[114,231,234,160,48,209,139,110,118,91,112,147,201,163,41,93,96,108,91,129]},"announce":[],"urlList":[]}}