{"title":"50 and More Essential NMR Experiments - A Detailed Guide","uid":12207510,"size":46049143,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7316c8bb683c590ff03de0f053df75880e073ce5&amp;dn=50+and+More+Essential+NMR+Experiments+-+A+Detailed+Guide&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"clouderone","files":1,"time":1439017499,"description":"50 and More Essential NMR Experiments - A Detailed Guide - Matthias Findeisen, Stefan Berger (Wiley-VCH, 2014).pdf\n\nISBN 978-3-527-33483-4\n\nThis book is the perfect link for learning how to perform the experiments after only having studied theory. In eight chapters more than 50 essential NMR experiments are described in detail. Special focus is put on the organic set of NMR spectra (1H, 13C-APT, COSY, NOESY, HSQC and HMBC). Different chapters deal with advanced organic NMR, selective methods, heteronuclear NMR, relaxation and diffusion measurements, organic applications and maintenance. Every experiment has a section providing the reader with the purpose and scope of the specific experiment. Every experiment is concluded with the spectrum as it is obtained under the conditions described. Questions\nand comments enable the reader to check their understanding. The authors are very experienced and the whole book is in full color, which enhances the reading experience and makes the spectra and other figures easier to understand. \nThis book is strongly recommended for all students and researchers who are involved in the structural elucidation of chemical compounds both in practical education and in pursuing research, in particular if they handle an NMR spectrometer","torrent":{"xt":"urn:btih:7316c8bb683c590ff03de0f053df75880e073ce5","amp;dn":"50+and+More+Essential+NMR+Experiments+-+A+Detailed+Guide","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7316c8bb683c590ff03de0f053df75880e073ce5","infoHashBuffer":{"type":"Buffer","data":[115,22,200,187,104,60,89,15,240,61,224,240,83,223,117,136,14,7,60,229]},"announce":[],"urlList":[]}}