{"title":"Great Ages of Man - Imperial Rome (History Arts Ebook).pdf","uid":11090244,"size":43696854,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:73565983be96064c453b02bf9211af14404d4d2f&amp;dn=Great+Ages+of+Man+-+Imperial+Rome+%28History+Arts+Ebook%29.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"STBGD","files":-1,"time":1411509954,"description":"pdf / English / 190 pag / 1965 Time Life / 41.6 MB\n\nImperial Rome is one of twenty-one volumes in the Time-Life book series Great Ages of Man. Originally published in the 1960s, this series is a history of the world's cultures. This volume is an overview of Roman political, military, and cultural history from 753 B.C. to 476 A.D.\n\nAuthor Moses Hadas has written a concise yet informative book on one of the great empires of antiquity. Topics covered include the expansion of Rome, daily life, religion, literature, the decline of Rome, and the legacy of the Roman empire. Language, law, government, and architecture are just a few of the legacies of Ancient Rome. As with other books in this series, the numerous illustrations and picture essays greatly enhance the narrative. This volume includes several maps, a time line of Roman emperors, a time line of Roman political and cultural history, and a biographical reference section profiling great Roman writers and statesmen.\n\nThis book is not only a concise history of Rome but a useful reference book as well. I used this book while teaching world history to my middle school students and found it quite useful. Highly recommended.\n\nAmazon","torrent":{"xt":"urn:btih:73565983be96064c453b02bf9211af14404d4d2f","amp;dn":"Great+Ages+of+Man+-+Imperial+Rome+%28History+Arts+Ebook%29.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"73565983be96064c453b02bf9211af14404d4d2f","infoHashBuffer":{"type":"Buffer","data":[115,86,89,131,190,150,6,76,69,59,2,191,146,17,175,20,64,77,77,47]},"announce":[],"urlList":[]}}