{"title":"The Adventures of Young Van Helsing [VHSRip]","uid":12150172,"size":1109859479,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:73f1194dfe5a5528979e82ec9be8b549d68a44d4&amp;dn=The+Adventures+of+Young+Van+Helsing+%5BVHSRip%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"lettucebe","files":1,"time":1437604732,"description":"The Adventures of Young Van Helsing: Quest for the Lost Scepter\n\nA fun-filled epic adventure in the tradition of Indiana Jones and The Mummy!\n\n-----------------------------------------------------------------------------------\n\n\nSynopsis from the back of the box:\n\nAs if everyday high school life wasn't stressful enough, Michael Harris learns that he is the last heir to Abraham Van Helsing, the legendary monster hunter and relic collector described in Bram Stoker's Dracula. \n\nAided by the whimsical Professor Arad, Michael must track down the legendary Scepter of God, a powerful biblical artifact once possessed by his great-great grandfather. But Michael is not the only one searching for the Scepter, Simon Magus -- the arch-angel that created it is also hot on its trail. \n\nCan Michael save the scepter, escape the wrath of Simon Magus and be back in time for his band to play at the Valentine's dance?\n \n\n\n\nTop review on IMDb:\n\n&quot;This is to director Kevin Summerfield what the Holocaust is to Hitler--a masterpiece.\n\nThis seems to be a film made for tweens, but at the same time it's rather bloody and gory. If I were a tween, I'd think this film has the worst acting, ever. As an older and more mature person, I can say that it just has the worst acting I've ever seen. The back of the box advertises that the story involves a &quot;whimsical&quot; professor. Now, I've seen some whimsical professors in my day, but nothing tops this guy. He looks like they walked into Whimsy Mart, asked him if he ever had a hidden passion for acting, and then superglued an Einstein wig to his head. At one point, there's a closeup where he opens a door, and his head moves in and out of the frame, as if saying &quot;HA! I AM FAR TOO WHIMSICAL FOR A MEASLY CLOSE-UP!&quot; It's also hilariously, ineptly racist. I can't possibly believe that in the year 2004 a movie was made that features a black man looking at something and shouting &quot;DAAAAYYYYUUMMMM!&quot;, but this movie does. The plot, which helpfully has a flashback at the beginning, and a bizarre tangent of a flashback near the end that make the plot only even more retarded. There's a time-telling device that is obviously a CD player painted tan with jewels on it. I really wonder if this wasn't a student film, but Kevin Summerfield has been making movies for a few years before this one. \n\nIf you see this in the five dollar bin at Wal-Mart (which thankfully I did not have to go through the trauma of, and saw this through a friend), you probably will not want to pick it up. Unless, of course, you are a racist, retarded sort of pre-teen.&quot;","torrent":{"xt":"urn:btih:73f1194dfe5a5528979e82ec9be8b549d68a44d4","amp;dn":"The+Adventures+of+Young+Van+Helsing+%5BVHSRip%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"73f1194dfe5a5528979e82ec9be8b549d68a44d4","infoHashBuffer":{"type":"Buffer","data":[115,241,25,77,254,90,85,40,151,158,130,236,155,232,181,73,214,138,68,212]},"announce":[],"urlList":[]}}