{"title":"Audiostrobe Sessions for Light and Sound Mind Machines [MXS]","uid":12168844,"size":1667733,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:7615e34b206351aa09e1545312a497dbd36837a8&amp;dn=Audiostrobe+Sessions+for+Light+and+Sound+Mind+Machines+%5BMXS%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"elessedilgirl","files":230,"time":1438100511,"description":"Massive collection of Audiostrobe sessions for those of you with Audiostrobe compatible Light and Sound Mind Machines.\n\nCollected these sessions from various sources over the years.\n\nINSTRUCTIONS:\n\n1. Run the MESesToWavConv program\n2. Load your preferred session into the program, name the file and save it to your Hard Drive.\n3. Connect your machine to your audio source via AUX and set it to AS mode.\n4. Play the audio.\n\nMESesToWavConv has been run through VirusTotal and reported clean\n\n\n950a1ef3eeaf68c118fa38a5e0f9cbeff0bc693847c0fe4a8917425811d9f755\n\n\nFor those of you who want to know the exact specs for each session you can download and install a demo version of MindExplorer SW and load the MXS file into it. If you want to take advantage of the full range of features for Mind Explorer SW (edit sessions, increase/decrease session length, create your own sessions) you will need to buy it.\n\nMESesToWavConv works on Win 95 and Win 8.1 so should work on any version in-between.\n\nYou can also convert the WAV file to MP3 but would recommend 320 kbps CBR. Anything less and you might start to lose some of the Audiostrobe signal. Also a lot of MP3 players (even some of the expensive ones) lack the volume output to drive the Audiostrobe signal fully, even at max volume, so if that's the case with your MP3 player (either WAV or MP3) you will need a different audio source. For those of you with the new Kasina machine you can simply load the WAV (or MP3) onto the SD card and play it from there","torrent":{"xt":"urn:btih:7615e34b206351aa09e1545312a497dbd36837a8","amp;dn":"Audiostrobe+Sessions+for+Light+and+Sound+Mind+Machines+%5BMXS%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7615e34b206351aa09e1545312a497dbd36837a8","infoHashBuffer":{"type":"Buffer","data":[118,21,227,75,32,99,81,170,9,225,84,83,18,164,151,219,211,104,55,168]},"announce":[],"urlList":[]}}