{"title":"Islander-Violence_and_Destruction-CD-FLAC-2014-FORSAKEN","uid":11102110,"size":290722984,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:77ee78d8886752cc8b7bd4affcace4c96d6c5df8&amp;dn=Islander-Violence_and_Destruction-CD-FLAC-2014-FORSAKEN&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"SaRGN","files":-1,"time":1411681357,"description":"Islander-Violence and Destruction-CD-FLAC-2014-FORSAKEN\n\n\nRelease info:\n\nArtist : Islander\nAlbum : Violence &amp; Destruction\nLabel : Victory Records\nGenre : Metal\nSource : CD\nStreet Date : 2014-07-08\nQuality : 1003kbps / 44.1kHz / 2 channels\nEncoder : FLAC 1.2.1\nSize : 288.59 MB\n\n\nIt has been quite a journey for ISLANDER, who, in just over a\nyear, have gone from obscurity to a band in constant radio\nrotation. Fueled with a combination of emotionally capturing\nsongs and audience grabbing live shows, ISLANDER continue to lead\nat the forefront of their peers\n\nThe thrilling trip for this quartet began in the foothills of\nGreenville, S.C. with the release of their Victory Records debut\nPains. in 2013. Now, a lethal combination of alt-rock, punk and\nnu-metal that recalls the finest of bands like Refused and\nDeftones, ISLANDER have released their full length Violence\nDestruction to critical recognition. Comprised of members Mikey\nCarvajal on vocals, Andrew Murphy on guitar, drummer Eric Frazier\nand bassist Chris Doot, ISLANDER recorded the album with producer\nCameron Webb SILVERSTEIN, ALKALINE TRIO) at Hollywood's NRG\nStudios. It is twelve tracks of American rock anthems spawned by\nindividual struggle and organic affection. The result is a\nrefreshing and unpredictable performance of cutting edge\nmodern-day rock with classic punk overtones fused with groove\nladen beats\n\nViolence &amp; Destruction awakens the nerves and lets life in. From\nthe blockbuster single 'Coconut Dracula', to the outlaw\ncollaboration of 'Criminals' with P.O.D.'s Sonny Sandoval and the\nfist-pumping title track, ISLANDER sonically 'demonstrate that\nfragile dichotomy between softness and weight in a riff', as\ndescribed by Noisey/Vice\n\nAlready this year, ISLANDER have been part of the Rockstar Energy\nDrink Mayhem Festival and their full length release Violence\nDestruction was deemed one of Revolver's 'Most Anticipated Of\n2014'. The proof is evident in the response\n\nAlternative Press confirmed that ISLANDER was one the '100 Bands\nYou Need To Know' as 2014 continues to shine with festival\nconfirmations at Aftershock in Sacramento and Louder Than Life in\nLouisville\n\nThe band made the most of the Mayhem Tour, not only by generating\ntens of thousands of fans across the festival tour's routing, but\nalso with other bands on the bill - most notably KoRn, who's\nmembers were found to be onstage watching ISLANDER's incendiary\nperformances each day. Is this an indication of a collaboration\nto come? Time will tell. In the meantime, several of the very\nbands that inspired them, are professing their affection for\nISLANDER, including KoRn, Papa Roach, and P.O.D\n\nU want a new, unique, sick band with a CD full of great songs\nNot 1 bad song! You won't regret getting ISLANDER\nBrain 'Head' Welch, KoRn\n\nISLANDER is perfect in the mix. It's got a heavy sound, and\nsuper solid lyrics and hooks that don't stop. It's like a heavy\nrock song with pop sensibility. Active Rock needs more bands like\nISLANDER that can write melodies and hooks - that aren't written\nby a 10-year old songwriting formula. I can't rave enough about\nCoconut Dracula\nJay Patrix, WTZR\n\nCoconut Dracula is a song that immediately stood out to me. For\nsuch a young band ISLANDER have captured a sound far beyond their\nyears. These are the kind of bands Active Rock needs to break\nAndy Green, WRIF\n\nCoconut Dracula is a great summer record! Jumps through the\nspeakers because it sounds so different than the pile of\nsound-alike bands\nRandy Hawke, WJJO\n\nI caught ISLANDER on the Rockstar Energy Drink Mayhem Fest, and\nno bullshit, it was one of the highlights of the day for me\nGreat energy, great crowd response. Can't wait to see them again\nPaul Cannell, KTUX\n\nThese guys just might be the new force in heavy rock\nAlternative Press\n\n\n==============================================================================\n\nPlease Keep it For Continue Seeding and Help Others To Get Download\n\n===============================================================================","torrent":{"xt":"urn:btih:77ee78d8886752cc8b7bd4affcace4c96d6c5df8","amp;dn":"Islander-Violence_and_Destruction-CD-FLAC-2014-FORSAKEN","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"77ee78d8886752cc8b7bd4affcace4c96d6c5df8","infoHashBuffer":{"type":"Buffer","data":[119,238,120,216,136,103,82,204,139,123,212,175,252,172,228,201,109,108,93,248]},"announce":[],"urlList":[]}}