{"title":"It's About Time-Understanding Einstein's Relativity David Mermin","uid":12181277,"size":2650105,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:784b3aec3c35b3b3e8a88dfd977c8b67eb66124f&amp;dn=It%27s+About+Time-Understanding+Einstein%27s+Relativity+David+Mermin&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"Cquark","files":1,"time":1438450166,"description":"Author : David N. Mermin\nISBN : 978-0-691-14127-5\nFormat : True PDF (not bookmarked)\nPublisher : PRINCETON UNIVERSITY PRESS\nPages 209\n\nBook Description :\nRelativity is a damned hard subject to fully comprehend, but it is an important part of being an educated person. Without this knowledge, one can occasionally make a serious mistake in judgment and be dead wrong about certain things. David Mermin explains the necessary thinking in a beautiful, skillful way. I can't imagine his making it clearer or simpler, but nevertheless, it is a HARD bit of reasoning to master. This short book requires reading word-for-word and then some rereading, but this is not a burden. It is written with a light, pleasant touch that is a delight and I fully recommend it to anyone ready to make a serious effort at understanding the real world.\n\nBest Customer Review :\nOne hundred years after Einstein published the theory of relativity, publishers are still promoting popular books that explain reltivity to the lay reader. This is the best such book that I have read. That's because Mermin's approach is to help the reder to develop a thinking style so that it becomes almost second nature to get your brain to hop between moving frames of reference. Mermin's thought experiments examine the outcome of experiments performed on moving trains or by moving rockets. The reader discovers the trick of examining the outcome from two points of view: inside the moving train, and outside watching the train go by. Almost everyone, including professers of physics, will benefit from a careful rreading of this book. It does include many equations and diagrams","torrent":{"xt":"urn:btih:784b3aec3c35b3b3e8a88dfd977c8b67eb66124f","amp;dn":"It%27s+About+Time-Understanding+Einstein%27s+Relativity+David+Mermin","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"784b3aec3c35b3b3e8a88dfd977c8b67eb66124f","infoHashBuffer":{"type":"Buffer","data":[120,75,58,236,60,53,179,179,232,168,141,253,151,124,139,103,235,102,18,79]},"announce":[],"urlList":[]}}