{"title":"Never Alone Foxtales-SKIDROW","uid":12190007,"size":2073631536,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:784b99a21bdac2259f6b801660974ec51f92392c&amp;dn=Never+Alone+Foxtales-SKIDROW&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Varaoeba","files":2,"time":1438632051,"description":"\n\nS K I D R O W\n.the leading force.\n\nproudly presents\nNever Alone: Foxtales (c) E-Line Media\n\n28-07-2015......Release Date &lt;-&gt; Protection.................Steam\nAction.............Game Type &lt;-&gt; Disk(s)....................1 DVD\n\nRELEASE NOTES\n\nSpring has come to the Arctic and Nuna and Fox return in Never Alone:\nFoxtales -- the first expansion to 2014 s award-winning indie hit Never\nAlone (Kisima Ingitchuna).\n\nTravel across open seas, swim through the ruins of a sunken village and\npaddle up the Noatak River on a mission to rescue a new friend. You ll\nneed all your wits and the skills of both companions to survive the\ndangers of the swirling currents, fierce creatures and hidden\nunderwater hazards of the Alaska coast. Only by working together can\nNuna and Fox save their friend and defeat an unexpected foe.\n\nFoxtales features three all new levels full of environments to explore,\npuzzles to solve and enemies to face. Developed in partnership with the\nAlaska Native community, Foxtales reminds us that some challenges are\nbest faced together and that even the smallest among us deserve\nrespect.\n\nFeatures:\n\nTake to the seas -- Climb aboard your umiaq (a sealskin canoe) and take\nto the waters of the coasts, rivers and lakes of Northwest Alaska.\nPaddle through waves, ice floes and rapids or dive underwater and\njourney across the sea floor, inside mysterious caverns and through a\nsunken village.\n\nSeek the help of the spirits and your companion -- Discover spirit\nhelpers who can change the course of currents at your command. Switch\nbetween Nuna and Fox in single player mode or play with a friend in\nlocal co-op mode.\n\nExplore Alaska Native culture -- Foxtales includes five new unlockable\nCultural Insight videos featuring members of the Alaska Native\ncommunity including the family of Willie Panik Goodwin, Sr., the\nstoryteller whose tale of The Two Coastal Brothers inspired the game.\n\nNOTE: Game is made standalone as whole file structure updated!\n\nINSTALL NOTES\n\n1. Unpack the release\n2. Mount or burn image\n3. Install\n4. Copy everything from the SKIDROW folder into the game installation\n5. Block the game in your firewall and mark our cracked content as\nsecure/trusted in your antivirus program\n6. Play the game\n7. Support the companies, which software you actually enjoy!\n\nGREETINGS\n\nTo all friends of the family and honorable rival groups!\n\nascii art by the\ngodlike &amp; terrific duo\nmalodix + irokos\ntitan artdivision","torrent":{"xt":"urn:btih:784b99a21bdac2259f6b801660974ec51f92392c","amp;dn":"Never+Alone+Foxtales-SKIDROW","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"784b99a21bdac2259f6b801660974ec51f92392c","infoHashBuffer":{"type":"Buffer","data":[120,75,153,162,27,218,194,37,159,107,128,22,96,151,78,197,31,146,57,44]},"announce":[],"urlList":[]}}