{"title":"Social Order of the Underworld: How Prison Gangs Govern(2014)","uid":12160971,"size":1267084,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:79eef8ef0dbe29b8f42aeb91a6fdf73c8a82777c&amp;dn=Social+Order+of+the+Underworld%3A+How+Prison+Gangs+Govern%282014%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"bookzilla","files":1,"time":1437869835,"description":"The Social Order of the Underworld: How Prison Gangs Govern the American Penal System\n\npdf\n\n\n When most people think of prison gangs, they think of chaotic bands of violent, racist thugs. Few people think of gangs as sophisticated organizations (often with elaborate written constitutions) that regulate the prison black market, adjudicate conflicts, and strategically balance the competing demands of inmates, gang members, and correctional officers. Yet as David Skarbek argues, gangs form to create order among outlaws, producing alternative governance institutions to facilitate illegal activity. He uses economics to explore the secret world of the convict culture, inmate hierarchy, and prison gang politics, and to explain why prison gangs form, how formal institutions affect them, and why they have a powerful influence over crime even beyond prison walls. The ramifications of his findings extend far beyond the seemingly irrational and often tragic society of captives. They also illuminate how social and political order can emerge in conditions where the traditional institutions of governance do not exist","torrent":{"xt":"urn:btih:79eef8ef0dbe29b8f42aeb91a6fdf73c8a82777c","amp;dn":"Social+Order+of+the+Underworld%3A+How+Prison+Gangs+Govern%282014%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"79eef8ef0dbe29b8f42aeb91a6fdf73c8a82777c","infoHashBuffer":{"type":"Buffer","data":[121,238,248,239,13,190,41,184,244,42,235,145,166,253,247,60,138,130,119,124]},"announce":[],"urlList":[]}}