{"title":"Enter the Kettlebell!: Strength Secret of the Soviet Supermen","uid":12213559,"size":9304584,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7aabeacfba76874078ce82d9507a68b244cf8696&amp;dn=Enter+the+Kettlebell%21%3A+Strength+Secret+of+the+Soviet+Supermen&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"mdusanjay","files":1,"time":1439181712,"description":"Pavel Tsatsouline, &quot;Enter the Kettlebell!: Strength Secret of the Soviet Supermen&quot;\n\nISBN: 0938045695 | 2006 | EPUB | 200 pages | 9 MB\n\nKettlebell Training... The Closest Thing You Can Get to Fighting, Without Throwing A Punch Federal Counterterrorist Operator The kettlebell. AK-47 of physical training hardware. Hunk of iron on a handle. Simple, sinister, brutal and ferociously effective for developing explosive strength, dramatic power and never-say-die conditioning. The man s man s choice for the toughest, most demanding, highest-yield exercise tool on the planet. Guaranteed to forge a rugged, resilient, densely-muscled frame built to withstand the hardest beating and dish it right back out, 24/7. Once the prized and jealously-guarded training secret of elite Russian athletes, old-school strongmen and the military, the kettlebell has invaded the West. And taken no prisoners thanks to former Soviet Special Forces physical training instructor and strength author, Pavel Tsatsouline s 2001 publication of The Russian Kettlebell Challenge and his manufacture of the first traditional Russian kettlebell in modern America. American hardmen of all stripes were quick to recognize what their Russian counterparts had long known nothing, nothing beats the kettlebell, when you re looking for a single tool to dramatically impact your strength and conditioning","torrent":{"xt":"urn:btih:7aabeacfba76874078ce82d9507a68b244cf8696","amp;dn":"Enter+the+Kettlebell%21%3A+Strength+Secret+of+the+Soviet+Supermen","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7aabeacfba76874078ce82d9507a68b244cf8696","infoHashBuffer":{"type":"Buffer","data":[122,171,234,207,186,118,135,64,120,206,130,217,80,122,104,178,68,207,134,150]},"announce":[],"urlList":[]}}