{"title":"I Kill It TS 4: Asian Edition XXX 2013 (Trans500 Studios) WEB-DL","uid":12237825,"size":2842100574,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:7aabb48651e0f50fdb11538ceabdbaf7ac5ecb13&amp;dn=I+Kill+It+TS+4%3A+Asian+Edition+XXX+2013+%28Trans500+Studios%29+WEB-DL&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"Ctrlme","files":4,"time":1439698492,"description":"I Kill It TS 4: Asian Edition XXX 2013 (Trans500 Studios) WEB-DL\n\nScreenshot(s): &lt;a href=&quot;\nhttp://imgctrl.com/image/N2z&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgctrl.com/image/N2z&lt;/a&gt;\n &lt;a href=&quot;\nhttp://imgctrl.com/image/NM8&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgctrl.com/image/NM8&lt;/a&gt;\n &lt;a href=&quot;\nhttp://imgctrl.com/image/NMA&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgctrl.com/image/NMA&lt;/a&gt;\n\nDescription: I Kill It TS 4 brings cute Asian girls to the forefront along with their oddball names. :P Dati gets the show running and quite hot at that in her black lingerie that she quickly removes. After showing off her body a bit to some sultry music. Ramon steps in and she soon has his gigantic cock in her mouth. Ramon first fucks her from behind while they're on their sides. Then she bounces on him cowgirl and reverse cowgirl. Ramon gets her on her back and plugs away and then finishes with a nice facial. Tip and her bright yellow dress open up next. She slides off the dress to show her black underwear that she seductively removes. After showing off some, she goes down on Ramon. Then Ramon fucks her while she's standing and in her high heels. Then they move to a chair where she rides him cowgirl and flips it around reverse cowgirl too. After a bit, she starts stroking really hard and pops off a massive cumshot for the camera and it doesn't slow her down at all. Soon after though Ramon cums in her mouth. Following that is the petite girl named New. She shows off her body, while stroking her cock some. Then the scene switches to her chatting up the camera man. Ramon sneaks in and after some more chit chat, she unzips him and goes to town on his cock. Ramon sits down and she hops on him cowgirl, then after a bit she turns around reverse cowgirl while she strokes it and cums for the camera. Still eager for the dick, she takes in Ramon doggy style and then on her back. Shortly after Ramon pulls out and cums in her mouth. Paja, pale and sexy sets the next scene. She happily plays with Ramon's cock in her mouth. Then she takes him in while on her side and Ramon is fucking from behind. They switch to doggy style and then reverse cowgirl and cowgirl. Ramon closes with a cum shot on her tits. After, the camera switches to Paja alone stroking her self off until she sprays cum on herself. To close is Nania. She's in a cute skirt and top but no panties. She undresses before going down on Ramon as she seductively looks into the camera. After Ramon is warmed up, she takes him in doggy style on the sofa. Then she gets on him cowgirl while Ramon thrusts away. Shortly after, they get on their sides and fuck while she strokes her cock. Next, Nania is on her back daintily stroking her self while Ramon fucks her and finally Ramon finishes with a cumshot on and in her mouth. Then it switches to Nania with cum still on her face, squirting nicely for the camera. \n\nLength: 1:42:21\n\nScene 1: Dati\nScene 2: Tip\nScene 3: New\nScene 4: Paja\nScene 5: Nania\n\nâ˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…\n\n               If you like this torrent, please post a comment!\n            \n                            Don't forget to seed!\n\nâ˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…\n &lt;a href=&quot;\nhttps://pirates-forum.org/User-Ctrlme&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://pirates-forum.org/User-Ctrlme&lt;/a&gt;\n &lt;a href=&quot;\nhttps://thepiratebay.vg/user/Ctrlme/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://thepiratebay.vg/user/Ctrlme/&lt;/a&gt;","torrent":{"xt":"urn:btih:7aabb48651e0f50fdb11538ceabdbaf7ac5ecb13","amp;dn":"I+Kill+It+TS+4%3A+Asian+Edition+XXX+2013+%28Trans500+Studios%29+WEB-DL","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7aabb48651e0f50fdb11538ceabdbaf7ac5ecb13","infoHashBuffer":{"type":"Buffer","data":[122,171,180,134,81,224,245,15,219,17,83,140,234,189,186,247,172,94,203,19]},"announce":[],"urlList":[]}}