{"title":"Florence + The Machine - How Big, How Blue, How Beautiful (2015)","uid":12168947,"size":361477291,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:7bb1288b55799b33b1b62699239b3e57993029cc&amp;dn=Florence+%2B+The+Machine+-+How+Big%2C+How+Blue%2C+How+Beautiful+%282015%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"pucholoco","files":29,"time":1438102498,"description":"    Florence + The Machine - How Big, How Blue, How Beautiful (2015)[EAC-FLAC]\n            EAC rip (secure mode) | FLAC (tracks)+CUE+LOG -&gt; 343 Mb\n                     Full Artwork @ 300 dpi (jpg) -&gt; 14 Mb\n\n\nThe much-anticipated third studio long-player from Florence Welch and her mechanically inclined companions, How Big, How Blue, How Beautiful arrives after a period of recalibration for the spirited English songtress. Arriving three-and-a-half years after 2011's well-received Ceremonials, the 11-track set, the first Florence + the Machine album to be produced by Markus Dravs (Arcade Fire, Coldplay), eschews some of the bombast and water- and death-fixated metaphors of Lungs and Ceremonials in favor of a more restrained sonic scope and an honest reckoning with the dark follies of your late twenties. \n\nThis change is most notable on the workmanlike opener &quot;Ship to Wreck,&quot; a shimmering, open road-ready folk-rock rumination on the ambiguity/inevitability of post-fame self-destruction that, unlike prior first cuts like &quot;Dog Days Are Over&quot; and &quot;Only If for a Night,&quot; feels firmly rooted in the now.\n\nWhether it be simple maturity or Dravs' calculated production style, there's no denying that an effort has been made to dial back a bit on some of the pageantry of Welch's earlier works, and for the most part, her penchant for pairing mystic Bronte-esque pondering with similarly windswept pagan/gothic gospel rock is left bubbling beneath the surface. \n\nThis attempt to reign in Welch's more histrionic tendencies yields mixed results, with some songs finding the sweet spot between bluster and nuance and others (most of them in the album's sleepy latter half) disappearing altogether. Of the former, the bluesy (and ballsy) &quot;What a Man,&quot; the propulsive and purposeful &quot;Delilah,&quot; and the gorgeous title track impress the most. Instead of building to a fevered crescendo, as is the Flo-Machine way, the latter cut, a transcendent, slow-burning, chamber pop gem, dissolves into a simple and elegant, yet still goose-bump-inducing round of horns, and is breathtaking without knocking the wind out of you. Whether How Big, How Blue, How Beautiful ends up being a transitional album remains to be seen, as there is enough of each side of Welch (the pastoral and the feral) represented to tip the scale either way. \n\nThat said, her Brit-pop soul treacle is still miles better than some of her contemporaries' top-tier offerings, and when the album connects it moves right in and starts to redecorate, but when it falters, it's akin to a chatty party guest failing to realize that everyone else has gone home.\n\n\n----------------------------------------------------------------------------\nTracklist:\n----------------------------------------------------------------------------\n\n01 - Ship to Wreck\n02 - What Kind of Man\n03 - How Big, How Blue, How Beautiful\n04 - Queen of Peace\n05 - Various Storms &amp; Saints\n06 - Delilah\n07 - Long &amp; Lost\n08 - Caught\n09 - Third Eye\n10 - St. Jude\n11 - Mother\n\n*2015 Island Records | 602547236067\n\n\n\nEnjoy and Sharing, Thanks!","torrent":{"xt":"urn:btih:7bb1288b55799b33b1b62699239b3e57993029cc","amp;dn":"Florence+%2B+The+Machine+-+How+Big%2C+How+Blue%2C+How+Beautiful+%282015%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7bb1288b55799b33b1b62699239b3e57993029cc","infoHashBuffer":{"type":"Buffer","data":[123,177,40,139,85,121,155,51,177,182,38,153,35,155,62,87,153,48,41,204]},"announce":[],"urlList":[]}}