{"title":"Ceramic Materials - Science and Engineering","uid":12126370,"size":20776600,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7c321f19534d475fb5615dcffd1f71b595946be7&amp;dn=Ceramic+Materials+-+Science+and+Engineering&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"ferdgust","files":1,"time":1436931584,"description":"Ceramic Materials - Science and Engineering - C. Barry Carter, M. Grant Norton (Springer, 2007).pdf\n\nISBN: 9780387462707\n\nCeramic Materials: Science and Engineering is an up-to-date treatment of ceramic science, engineering, and applications in a single, integrated text. Building on a foundation of crystal structures, phase equilibria, defects and the mechanical properties of ceramic materials, students are shown how these materials are processed for a broad diversity of applications in today's society. Concepts such as how and why ions move, how ceramics interact with light and magnetic fields, and how they respond to temperature changes are discussed in the context of their applications. References to the art and history of ceramics are included throughout the text. The text concludes with discussions of ceramics in biology and medicine, ceramics as gemstones and the role of ceramics in the interplay between industry and the environment. Extensively illustrated, the text also includes  questions for the student and recommendations for additional reading.   \n\nKEY FEATURES: \n\nCombines the treatment of bioceramics, furnaces, glass, optics, pores, gemstones, and point defects in a single text \n\nProvides abundant examples and illustrations relating theory to practical applications Suitable for advanced undergraduate and graduate teaching and as a reference for researchers in materials science \n\nWritten by established and successful teachers and authors with experience in both research and industry","torrent":{"xt":"urn:btih:7c321f19534d475fb5615dcffd1f71b595946be7","amp;dn":"Ceramic+Materials+-+Science+and+Engineering","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7c321f19534d475fb5615dcffd1f71b595946be7","infoHashBuffer":{"type":"Buffer","data":[124,50,31,25,83,77,71,95,181,97,93,207,253,31,113,181,149,148,107,231]},"announce":[],"urlList":[]}}