{"title":"Computational Fluid Dynamics - An Introduction","uid":12166799,"size":7258503,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7c45bf20d39d39c658ab728e42669d862fde463b&amp;dn=Computational+Fluid+Dynamics+-+An+Introduction&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"clouderone","files":1,"time":1438058020,"description":"Computational Fluid Dynamics - An Introduction (Springer, 1992).pdf\n\nISBN 9783662113523\n\nThis book is an outgrowth of a von Kannan Institute Lecture Series by the same title first presented in 1985 and repeated with modifications in succeeding years. The objective, then and now, was to present the subject of computational fluid dynamics (CFD) to an audience unfamiliar with all but the most basic aspects of numerical techniques and to do so in such a way that the practical application ofCFD would become clear to everyone. Remarks from hundreds of persons who followed this course encouraged the editor and the authors to improve the content and organization year by year and eventually to produce the present volume. The book is divided into two parts. In the first part, John Anderson lays out the subject by first describing the governing equations offluid dynamics, concentration on their mathematical properties which contain the keys to the choice of the numerical approach. Methods of discretizing the equations are discussed next and then transformation techniques and grids are also discussed. This section closes with two examples of numerical methods which can be understood easily by all concerned: source and vortex panel methods and the explicit method. The second part of the book is devoted to four self-contained chapters on more advanced material: Roger Grundmann treats the boundary layer equations and methods of solution; Gerard Degrez treats implicit time-marching methods for inviscid and viscous compressible flows, and Eric Dick treats, in two separate articles, both finite-volume and finite-element methods","torrent":{"xt":"urn:btih:7c45bf20d39d39c658ab728e42669d862fde463b","amp;dn":"Computational+Fluid+Dynamics+-+An+Introduction","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7c45bf20d39d39c658ab728e42669d862fde463b","infoHashBuffer":{"type":"Buffer","data":[124,69,191,32,211,157,57,198,88,171,114,142,66,102,157,134,47,222,70,59]},"announce":[],"urlList":[]}}