{"title":"Pantera - Vulgar Display Of Power(20th Anniversary Deluxe Editio","uid":11077805,"size":139327584,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:7c95ced23594a663af52f235cfc8979d009e86f1&amp;dn=Pantera+-+Vulgar+Display+Of+Power%2820th+Anniversary+Deluxe+Editio&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"analogkid6103","files":12,"time":1411357221,"description":"\nTracks\n1. Mouth For War 3:57\n2. A New Level 3:57\n3. Walk 5:15\n4. Fucking Hostile 2:48\n5. This Love 6:32\n6. Rise 4:36\n7. No Good (Attack The Radical) 4:48\n8. Live In A Hole 5:01\n9. Regular People (Conceit) 5:27\n10. By Demons Be Driven 4:40\n11. Hollow 5:49\n12. Piss (Bonus Track) 5:07\n\nLast line-up\nPhilip Hansen Anselmo : Vocals\nVincent Paul Abbott (aka Vinnie Paul) : Drums\nDarrell &quot;Dimebag&quot; Abbott : Guitar\nRex Robert Brown (aka Rexx Rocker, aka T-Rex) : Bass, Back Vocals\n\nFormer/Past members\nTommy Bradford : Bass\nTerry Glaze : Vocals, Guitar\nSeth Putnam : Vocals\nMatt L'Amour : Vocals\nDavid Peacock : Vocals\nDonnie Hart : Vocals\nMarc Ferrari : Guitar, Back Vocals\n\nBio\nCritics writing about Pantera fall over themselves in search of adjectives to describe the fiercely independent foursome: &quot;Boot kicking&quot; &quot;A Metal massacre&quot; &quot;Crushing&quot; &quot;Searing&quot; - the list goes on and on. Log onto the numerous websites manned by rabid and loyal fans, and you'll find chat rooms filled with their own testaments of faith to the band: &quot;They never sold out.&quot; &quot;They're as heavy as shit.&quot; &quot;They always speak their mind.&quot; &quot;They don't give a flying fuck about any of the others.&quot; But ask Philip Anselmo, the charismatic, often merciless frontman of Pantera about his take on their success and you get the true, living, breathing definition of this uncompromising phenomenon. &quot;We've survived every fucking trend. Heavy metal, grunge metal, funk metal, rap metal - and we're still here. We put everyone on notice that we don't fuck around. Our fans know we're true right down to the fucking core.&quot;\n\n\n\n&quot;We took more time on this album, much more time,&quot; says Vinnie. The album was crafted in their own home studio in Texas, with the band also anointing Vinnie and Dimebag Darrell as sole producers on this one. Terry Date, who has helped guide their four other studio albums, agreed it was time to let Vinnie and Dimebag fly solo on this effort.\n\n&quot;He was real cool about it,&quot; says Vinnie. &quot;This just seemed like a natural progression to let us have a go at it. We were able to concentrate and work at a steadier pace, going in for a couple of days a week. It gave us a better perspective on what we were trying to achieve.&quot;\n\nAnd though Vinnie is reluctant to describe the songs on Reinventing The Steel, Phil's riveting bolts of passionate, in-your-face vocals are again faithfully discharged under the familiar Pantera squall of Dimebag's guitars, Vinnie's drums, and Rex's deft bass playing. &quot;It was great having Vinnie and Dimebag producing,&quot; says Phil. &quot;We were able to come in and do our thing with none of the pressures. 100% bullshit proof. The evidence is in the music. We've been through so much together you can just feel the energy that went into making this album.&quot; Soulfully brutal tracks like &quot;Revolution Is My Name,&quot; and &quot;We'll Grind That Axe For A Long Time,&quot; pulse with the restless angst fans have come to expect, but soar, as well, under the steady hands of Vinnie and Dime. '&quot;We'll Grind That Axe' is in a way, our motto,&quot; says Phil. &quot;We'll keep fucking kicking ass, giving our all, until we can't fucking do it anymore. Our fans can breathe fucking easy - we're back.&quot;\n\nAs if they ever left. Pantera's incredible rise to the top of the metal heap has been nothing short of miraculous when you consider they've made their historic climb with virtually no radio support or MTV exposure. With 4 platinum albums under their belt, 3 gold home videos and 2 Grammy nominations, Pantera are just beginning to garner the recognition they deserve. Relentless touring since 1990's breakthrough album Cowboys From Hell, has seen them go from local Texas phenoms to mortifying trailblazers of the legendary Ozzfest. Touring with their idols was one of the highlights of Pantera's career. One of the most hellraising songs on the new disc, &quot;Yesterday Don't Mean Shit,&quot; was penned on their most recent run on the Black Sabbath Reunion Tour. &quot;It was the first song written for the new album,&quot; says Vinnie. &quot;I think it establishes the code.&quot;\n\n &quot;We totally control our own destiny now. And that's just the way we want it.&quot;\n\nThe band's relentless touring and fierce dedication to their fans have inoculated them against the usual trappings that have brought down other metal bands, making them the standard-bearers for integrity minded rock.\n\nA crown that came naturally, says Vinnie: &quot;We don't ever try to be anything we aren't. The bond between us and our fans can't be broken because they see themselves up there when we play. You can never fake that.&quot;\n\n","torrent":{"xt":"urn:btih:7c95ced23594a663af52f235cfc8979d009e86f1","amp;dn":"Pantera+-+Vulgar+Display+Of+Power%2820th+Anniversary+Deluxe+Editio","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7c95ced23594a663af52f235cfc8979d009e86f1","infoHashBuffer":{"type":"Buffer","data":[124,149,206,210,53,148,166,99,175,82,242,53,207,200,151,157,0,158,134,241]},"announce":[],"urlList":[]}}