{"title":"Combat-Ready Kitchen: How the U.S. Military Shapes","uid":12214041,"size":1369103,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7da9bba40b9809beb75e6bf193deec2ea40b70cd&amp;dn=Combat-Ready+Kitchen%3A+How+the+U.S.+Military+Shapes&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"mdusanjay","files":1,"time":1439196581,"description":"Anastacia Marx de Salcedo, &quot;Combat-Ready Kitchen: How the U.S. Military Shapes the Way You Eat&quot;\n\nISBN: 1591845971 | 2015 | EPUB | 304 pages | 718 KB\n\nAmericans eat more processed foods than anyone else in the world. We also spend more on military research. These two seemingly unrelated facts are inextricably linked. If you ever wondered how ready-to-eat foods infiltrated your kitchen, you'll love this entertaining romp through the secret military history of practically everything you buy at the supermarket.\nIn a nondescript Boston suburb, in a handful of low buildings buffered by trees and a lake, a group of men and women spend their days researching, testing, tasting, and producing the foods that form the bedrock of the American diet. If you stumbled into the facility, you might think the technicians dressed in lab coats and the shiny kitchen equipment belonged to one of the giant food conglomerates responsible for your favorite brand of frozen pizza or microwavable breakfast burritos. So you'd be surprised to learn that you've just entered the U.S. Army Natick Soldier Systems Center, ground zero for the processed food industry.\nEver since Napoleon, armies have sought better ways to preserve, store, and transport food for battle","torrent":{"xt":"urn:btih:7da9bba40b9809beb75e6bf193deec2ea40b70cd","amp;dn":"Combat-Ready+Kitchen%3A+How+the+U.S.+Military+Shapes","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7da9bba40b9809beb75e6bf193deec2ea40b70cd","infoHashBuffer":{"type":"Buffer","data":[125,169,187,164,11,152,9,190,183,94,107,241,147,222,236,46,164,11,112,205]},"announce":[],"urlList":[]}}