{"title":"Mentorship in Academic Medicine (Wiley) [PDF] [StormRG]","uid":11078307,"size":831529,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7e98b0f40b8f5619489bc1522eba4bfbfa031a84&amp;dn=Mentorship+in+Academic+Medicine+%28Wiley%29+%5BPDF%5D+%5BStormRG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"0xmovva","files":2,"time":1411364916,"description":"Author: Sharon Straus (Editor), David Sackett (Editor)\nPaperback: 170 pages\nPublisher: BMJ Books; 1 edition (December 31, 2013)\nLanguage: English\nISBN-10: 111844602X\nISBN-13: 978-1118446027\nFormat: Retail PDF\nReader Required: Adobe Reader, Foxit, Nitro, Adobe Digital Editions\n\nNote: This is the eBook of the printed book and may not include any media,website access codes, or print supplements that may come packaged with the bound book.\n\nTested on the above readers with no problems on laptop and Android tablet. Please allow a couple seconds forthe seedboxes to kick in, then it should move pretty quick.\nHope it helps in your studies. Go for it! :D\n\n________________________________________________________________________________\n\n\nMentorship in Academic Medicine is an evidence-based guide for establishing and maintaining successful mentoring relationships for both mentors and mentees.\n\nDrawing upon the existing evidence-base on academic mentoring in medicine and the health sciences, it applies a case-stimulus learning approach to the common challenges and opportunities in mentorship in academic medicine. Each chapter begins with cases that take the reader into the evidence around specific issues in mentorship and provides actionable messages and recommendations for both correcting and preventing the problems presented in the cases. \n\nAccompanying the text is an interactive, online learning resource on mentorship. This e-tool provides updated resources for mentors and mentees, including video clips and podcasts with effective mentors who share their mentorship tips and strategies for effective mentorship. It also provides updated departmental and institutional strategies for establishing, running, and evaluating effective mentoring programs.\n\nMentorship in Academic Medicine provides useful strategies and tactics for overcoming the common problems and flaws in mentoring programs and fostering productive and successful mentoring relationships and is a valuable guide for both mentors and mentees.","torrent":{"xt":"urn:btih:7e98b0f40b8f5619489bc1522eba4bfbfa031a84","amp;dn":"Mentorship+in+Academic+Medicine+%28Wiley%29+%5BPDF%5D+%5BStormRG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7e98b0f40b8f5619489bc1522eba4bfbfa031a84","infoHashBuffer":{"type":"Buffer","data":[126,152,176,244,11,143,86,25,72,155,193,82,46,186,75,251,250,3,26,132]},"announce":[],"urlList":[]}}