{"title":"Arduino Electronics Blueprints / 1784393606","uid":12211996,"size":24921273,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7efe60459e9274250a2420084c8b9b25039bd267&amp;dn=Arduino+Electronics+Blueprints+%2F+1784393606&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Jenson100","files":2,"time":1439117176,"description":"About This Book\n\n    Build interactive electronic devices using the Arduino\n    Learn about web page, touch sensor, Bluetooth, and infrared controls\n    A project-based guide to create smartly interactive electronic devices with the Arduino\n\nWho This Book Is For\n\nThis book is intended for those who want to learn about electronics and coding by building amazing devices and gadgets with Arduino. If you are an experienced developer who understands the basics of electronics, then you can quickly learn how to build smart devices using Arduino. The only experience needed is a desire to learn about electronics, circuit breadboarding, and coding.\nWhat You Will Learn\n\n    Add SD and wave-file libraries to your Arduino code\n    Get to grips with SD card SPI communications\n    Interface an IR detection circuit to Arduino\n    Wire an OLED LCD to Arduino\n    Install the Nordic nRF8001 Bluetooth Low Energy code to Arduino\n    Build an HMI (Human Machine Interface) from a web page using JavaScript\n    Connect Arduino to a virtual server (Breakout.js)\n    Wire a small DC motor driver to Arduino with a transistor and diode circuit\n\nIn Detail\n\nArduino is an open source electronics prototyping platform for building a multitude of smart devices and gadgets. Developers can benefit from using Arduino in their projects because of the ease of coding, allowing you to build cool and amazing devices supported by numerous hardware resources such as shields in no time at all.\n\nWhether you're a seasoned developer or brand new to Arduino, this book will provide you with the knowledge and skill to build amazing smart electronic devices and gadgets. First, you will learn how to build a sound effects generator using recorded audio-wave files you've made or obtained from the Internet. Next, you will build DC motor controllers operated by a web page, a slide switch, or a touch sensor. Finally, the book will explain how to build an electronic operating status display for an FM radio circuit using Arduino.\n\n\nPaperback: 260 pages\nPublisher: Packt Publishing - ebooks Account (September 1, 2015)\nLanguage: English\nISBN-10: 1784393606\nISBN-13: 978-1784393601","torrent":{"xt":"urn:btih:7efe60459e9274250a2420084c8b9b25039bd267","amp;dn":"Arduino+Electronics+Blueprints+%2F+1784393606","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7efe60459e9274250a2420084c8b9b25039bd267","infoHashBuffer":{"type":"Buffer","data":[126,254,96,69,158,146,116,37,10,36,32,8,76,139,155,37,3,155,210,103]},"announce":[],"urlList":[]}}