{"title":"Security Tools Pack","uid":12164624,"size":25914089,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:7f0af349cd0fc7d42950d665e755d1d920538f69&amp;dn=Security+Tools+Pack&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"rubberboy37","files":1,"time":1437955876,"description":"In dit pakket de volgende beveiliging programma's, zowel 32 en 64 bit versies, die eigenlijk iedere Windows gebruiker standaard op zijn PC zou moeten hebben.\n\nIObit Uninstaller is de makkelijkste en snelste tool om programma's en browser plugins en toolbars op een grondige en effectieve manier van je PC te verwijderen. Bovendien wordt er na de verwijdering nog eens een krachtige scan uitgevoerd om zo ook alle achtergebleven registersleutels van je PC te verwijderen. Dit werkt 10 keer beter en sneller dan de ingebouwde uninstaller van Windows!\n\nVraag je je wel eens af of je systemen wel zo veilig zijn als je zou willen? De Microsoft Attack Surface Analyzer is een soort checklist die je helpt allerlei beveiligingszaken te analyseren en mogelijke gaten zo snel mogelijk te dichten. MSASA scant poorten, logs, autoun entries, services, firewall-instellingen en nog veel meer, en vat de resultaten samen in een CAB-bestand.\n\nMicrosoft Standalone System Sweeper Tool helpt in het geval van forse infecties van boot-bestanden door virussen of rootkits heb je niet zo gek veel aan een real-time scanner. In dat geval is er altijd nog MSSSST (geweldige afkorting), waarmee je een bootable CD, DVD of USB-key kunt maken met een offline kopie van de Microsoft Security Essentials erop, inclusief de nieuwste viruskenmerken die vooraf van de MS servers worden gedownload.\n\nEnhanced Mitigation Experience Toolkit verbetert de beveiliging van applicaties zonder ze te hoeven recompilen. Het voegt een aantal beveiligingen naar keuze aan een app toe, waaronder SEHOP (Structured Error Handling Overwrite Protection), DDEP (Dynamic Data Execution Prevention) en verplichte ASLR (Advanced Space Layout Randomization).\n\nGa naar 'Configure Apps' en selecteer de .exe die je wilt beschermen. Het kan zo zijn dat de extra beveiliging problemen oplevert met plugins die toegang tot de .exe vragen. Ik heb daar in mijn tests echter geen problemen mee ondervonden.\n\nAlles is getest en werkt 100&amp; op Windsows 10","torrent":{"xt":"urn:btih:7f0af349cd0fc7d42950d665e755d1d920538f69","amp;dn":"Security+Tools+Pack","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7f0af349cd0fc7d42950d665e755d1d920538f69","infoHashBuffer":{"type":"Buffer","data":[127,10,243,73,205,15,199,212,41,80,214,101,231,85,209,217,32,83,143,105]},"announce":[],"urlList":[]}}