{"title":"Bordertown (Australian mini-series, all episodes)","uid":12203017,"size":23154724760,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:7fc00f11f995eeed788fceebb1f6549179ded03c&amp;dn=Bordertown+%28Australian+mini-series%2C+all+episodes%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Bordertown","files":10,"time":1438869406,"description":"A little-known gem starring Cate Blanchett and Hugo Weaving.\n\nFrom the DVD cover:\n&quot;To the outside, Baringa appears bleak and remote: a converted army barracks in a dusty, isolated region of Australia, miles from the sea. It is hardly the place you would pick to start a new life, but for its inhabitants, it's where their dreams begin (and sometimes crumble). Cate Blanchett (The Lord of the Rings Trilogy, Robin Hood) guest stars in this touching series set within a fictional migrant camp in post-war Australia. Bordertown is a moving (and often comic) look at the lives, hopes and memories of one transient group of dreamers.\n\n&quot;The rough Australian landscape and lack of luxuries cannot deter the temporary inhabitants of Baringa. They flock there from Italy, the Netherlands, England and beyond to gain a foothold on a new existence. Among their number are craftsmen, tormented lovers, rigid military types and drifters with a criminal past. Their languages and goals may differ, but this diverse population is united in their hopes of a fresh start, a break that will finally change their luck.\n\n&quot;In the engrossing tales of love, death, money and life among these starry-eyed immigrants, you too will experience the magic and mystery of Bordertown.\n\n&quot;WARNING: CONTAINS GRAPHIC FOOTAGE THAT MAY OFFEND SOME VIEWERS.&quot;\n\nIMDB: http://www.imdb.com/title/tt0122814/","torrent":{"xt":"urn:btih:7fc00f11f995eeed788fceebb1f6549179ded03c","amp;dn":"Bordertown+%28Australian+mini-series%2C+all+episodes%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7fc00f11f995eeed788fceebb1f6549179ded03c","infoHashBuffer":{"type":"Buffer","data":[127,192,15,17,249,149,238,237,120,143,206,235,177,246,84,145,121,222,208,60]},"announce":[],"urlList":[]}}