{"title":"Night Ranger - Don't Tell Me You Love Me [promo].VOB","uid":12171744,"size":277776384,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:7fc53cdf7c916de3bd34773cd72982e4fca122b0&amp;dn=Night+Ranger+-+Don%27t+Tell+Me+You+Love+Me+%5Bpromo%5D.VOB&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"SgtRlee","files":1,"time":1438219921,"description":"Night Ranger - Don't Tell Me You Love Me [promo].VOB\n\n\nHQ rare music video from a promo DVD with 24 bit LPCM Audio. &quot;Don't Tell Me You Love Me&quot; is a hard rock song by Night Ranger written by Jack Blades from their 1982 album, Dawn Patrol. It was released as a single in January 1983 and peaked at number 40 on the Billboard Hot 100. It was ranked as the 92nd best hard rock song of all time by VH1.\n\nThe song was re-recorded for the music video game Rock Band and was released as downloadable content.\n\nDawn Patrol is the debut studio album by Night Ranger released in 1982. The band was named Ranger during the recording of the album. The first issues of the album were printed and ready to be shipped when it was discovered that there was a country band from California with the same name. The band decided to name themselves Night Ranger after the song that Blades had written for the album. The record company destroyed the copies with the band name Ranger. &quot;Don't Tell Me You Love Me&quot;, the first single / video was on heavy rotation on MTV and reached #40 on the Billboard Hot 100 and #4 on Billboard's Mainstream Rock Tracks Chart. The second single / video, &quot;Sing Me Away&quot; peaked at #54 on Billboard's Hot 100 and at #39 on Billboard's Mainstream Rock Tracks Chart in the late spring of 1983\n\n\nNight Ranger is an American rock band from San Francisco that gained popularity during the 1980s with a series of albums and singles. The band's first five albums sold more than 10 million copies worldwide. The quintet is perhaps best known for the power ballad &quot;Sister Christian&quot;, which peaked at No. 5 in June 1984.\n\nThe group's origin can be traced to Rubicon, a pop/funk group led by Jerry Martini, who gained fame as a member of Sly and the Family Stone. After Rubicon's demise in 1979, bassist Jack Blades formed a hard rock trio with two other Rubicon members, drummer Kelly Keagy and guitarist Brad Gillis. Performing under the name Stereo, the threesome added keyboardist Alan Fitzgerald, a former member of Montrose, in 1980. Fitzgerald soon recommended enlisting a second virtuoso guitarist, so Jeff Watson, who led his own band in Northern California, was added to the group. The seeds were sown for a new melodic hard rock band, initially called simply Ranger.\n\nIn 1982, the band changed its name to Night Ranger after a country band, The Rangers, claimed a trademark infringement. By this point, they had recorded Dawn Patrol for Boardwalk Records and done opening stints for ZZ Top and Ozzy Osbourne; the latter had employed Brad Gillis as a stand-in guitarist for the recently deceased Randy Rhoads in the spring and summer of 1982. After Boardwalk folded, producer Bruce Bird secured Night Ranger a deal with MCA on their Camel subsidiary in 1983.\n\nAfter their success waned in the late 1980s, the band split up in 1989 and its members pursued other musical endeavours including group and solo efforts.Brad Gillis and Kelly Keagy teamed up with bassist Gary Moon and released an album without the other original band members in 1995, but the band soon re-united to release two new albums in the latter half of the decade. Despite the departure of original keyboardist Alan Fitzgerald and guitarist Jeff Watson, the band has continued to tour and remains very popular in Asian countries, particularly Japan.\n(video does not have any logos)\n\n\n    &lt;a href=&quot;\nhttps://en.wikipedia.org/wiki/Don%27t_Tell_Me_You_Love_Me&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://en.wikipedia.org/wiki/Don%27t_Tell_Me_You_Love_Me&lt;/a&gt; \n      &lt;a href=&quot;\nhttp://postimg.org/image/cjw9ioul1/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://postimg.org/image/cjw9ioul1/&lt;/a&gt; \n   \n\n\nFile properties info using Media Player Classic:     \n   Video: MPEG2 Video 720x480 (4:3) 29.97fps 6000kbps\n   Audio: LPCM 48000Hz stereo 2304kbps [DVD, 24 bits]\n   Duration: 00:04:22\n\n\n\n\n*Install the &quot;Media Player Classic&quot; player if you can't play this file, \nor for better visual and audio quality playback of all your videos. \nIt's 100% free to download and use. Latest stable build is v1.7.9\n\n*Media Player Classic Home Cinema*         &lt;a href=&quot;\nhttp://mpc-hc.org/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://mpc-hc.org/&lt;/a&gt; \n\nSgtRlee (Sgt.R.Lee) \n\t\n*This is one of my first downloads when i got my first PC and got online soon after, downloaded through a site that allowed some free Usenet downloads at the time, and uploads of music videos. I have a few more from then i'm also posting today, they will also have this text","torrent":{"xt":"urn:btih:7fc53cdf7c916de3bd34773cd72982e4fca122b0","amp;dn":"Night+Ranger+-+Don%27t+Tell+Me+You+Love+Me+%5Bpromo%5D.VOB","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7fc53cdf7c916de3bd34773cd72982e4fca122b0","infoHashBuffer":{"type":"Buffer","data":[127,197,60,223,124,145,109,227,189,52,119,60,215,41,130,228,252,161,34,176]},"announce":[],"urlList":[]}}