{"title":"Julia Ann - Big Wet Asses 15 (2009) DVDRip-AVC ","uid":12183244,"size":727402766,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:8216422dc0d7d14e3c9564b89923aaf32038f73e&amp;dn=+Julia+Ann+-+Big+Wet+Asses+15+%282009%29+DVDRip-AVC+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Chinu685","files":1,"time":1438501620,"description":"Directed by: William H.\nStarring: Julia Ann, Manuel Ferrara\n\n\n\nDescription: Up next is a lady I've seen a few times and it's great to see her in a series like this. We open with Julia in a black bikini dancing for us, the suit standing out well with the all white backdrop. Also loved the air blowing through Julia's hair, always a sexy shot. Julia works those curves for all they're worth with William moving the shots in and out, all around this sexy woman. The water is sprayed upon her ass at one point, loved that, then Julia works those big titties out, more water is sprayed on and finally the oil is dropped all over that ass as Julia does a superb slow pull down of her bottoms. Manuel is the cock here and he gets right into it with Julia, kissing her lips and then saying hello to her boobs. Julia has eager hands too, slipping them inside his jeans trying to get out that big cock. Lots of groping here as Manuel is also able to reach around and diddle her ass. The bottoms are pulled off and like Michael in the first scene Manuel is so good with the pussy ass licking on his co stars, loved seeing that here. No early bj which I like to see but we instead get some fine open doggie where you see her tits hanging down and Manuel plowing away. Reverse vag was good too, moving to a 69, Julia leaning down to suck cock while above Manuel dines on pussy! Julia certainly makes up for the no early bj with some hot mid scene dick devouring, I think Manuel was close to popping a couple times the head was so good. Julia then opens up her backdoor, doing some A2M here too before Manuel lets loose with one of his better pops, several ropes fired at her face and open mouth, lots of cum for Julia to play with, nice going!\n\n\n\nReleased: 2009\nIssued: USA / Elegant Angel\nDuration: 00:39:33\nLanguage: English\nGenre: Gonzo, Anal, Big Tits, MILF, Oral, Blowjob\n\n\n &lt;a href=&quot;\nhttp://teenimage.org/img-55bdaf0334f7e.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://teenimage.org/img-55bdaf0334f7e.html&lt;/a&gt;\n &lt;a href=&quot;\nhttp://teenimage.org/img-55bdaf4b4e20e.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://teenimage.org/img-55bdaf4b4e20e.html&lt;/a&gt;","torrent":{"xt":"urn:btih:8216422dc0d7d14e3c9564b89923aaf32038f73e","amp;dn":"+Julia+Ann+-+Big+Wet+Asses+15+%282009%29+DVDRip-AVC+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8216422dc0d7d14e3c9564b89923aaf32038f73e","infoHashBuffer":{"type":"Buffer","data":[130,22,66,45,192,215,209,78,60,149,100,184,153,35,170,243,32,56,247,62]},"announce":[],"urlList":[]}}