{"title":"Kecksburg UFO Crash - The Untold Story (Documentary)","uid":11077791,"size":1096659356,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:822ab8fbc78b6c39c8100e4615de8f07ac73781b&amp;dn=Kecksburg+UFO+Crash+-+The+Untold+Story+%28Documentary%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Mooseleg8","files":-1,"time":1411356294,"description":"The Kecksburg UFO incident occurred on December 9, 1965, at Kecksburg, Pennsylvania, USA. A large, brilliant fireball was seen by thousands in at least six U.S. states and Ontario, Canada. It streaked over the Detroit, Michigan/Windsor, Ontario area, reportedly dropped hot metal debris over Michigan and northern Ohio,[1] starting some grass fires[2] and caused sonic booms in Western Pennsylvania.[3] It was generally assumed and reported by the press to be a meteor[4] after authorities discounted other proposed explanations such as a plane crash, errant missile test, or reentering satellite debris.[5]\n\nHowever, eyewitnesses in the small village of Kecksburg, about 30 miles southeast of Pittsburgh, claimed something crashed in the woods.[6] A boy said he saw the object land; his mother saw a wisp of blue smoke arising from the woods and alerted authorities. Another reported feeling a vibration and &quot;a thump&quot; about the time the object reportedly landed.[7] Others from Kecksburg, including local volunteer fire department members, reported finding an object in the shape of an acorn and about as large as a Volkswagen Beetle. Writing resembling Egyptian hieroglyphics was also said to be in a band around the base of the object. Witnesses further reported that intense military presence, most notably the United States Army, secured the area, ordered civilians out, and then removed an object on a flatbed truck[citation needed]. The military claimed they searched the woods and found &quot;absolutely nothing.&quot;","torrent":{"xt":"urn:btih:822ab8fbc78b6c39c8100e4615de8f07ac73781b","amp;dn":"Kecksburg+UFO+Crash+-+The+Untold+Story+%28Documentary%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"822ab8fbc78b6c39c8100e4615de8f07ac73781b","infoHashBuffer":{"type":"Buffer","data":[130,42,184,251,199,139,108,57,200,16,14,70,21,222,143,7,172,115,120,27]},"announce":[],"urlList":[]}}