{"title":"Dave Gahan - Depeche Mode and The Second Coming (PDF)","uid":12169275,"size":3575692,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:829df8de2a51ec3f9cbee4b06a41b399afc5ba97&amp;dn=Dave+Gahan+-+Depeche+Mode+and+The+Second+Coming+%28PDF%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Hand_of_Doom","files":2,"time":1438106321,"description":"The first and only biography of one of music's most influential and enigmatic characters. Dave Gahan's extraordinary life as the frontman of one of modern music's most successful bands is a tale unrivalled in rock and roll folklore. From a colourful childhood and youth in Essex, Gahan went on to become a huge star all over the world. For years each Depeche Mode album was more successful than the one before but in 1995 the increasing pressures on the band and within Gahan's personal life almost killed him. From this harrowing abyss, Gahan has bounced back and forged a new acclaimed career as a solo artist. Gahan's stunning rehabilitation as a songwriter and rejuvenated frontman means he deserves his own chapter in music history this unauthorised biography includes new and exclusive interviews with numerous people who ve worked with and around Gahan. Aside from recounting his turbulent private battles, this first ever book on Gahan examines his musical legacy and suggests he is arguably Britain's most under-rated and interesting rock vocalist. Recounted for the very first time, Gahan's tale away from his band-mates overshadows even the remarkable story of Depeche Mode the combination of his difficult yet triumphant story plus the thrilling music he has recorded, make this a story like no other in rock and roll history","torrent":{"xt":"urn:btih:829df8de2a51ec3f9cbee4b06a41b399afc5ba97","amp;dn":"Dave+Gahan+-+Depeche+Mode+and+The+Second+Coming+%28PDF%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"829df8de2a51ec3f9cbee4b06a41b399afc5ba97","infoHashBuffer":{"type":"Buffer","data":[130,157,248,222,42,81,236,63,156,190,228,176,106,65,179,153,175,197,186,151]},"announce":[],"urlList":[]}}