{"title":"NubileFilms: Dakota Skye, Samantha Hayes (After Party) [XXX] x2","uid":12185892,"size":222768020,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:82eb99c4f9d15db9c7221f143ab4314739c8cf18&amp;dn=+NubileFilms%3A+Dakota+Skye%2C+Samantha+Hayes+%28After+Party%29+%5BXXX%5D+x2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":4,"uploader":"Chinu685","files":1,"time":1438561628,"description":"ategory: All Sex, Big Areolas, Blonde, Blowjob, Brunette, Girl-Girl-Boy, Hardcore, High Heels, Lesbian, Long hair, Medium Boobs, Short hair, Small Boobs\n\n\nCast: Dakota Skye, Samantha Hayes\n\n\n.:Description:.\nIt's been a long night of partying and the sun is rising, but Dakota Skye, Samantha Hayes, and Van Wylde aren't ready to call it quits when they arrive home. The trio kicks off their after party by taking shots, but things get sexy when Samantha and Dakota accidentally reveal each other's boobs while playfully pushing each other.\nLocked in a heated kiss, the girls take that opportunity to head to the bedroom with Van following close behind them. When Samantha makes it clear that she wants both Dakota's and Van's hands all over her body, her two lovers are happy to comply.\nPulling aside Samantha's thong, Van samples her bald pussy with obvious pleasure. Dakota doesn't wait long before demanding her turn to enjoy Samantha's delicious juices, and soon the two of them are taking turns and sharing nicely.\nAlthough he doesn't mind taking turns with Dakota, Van doesn't hesitate to relocate so that he is close enough to Samantha's face that she can pull out his cock and suck him off while Dakota continues to enjoy her pussy feast.\nMoving once again, Van comes up behind Dakota where she's on her hands and knees with her face buried in her friend's snatch and takes advantage of her short miniskirt to shove the blonde's thong to the side and sink balls-deep into her tight twat. Dakota can't get enough of getting fucked from behind, and she translates that pleasure by setting out on a mission to bring ecstasy to Samantha no matter what!\nFlipping Dakota onto her back, Van asserts his dominance by keeping her pussy filled with his dick. Samantha adjusts her position so that she is seated on Dakota's face, making it easy for the blonde to continue eating out her tender twat.\nWhen Van has brought Dakota to a moaning completion, he pulls out and walks around to the other side of the bed. Samantha leans forward to put her mouth on Dakota's clit, sucking and licking and then groaning with enjoyment when Van fills her from behind. Dakota enjoys the perks of her new position where she has the pleasure of sucking Van's balls, wrapping her lips around his cock, and even fondling Samantha's clitoris with her tender tongue.\nNext it's Van's turn to lie down while the two girls have their way with him. Dakota is enjoying having her pussy licked, so she straddles Van's face while Samantha gives Van a boob-bouncing stiffie ride deep in her cock hungry fuck hole. Watching Samantha in the throes of ecstasy is so hot that Dakota decides to relax on the bed and pleasure herself while keeping her eyes glued to her lover. At the last moment, Samantha leans forward to latch on to Dakota's clit, bringing the blonde off while her own pussy is still humming with enjoyment.\nThe girls are finally satisfied, but they're still not quite finished. Dropping to their knees beside each other, Dakota and Samantha take turns using their hands and mouths to drive Van wild! He can't hold back from cumming all over both lovely coeds, leaving them smiling in satisfaction while Dakota licks Samantha clean from her love shower.\nTake a look at screenshots! Enjoy!\n\n\n &lt;a href=&quot;\nhttp://teenimage.org/img-55be99b0e4faa.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://teenimage.org/img-55be99b0e4faa.html&lt;/a&gt;\n &lt;a href=&quot;\nhttp://teenimage.org/img-55be99b9a23a6.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://teenimage.org/img-55be99b9a23a6.html&lt;/a&gt;","torrent":{"xt":"urn:btih:82eb99c4f9d15db9c7221f143ab4314739c8cf18","amp;dn":"+NubileFilms%3A+Dakota+Skye%2C+Samantha+Hayes+%28After+Party%29+%5BXXX%5D+x2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"82eb99c4f9d15db9c7221f143ab4314739c8cf18","infoHashBuffer":{"type":"Buffer","data":[130,235,153,196,249,209,93,185,199,34,31,20,58,180,49,71,57,200,207,24]},"announce":[],"urlList":[]}}