{"title":"HF- Full Release [gay]","uid":11096969,"size":1950160896,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:83683f674df55f7e587d0668d42039705a00f5fe&amp;dn=HF-+Full+Release+%5Bgay%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"mindcrasher","files":1,"time":1411609357,"description":"You know the feeling. The tingling in your cock is so intense, your entire body is vibrating and your balls are so loaded with cum they're gonna burst. The result is Hard Friction's Full Release, the kind where you see flashes of white light and think you've never shot so far before and that cum never tasted so sweet. For colorfully inked Ty Roderick and James Ryder, Ty's wickedly curved cock demands accommodations that make Full Release only more pleasurable. Smooth Mitch Vaughn and bearish Johnny Ryder rachet up the heat with a flip-fuck that perfectly complements their contrasting physical types. Keiran's endowment poses a supreme challenge that leads to a sublime Full Release for Jeremy Stevens. Jeremy's buns look great when you first see them, but they look awesome being breached by a monster cock. Tristan Mathews shows Shawn Wolfe the way to Full Release through an intense session of sucking, rimming and fucking. Directors Bruno Bond and Steve Cruz and their models had a live web audience to cheer them on during the filming and now the best of that is on a DVD guaranteed to bring you Full Release ... multiple times! ","torrent":{"xt":"urn:btih:83683f674df55f7e587d0668d42039705a00f5fe","amp;dn":"HF-+Full+Release+%5Bgay%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"83683f674df55f7e587d0668d42039705a00f5fe","infoHashBuffer":{"type":"Buffer","data":[131,104,63,103,77,245,95,126,88,125,6,104,212,32,57,112,90,0,245,254]},"announce":[],"urlList":[]}}