{"title":"EnigmaT Set Rips { Cuts } - September 24th, 2014","uid":11098315,"size":1327101777,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:83d7afadf758a4bd87825f3a5ffff43b605c1cb8&amp;dn=EnigmaT+Set+Rips+%7B+Cuts+%7D+-+September+24th%2C+2014&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"EnigmaT","files":148,"time":1411626206,"description":"Acues - Blue Fire (Original Mix) (Cut From Acues Set)-enTc\nAcues - Vendetta (Original Mix) (Cut From Acues Set)-enTc\nAfternova - By Your Side (2014 Remake) (Cut From Uplift Set)-enTc\nAirborn - Hymn of Heavens (Cut From Abstract Set)-enTc\nAirborn - People Have Wing (Cut From Abstract Set)-enTc\nAlex Schevchenko - Relief (Ula Remix) (Cut From Amitacek Set)-enTc\nAlex Tunka - Endless Journey (Original Mix) (Cut From Ost&amp;Meyer Set)-enTc\nAlex Wackii - Ode To Felix (Ikerya Project Remix) (Cut From Uplift Set)-enTc\nAlexander Borisov - It Is A New Day (Original Mix) (Cut From Tempo Set)-enTc\nAlexander Zhakulin &amp; Aquasound - Theia (Steven Brooks Remix) (Cut From Abstract Set)-enTc\nAlikast - 7th (Cut From Pit Set)-enTc\nAlikast - Mepho (Cut From Pit Set)-enTc\nAllen Watts - Fallen (Force Multipliers Remix) (Cut From Lazarus Set)-enTc\nAndrew StetS feat. Soncesvit - Gutsul (Robert Vadney Dub Mix) (Cut From andY Set)-enTc\nAnother World - Holding The Sun (O.B.M Notion Remix) (Cut From Uplift Set)-enTc\nArkatec Feat. Tonov &amp; Dim K - Insomniate (Cut From Russell G Set)-enTc\nArkatec vs Tonov &amp; DimK - Insomniate (Cut From Bjorn Set)-enTc\nArmin Van Buuren - Who's Afraid Of 138 (Insid3r Remix) (Cut From Uplift Set)-enTc\nBarakooda - Desert Trip (M3R-T Uplifting Mix) (Cut From Vale Set)-enTc\nBenjani - Extremadura (Cut From Bolier Set)-enTc\nBissen - Quantum (Future Disciple Remix II) (Cut From Solarstone Set)-enTc\nBreekler vs Jorge Luis - Souls And Spirits (Original Mix) (Cut From Cold Set)-enTc\nC-Systems &amp; Marcel Kenenberg - Ultraviolet (Cut From C-Systems Set)-enTc\nCalvin Harris feat. John Newman - Blame (Tom &amp; Jame Remix) (Cut From Inside Set)-enTc\nCalvin Harris feat. John Newman - Blame (Tom &amp; Jame Remix) (Cut From W&amp;W Set)-enTc\nCarlin And Fil - Express (Original Mix) (Cut From Ost&amp;Meyer Set)-enTc\nChristian Stalker - The Dreamer (Original Mix) (Cut From Gibson Set)-enTc\nClean Bandit feat Sharna Bass - Extraordinairy (Still Young Remix) (Cut From Divini Set)-enTc\nCold Rush - Distraction (Cut From A&amp;F Set)-enTc\nColdplay - Atlas (Nitrous Oxide Bootleg) (Cut From Oxide Set)-enTc\nCramp - Invisible (Fon.Leman Remix) (Cut From Ost&amp;Meyer Set)-enTc\nCramp Feat. Lauren Moore - Invisible (Rise &amp; Fall Remix) (Cut From Saint-Jules Set)-enTc\nDaniel Sea - Voices (Original Mix) (Cut From GO Set)-enTc\nDannic &amp; TV Noise - Solid (Cut From W&amp;W Set)-enTc\nDanny Howard &amp; Futuristic Polar Bears - Romani (Cut From Bobina Set)-enTc\nDigital Affection - Ethereal Echoes (Original Mix) (Cut From Tempo Set)-enTc\nDirkie Coetzee &amp; Misja Helsloot - We Are Trance (Niels Alexander Remix) (Cut From Dirkie Set)-enTc\nDJ Impossible - Illogical (Original Mix) (Cut From Cold Set)-enTc\nEddie Biz - The Race (Original Mix) (Cut From Ost&amp;Meyer Set)-enTc\nEDX - Cool You Off (Matierro Remix) (Cut From Inside Set)-enTc\nEhsun - Valles Marineris (Serge Macoveu Remix) (Cut From Uplift Set)-enTc\nEnigma - Pandora (Cut From Vale Set)-enTc\nEnigma - Titan (Cut From Vale Set)-enTc\nFaruk Besghaier Pres. Blue5even - Eternity (Original Mix) (Cut From Cold Set)-enTc\nFarzam - Narnia (Danila Kraev Remix) (Cut From Uplift Set)-enTc\nFelguk - Monsta Skunk (Cut From Bolier Set)-enTc\nFurkan Senol - Parthenope (Paul Gibson Remix) (Cut From Gibson Set)-enTc\nGlynn Alan - The Edge (Eugene Karnak Remix) (Cut From Vale Set)-enTc\nGrizli Man - Fancy Flight (Original Mix) (Cut From Cold Set)-enTc\nI Am One - Your Love (Cut From Pit Set)-enTc\nIgor Stroom - Yushanly (Craig London Remix) (Cut From London Set)-enTc\nInfinity &amp; Ezietto - Distant Moon (4 Seas Emotional Remix) (Cut From Uplift Set)-enTc\nIsopolins - Ispolins (Cut From Page Set)-enTc\nJackob Roenald - Illusion (Original Mix) (Cut From GO Set)-enTc\nJames Attera - From Elements to Everything (Morttagua Bootleg) (Cut From Ost&amp;Meyer Set)-enTc\nJames McGuire - Scarlett Fever (Cut From Vale Set)-enTc\nJPaxx &amp; SAG - Juggernaut (Original Mix) (Cut From Inside Set)-enTc\nJulian Jeiwel - Air Conditionne (Harrys &amp; Fly Rework 2014) (-SHORT- Cut From Page Set)-enTc\nJustin Strikes - Razorsharp (Cut From Ferry Set)-enTc\nKaimo K &amp; Termo Tammel - Sublime (Cut From Lazarus Set)-enTc\nKarin Park - Shine (Sax Vs Robo Remix) (Cut From Pit Set)-enTc\nKelly Andrew - Wonderland (Orchestral Trance Mix) (Cut From Uplift Set)-enTc\nKenneth Thomas feat. Colleen Riley - Ghost In The Machine 2014 (LTN Dub) (Cut From Photographer Set)-enTc\nLazy Rich &amp; Hot Mouth - BONK (Cut From W&amp;W Set)-enTc\nLian July - Azure (Michael Berklin Remix) (Cut From London Set)-enTc\nLuigi Lusini &amp; Starchaser Feat. Molly Bancroft - All I Want (Ultimate Remix) (Cut From A&amp;F Set)-enTc\nLunde Bros - Just Move Along (Cut From Bolier Set)-enTc\nLush &amp; Simon, Uforik - Hydrogen (Cut From Bobina Set)-enTc\nLush &amp; Simon, Uforix - Hydrogen (Cut From Tritonal Set)-enTc\nMalaky - No Time (Cut From Solarstone Set)-enTc\nManida - When I See You (Cut From Uplift Set)-enTc\nMarcprest - Losing Memory (Ula Remix) (Cut From Uplift Set)-enTc\nMariano Santos - The Memory Of House (Original Mix) (Cut From Tempo Set)-enTc\nMartin Garrix &amp; MOTi - Virus (How About Now) (Cut From Bobina Set)-enTc\nMassive Vibes - Blockbuster (Cut From Divini Set)-enTc\nMatt Cerf and Ost &amp; Meyer feat. Fenja - Like We Love (Cut From Ost&amp;Meyer Set)-enTc\nMax Freegrant &amp; Steve Haines - Eclipse (Cut From Russell G Set)-enTc\nMaywave - Flowing Passion (UDM Remix) (Cut From A&amp;F Set)-enTc\nMenno De Jong feat. Aneym - Your Heaven (Cut From A&amp;F Set)-enTc\nMenno de Jong feat. Aneym - Your Heaven (Original Mix) (Cut From Solarstone Set)-enTc\nMervo - Rev (Cut From Divini Set)-enTc\nMichael Jackson - Billie Jean (Leon Bolier Remix) (Cut From Bolier Set)-enTc\nMino Safy - Corrupted Data (Cut From Abstract Set)-enTc\nMisja Helsloot feat. Shannon Hurley - Voice In The Crowd (Truenorth pres. Force Multipliers Remix) (Set Rip)-enTc\nMitchell Claxton - Dive (Icedream Remix) (Cut From Lazarus Set)-enTc\nMoodies &amp; Anni Massaceur - United States of Rave (Cut From Pit Set)-enTc\nN&amp;R Project - Turn Up The Base (Original Mix) (Cut From Ost&amp;Meyer Set)-enTc\nNick Stoynoff - You're OK (Konektiv Remix) (Cut From Solarstone Set)-enTc\nNicole Scherzinger - On the Rocks (Veselin Tasev Remix) (Cut From Tasev Set)-enTc\nNikcyp - Impulse (Cut From Divini Set)-enTc\nNikolauss - Skyline (Alex Shevchenko Remix) (Cut From Uplift Set)-enTc\nOdonbat - Robot May Cry (Cut From Amitacek Set)-enTc\nOdonbat - Robot May Cry (Robbie Seed Remix) (Cut From Romel Set)-enTc\nOne Republic - I Lived (Arty Remix) (Cut From W&amp;W Set)-enTc\nOnova - Platitude (Allen Watts Remix) (Cut From A&amp;F Set)-enTc\nOnova - Platitude (Allen Watts Remix) (Cut From Solarstone Set)-enTc\nPaul Oakenfold &amp; Cassandra Fox - Touch Me (Beat Service Remix) (Cut From W&amp;W Set)-enTc\nPaul Oakenfold feat. Cassandra Fox - Touch Me (Stateside Remix) (Cut From Tritonal Set)-enTc\nPaul Rigel &amp; O.B.M Notion - Reminiscence (Original Mix) (Cut From Romel Set)-enTc\nPhilips &amp; Meijer - The Kade (Stephane Badey Remix) (Cut From Dirkie Set)-enTc\nPhillipo Blake - War For The World (Cut From Pit Set)-enTc\nPlayme - For Love (Energized Edit) (Cut From Uplift Set)-enTc\nPorter Robinson - Fellow Feeling (Joorn Bold Remix) (Cut From Tritonal Set)-enTc\nProject 46 featt. Kick Drum - Turn Up The Bass (Original Mix) (Cut From Inside Set)-enTc\nPsymes feat. Spins - Tethys 2014 (Original Remix) (Cut From Cold Set)-enTc\nPuma Scorz feat. Ai Takekawa - Too Late (Denis Sender Remix) (Cut From GO Set)-enTc\nPush - The Legacy (Craig London Bootleg Remix) (Cut From London Set)-enTc\nRambacy feat. Danny Claire - New Life (Fady &amp; Mina Less-Hard Dub) (Cut From Uplift Set)-enTc\nRambacy featuring Danny Clare - New Life (Fady &amp; Mina Dub) (Cut From Lazarus Set)-enTc\nRaphael Mayers - Mysterious Coast (Witness45 Remix) (Cut From Tero A Set)-enTc\nRavenKis - Teardrops (Cut From Bolier Set)-enTc\nRavenkiss - Teardrops (Cut From W&amp;W Set)-enTc\nRoman Babanov - I Try (Sean Mathews Club Mix) (Cut From Six Senses Set)-enTc\nRon van den Beuken Sunset (Dark Architects Rebuild) (Cut From London Set)-enTc\nSafri Duo - Played-A-Live (Bobina Remix) (Cut From Bobina Set)-enTc\nSaint Sinners - Rampage (Dima Krasnik Remix) (Cut From A&amp;F Set)-enTc\nSam Luxton - Endorfin (Original Mix) (Cut From C-Systems Set)-enTc\nSander Van Doorn &amp; Oliver Heldens - This (Cut From Ferry Set)-enTc\nSava - The Journey (Dreamy Remix) (Cut From Uplift Set)-enTc\nSavon - Blue Water (Para X Remix) (Cut From A&amp;F Set)-enTc\nScooter - Move Your Ass (Stefan Dabruck Remix) (Cut From Claessen Set)-enTc\nSilica - Aurora (Cut From Lazarus Set)-enTc\nSimon Moon &amp; Quasi - Thunderous (Marcel Kenenberg Remix) (Cut From Amitacek Set)-enTc\nSimza &amp; Stoneless - Black Sea (Cut From Abstract Set)-enTc\nSky Sound - Stairway To Heaven (Amitacek Remix) (Cut From Amitacek Set)-enTc\nSkyvol - Biotonica (Cut From Uplift Set)-enTc\nSpooner Street - Anthropomorphic (Cut From Pit Set)-enTc\nSquarz Kamel - Key Of Happines (Miroslav Vrlik Emotional Remix) (Cut From Amitacek Set)-enTc\nSquarz Kamel - Key Of Happiness (Original Mix) (Cut From andY Set)-enTc\nStella Project - Here For Tomorrow (John Sunlight Remix) (Cut From A&amp;F Set)-enTc\nStella Project - Perfect Day (John Sunlight Remix) (Cut From Cold Set)-enTc\nStephane Signore - I Hate The World (Reaky Remix) (Cut From Tempo Set)-enTc\nSteve Morley - Forever In My Heart (Pablo Anon Remix) (Cut From Photographer Set)-enTc\nSubsky - Strawberry Fields (Namatjira Remix) (Cut From Solarstone Set)-enTc\nSunset Heat vs Joe Cormack - Nobody But Her (UDM Remix) (Cut From Cold Set)-enTc\nSylvane Feat. Sweet Melissa - Light Me Up (Jus Jack &amp; Oza Remix) (Cut From Ost&amp;Meyer Set)-enTc\nSyn Cole - Bright Lights (Steerner Remix) (Cut From Page Set)-enTc\nTempo Giusto - Cartel (Original Mix) (Cut From Tempo Set)-enTc\nTempo Giusto - ID -Sept 2014- (Cut From Tempo Set)-enTc\nTempo Giusto - The Name Game (Original Mix) (Cut From Tempo Set)-enTc\nTiesto feat. DBX - Light Years Away (Tiesto &amp; MOTi Remix) (Cut From Inside Set)-enTc\nTiesto vs Firebeatz feat Ladyhamkw - Last Train (Cut From Divini Set)-enTc\nTuneflux - Reach (Cut From Vale Set)-enTc\nTuneflux - Redemption (Cut From Vale Set)-enTc\nUCast - Tanity (Cut From Abstract Set)-enTc\nUnderground Connection - I Can't Believe (Dan Dobson Remix) (Cut From GO Set)-enTc\nVincenzo feat. Minako - Just Like Heaven (Original Mix) (Cut From Ost&amp;Meyer Set)-enTc\nZhu - Faded (C-Systems Remix) (Cut From C-Systems Set)-enTc\n","torrent":{"xt":"urn:btih:83d7afadf758a4bd87825f3a5ffff43b605c1cb8","amp;dn":"EnigmaT+Set+Rips+%7B+Cuts+%7D+-+September+24th%2C+2014","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"83d7afadf758a4bd87825f3a5ffff43b605c1cb8","infoHashBuffer":{"type":"Buffer","data":[131,215,175,173,247,88,164,189,135,130,95,58,95,255,244,59,96,92,28,184]},"announce":[],"urlList":[]}}