{"title":"Efficiency of Manufacturing Processes","uid":12272651,"size":9655086,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8454370bfe4b38cdbc0e28043b96e6dc4b541bbf&amp;dn=Efficiency+of+Manufacturing+Processes&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"mdusanjay","files":1,"time":1440308275,"description":"Efficiency of Manufacturing Processes: Energy and Ecological Perspectives (Sustainable Production, Life Cycle Engineering and Management) by Wen Li\n\nEnglish | 2015 | ISBN: 3319173642 | 179 pages | PDF | 9,2 MB\n\nThis monograph presents a reliable methodology for characterising the energy and eco-efficiency of unit manufacturing processes. The Specific Energy Consumption, SEC, will be identified as the key indicator for the energy efficiency of unit processes. An empirical approach will be validated on different machine tools and manufacturing processes to depict the relationship between process parameters and energy consumptions. Statistical results and additional validation runs will corroborate the high level of accuracy in predicting the energy consumption. In relation to the eco-efficiency, the value and the associated environmental impacts of manufacturing processes will also be discussed. The interrelationship between process parameters, process value and the associated environmental impact will be integrated in the evaluation of eco-efficiency. The book concludes with a further investigation of the results in order to develop strategies for further efficiency improvement. The target audience primarily comprises researchers and experts in the field, but the book may also be beneficial for graduate students","torrent":{"xt":"urn:btih:8454370bfe4b38cdbc0e28043b96e6dc4b541bbf","amp;dn":"Efficiency+of+Manufacturing+Processes","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8454370bfe4b38cdbc0e28043b96e6dc4b541bbf","infoHashBuffer":{"type":"Buffer","data":[132,84,55,11,254,75,56,205,188,14,40,4,59,150,230,220,75,84,27,191]},"announce":[],"urlList":[]}}