{"title":"Hell Spirit - Dawn Under Curse mp3  (2014)","uid":11120692,"size":90193378,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:84686a9cc68c9720e4c01834cc4a65ca680f49a5&amp;dn=Hell+Spirit+-+Dawn+Under+Curse+mp3++%282014%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"analogkid6103","files":7,"time":1411910683,"description":"\n1. Call to Arms 03:41\n2. Weak Flesh / Filthy Blood 07:09\n3. Total Holocaust 05:21\n4. Unholy Redemption 06:46\n5. Eternal Night 11:05\n6. Blood and Metal 03:29\nTotal playing time: 37:31\n\n\nHellspirit was formed in 2004 at Kuopio, Finland by Dethrone and Goat. The bad released two demos during the years 2005-2006 and recorded a split release with Australian black thrashers Nocturnal Graves in 2007 but it was released not until 2010 by Nuclear War Now! Productions, due to numerous difficulties on the way.\n\nBand's line-up altered very drastically during the first years of Hellspirit's existence. A stabile line-up was established in 2011 when Dethrone, Heinrich Von Heretic, who had joined to the ranks of bassist already in 2008, teamed up with Eld in drums and MSA in guitars. The band started working debut full-length album now with whole new intensity together with raging live shows where they shared a stage with such bands as Anal Cunt, Nifelheim and Sabbat.\n\nMusical style of Hellspirit had changed during the years from very straightforward thrash oriented black metal towards more epic and warlike black metal where influences of thrash and heavy has taken a step into a whole another level.\n\nFinally in 2012, Hellspirit started recording their debut full-length album which led to a deal with a Finnish underground record label No Sign Of Life which eventually ceased all activities before the debut was released. The band was then again, perhaps one of the most prominent one in Finland underground scene at the time, an unsigned artist.\n\nAt the threshold of the band's 10 year anniversary in 2014 Hellspirit signed to Saturnal Records and finally the band's long-anticipated debut album titled &quot;Dawn Under Curse&quot; will see a daylight in 2014.\n\nHellspirit delivers raw and epic black metal with solid roots in thrash and heavy metal. Musical style of the band has been evolving through the band's 10 year existence, from the point where one can find resemblances with classic Finnish and Australian black thrash acts all the way, to more epic soundscapes influenced by the classic names like Bathory and Morrigan.\n","torrent":{"xt":"urn:btih:84686a9cc68c9720e4c01834cc4a65ca680f49a5","amp;dn":"Hell+Spirit+-+Dawn+Under+Curse+mp3++%282014%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"84686a9cc68c9720e4c01834cc4a65ca680f49a5","infoHashBuffer":{"type":"Buffer","data":[132,104,106,156,198,140,151,32,228,192,24,52,204,74,101,202,104,15,73,165]},"announce":[],"urlList":[]}}