{"title":"One Hundred Years of Chemical Engineering","uid":12121042,"size":20237692,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:84722d2ede7ec56db70b0e4c3670541fae54828e&amp;dn=One+Hundred+Years+of+Chemical+Engineering&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"clouderone","files":1,"time":1436822885,"description":"One Hundred Years of Chemical Engineering (Kluwer, 1989).pdf\n\nISBN 9789401075367\n\nOne hundred years ago, in September 1888, Professor Lewis Mills Norton (1855-1893) of the Chemistry Department of the Massachusetts Institute of Technology introduced to the curriculum a course on industrial chemical practice. This was the first structured course in chemical engineerÂ­ ing taught in a University. Ten years later, Norton's successor Frank H. Thorpe published the first textbook in chemical engineering, entitled &quot;Outlines of Industrial Chemistry.&quot; Over the years, chemical engineering developed from a simple industrial chemical analysis of processes into a mature field. The volume presented here includes most of the commissioned and contributed papers presented at the American Chemical Society Symposium celebrating the centenary of chemical engineering. The contributions are presented in a logical way, starting first with the history of chemical engineering, followed by analyses of various fields of chemical engineering and concluding with the history of various U.S. and European Departments of Chemical Engineering. I wish to thank the authors of the contributions/chapters of this volume for their enthusiastic response to my idea of publishing this volume and Dr. Gianni Astarita of the University of Naples, Italy, for his encouragement during the initial stages of this project","torrent":{"xt":"urn:btih:84722d2ede7ec56db70b0e4c3670541fae54828e","amp;dn":"One+Hundred+Years+of+Chemical+Engineering","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"84722d2ede7ec56db70b0e4c3670541fae54828e","infoHashBuffer":{"type":"Buffer","data":[132,114,45,46,222,126,197,109,183,11,14,76,54,112,84,31,174,84,130,142]},"announce":[],"urlList":[]}}