{"title":"Railworks TS2015 Armstrong PowerHouse Class 40 Locomotive Pack","uid":12204231,"size":471796278,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:8522117f2297edb5144ea388d1d80b4305703f12&amp;dn=Railworks+TS2015+Armstrong+PowerHouse+Class+40+Locomotive+Pack&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"TS2015","files":1,"time":1438890764,"description":"In assocation with RailRight, Armstrong Powerhouse presents the Class 40 Locomotive Pack. This product is the culmination of two and a half years of hard work and research, resulting in what must be the most comprehensive and high quality package seen in Train Simulator to date. From lamp brackets to pipework, each of the 200 class 40 locomotives have been lovingly recreated to take you back to when they reigned surpreme throughout the '60s, '70s and '80s. On top of that, a special sound recording session was organised with 40145 at the East Lancashire Railway to provide brand new high quality sounds. Please see below for a list of the main features included:\n\n2 liveries - BR blue &amp; BR Green (both external and in the cab)\n\n3 variants - Discs, centre headcode box &amp; split headcode box\n\nAll 200 examples represented with their numerous visual differences for both BR blue and BR green liveries\n\nVacuum and dual-braked variants for BR blue livery with corresponding cabs\n\n25 individually modelled nameplates (BR green D210-D235 except D226)\n\nDetailed internal &amp; external audio\n\nAccurate performance physics\n\nDynamic exhaust smoke\n\nOptions screen (controls traction motors, boiler and brake mode selector)\n\nFunctional brake modes (air/vacuum/passenger/goods)\n\nLocomotive faults (traction motor failure and high engine temperature)\n\nSteam heat boiler\n\nCold start option\n\nPlayer changeable headcode blinds\n\nOpening cab doors and windows\n\n'Quick Drive' consists\n\nFREE Mk1 Coach Pack included\n\nAnd much, much more!\n\nPlease note, if you would like to save a scenario when using this locomotive and return to it at a later time, you will need to carry out a certain procedure which is detailed in the manual. This is due to the very complex scripting that has been implemented in this pack.\n\nAs well as the locomotive, eight highly authentic &amp; engaging scenarios are included for the Just Trains - Scottish ECML and Settle to Carlisle routes. Each being based on the relevant timetable of the year for the ultimate realism. On top of this, all trains have their headcode, time of leaving, origin and destination so you can see which train is which!\n\nITS THE LATEST VERSION UPDATED BY ARMSTRONG POWERHOUSE\n\nTHIS WORKS ON LEGIT AND PIRATED VERSION OF TRAIN SIMULATOR 2015","torrent":{"xt":"urn:btih:8522117f2297edb5144ea388d1d80b4305703f12","amp;dn":"Railworks+TS2015+Armstrong+PowerHouse+Class+40+Locomotive+Pack","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8522117f2297edb5144ea388d1d80b4305703f12","infoHashBuffer":{"type":"Buffer","data":[133,34,17,127,34,151,237,181,20,78,163,136,209,216,11,67,5,112,63,18]},"announce":[],"urlList":[]}}