{"title":"Lawrence James - Warrior Race EPUB","uid":12132586,"size":1008439,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:86231a5b0326646069701234666b16cbf3141a86&amp;dn=Lawrence+James+-+Warrior+Race+EPUB&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":1,"time":1437079328,"description":"ISBN: 9781429975827\n\nModern Britain is a nation shaped by wars. The boundaries of its separate parts are the outcome of conquest and resistance. The essence of its identity are the warrior heroes, both real and imagined, who still capture the national imagination: from Boadicea to King Arthur, Rob Roy to Henry V, the Duke of Wellington to Winston Churchill. It is a sense of identity that grew under careful cultivation during the global struggles of the eighteenth century, and found its most powerful expression during the world wars of the twentieth. In, Lawrence James investigates the role played by war in the making of Britain. Drawing on the latest historical and archaeological research, as well as numerous unfamiliar and untapped resources, he charts the full reach of British military history: the physical and psychological impact of Roman military occupation; the monarchy's struggle for mastery of the British Isles; the civil wars of the seventeenth century; the &quot;total war&quot; experience of twentieth-Â­century conflict. But is more than just a compelling historical narrative. Lawrence James skillfully pulls together the momentous themes of his subject. He discusses how war has continually been a catalyst for social and political change, the rise, survival, and reinvention of chivalry, the literary quest for a British epic, the concept of birth and breeding as the qualifications for command in war, and the issues of patriotism and Britain's antiwar tradition. Warrior Race is popular history at its very best: incisive, informative, and accessible; immaculately researched and hugely readable. Balancing the broad sweep of history with an acute attention to detail, Lawrence James never loses sight of this most fascinating and enduring of subjects: the question of British national identity and character","torrent":{"xt":"urn:btih:86231a5b0326646069701234666b16cbf3141a86","amp;dn":"Lawrence+James+-+Warrior+Race+EPUB","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"86231a5b0326646069701234666b16cbf3141a86","infoHashBuffer":{"type":"Buffer","data":[134,35,26,91,3,38,100,96,105,112,18,52,102,107,22,203,243,20,26,134]},"announce":[],"urlList":[]}}