{"title":"Modeling and Simulation of Heterogeneous Catalytic Reactions","uid":12211926,"size":6921410,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:862ee2d1bc3f7bd35ebf3fa250e89f3b82b096aa&amp;dn=Modeling+and+Simulation+of+Heterogeneous+Catalytic+Reactions&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"clouderone","files":1,"time":1439113830,"description":"Modeling and Simulation of Heterogeneous Catalytic Reactions (Wiley-VCH, 2012).pdf\n\nISBN 978-3-527-32120-9\n\nThe Nobel Prize in Chemistry 2007 awarded to Gerhard Ertl for his groundbreaking studies in surface chemistry highlighted the importance of heterogeneous catalysis not only for modern chemical industry but also for environmental protection. Heterogeneous catalysis is seen as one of the key technologies which could solve the challenges associated with the increasing diversification of raw materials and energy sources. It is the decisive step in most chemical industry processes, a major method of reducing pollutant emissions from mobile sources and is present in fuel cells to produce electricity. The increasing power of computers over the last decades has led to modeling and numerical simulation becoming valuable tools in heterogeneous catalysis. This book covers many aspects, from the state-of-the-art in modeling and simulations of heterogeneous catalytic reactions on a molecular level to heterogeneous catalytic reactions from an engineering perspective. This first book on the topic conveys expert knowledge from surface science to both chemists and engineers interested in heterogeneous catalysis. The well-known and international authors comprehensively present many aspects of the wide bridge between surface science and catalytic technologies, including DFT calculations, reaction dynamics on surfaces, Monte Carlo simulations, heterogeneous reaction rates, reactions in porous media, electro catalytic reactions, technical reactors, and perspectives of chemical and automobile industry on modeling heterogeneous catalysis. The result is a one-stop reference for theoretical and physical chemists, catalysis researchers, materials scientists, chemical engineers, and chemists in industry who would like to broaden their horizon and get a substantial overview on the different aspects of modeling and simulation of heterogeneous catalytic reactions","torrent":{"xt":"urn:btih:862ee2d1bc3f7bd35ebf3fa250e89f3b82b096aa","amp;dn":"Modeling+and+Simulation+of+Heterogeneous+Catalytic+Reactions","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"862ee2d1bc3f7bd35ebf3fa250e89f3b82b096aa","infoHashBuffer":{"type":"Buffer","data":[134,46,226,209,188,63,123,211,94,191,63,162,80,232,159,59,130,176,150,170]},"announce":[],"urlList":[]}}