{"title":"Nom.Nom.Galaxy-ALI213","uid":12191921,"size":565994646,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:864a9aa753a0bc28cfee4ff2a3a55ab39aa6257f&amp;dn=Nom.Nom.Galaxy-ALI213&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"mercs215","files":2,"time":1438673659,"description":"Install instructions:\n1. Extract\n2. Play\n\nWelcome to Soup Co., Astroworker! As an integral part of the Soup Co. family, your mission is to explore the remote planets in search of tasty ingredients to make the galaxies most delicious soups and then rocket them into the gullets of our hungry customers. But this isn't your typical soup kitchen - Astroworkers must battle against the planet's elements, alien plants and animals, and dastardly rival soup corporations! Build your base of operations with the help of your fellow Astroworkers and handy Soup Co. robots, make the galaxies most mouth-watering soups, then defend yourself from local wildlife and our rivals. \n\n#nomnomGALAXY is a sandbox-styled mix of platforming, base building, tower defense, and good old fashioned monster-stomping! You'll create huge factory-bases where you'll experiment with tons of ingredients, make hundreds of types of soups to feed the galaxy, and rise in the ranks of the Soup Co.! Each planet will have its own challenges, from poisons gas to killer tomatoes. Only the most adept of Soup Meisters will succeed!\nKey Features\nHundreds of different types of soups to discover \nExtensive soup recipe system that uses ingredients all of the planet's plants and animals \nTower Defense gameplay from the makers of one of the most acclaimed Tower Defense games on any platform, PixelJunk Monsters \nLiving planets that evolve as your base expands \nTons of robot helpers to automate factories, defend your base, and collect ingredients \nBattle rival soup corporations throughout the galaxy for soup supremacy! \nLocal split-screen co-op and up to 4 players online\n\nSystem Requirements\nMINIMUM: \nOS: Windows 7 \nProcessor: Intel Core 2 Quad or higher \nMemory: 4 GB RAM \nGraphics: NVIDIA 9800 GT \nDirectX: Version 10 \nHard Drive: 650 MB available space \nAdditional Notes: Laptops without dedicated GPU may have difficulty playing Nom Nom Galaxy. \n\nRECOMMENDED: \nOS: Windows 7 \nProcessor: Intel Core i7 \nMemory: 6 GB RAM \nGraphics: GeForce GTX 570 \nDirectX: Version 10","torrent":{"xt":"urn:btih:864a9aa753a0bc28cfee4ff2a3a55ab39aa6257f","amp;dn":"Nom.Nom.Galaxy-ALI213","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"864a9aa753a0bc28cfee4ff2a3a55ab39aa6257f","infoHashBuffer":{"type":"Buffer","data":[134,74,154,167,83,160,188,40,207,238,79,242,163,165,90,179,154,166,37,127]},"announce":[],"urlList":[]}}