{"title":"EnigmaT Set Rips { Cuts } - September 27th, 2014","uid":11111681,"size":751104496,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:8711e4807c6ef9702ffeae1233fca00f114f9cd6&amp;dn=EnigmaT+Set+Rips+%7B+Cuts+%7D+-+September+27th%2C+2014&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"EnigmaT","files":79,"time":1411805418,"description":"Alex Metric Feat. Stefan Storm - Heart Weighs a Ton (Cassian Remix) (Cut From Tydi Set)-enTc\nAllen &amp; Envy &amp; Elles de Graaf - The Long Run (Allen Watts Remix) (ASOT 682 Rip)-enTc\nAlvaro &amp; GlowInTheDark - Charged (Kiholm Remix) (Set Rip)-enTc\nAly &amp; Fila - Altitude Compensation (ASOT 682 Rip)-enTc\nAndrew Henry - Iris (Duncan MacPherson Remix) (Cut From Feel Set)-enTc\nAndy Duguid &amp; Jaren - Battlecry (Cut From Lange Set)-enTc\nAnother World - Holding The Sun (Emme Remix) (Cut From Feel Set)-enTc\nAntony Waldhorn - Pirate Bay (ASOT 682 Rip)-enTc\nArmin van Buuren - Hystereo (Thomas Vink Remix) (ASOT 682 Rip)-enTc\nBehind The Sunset - Actus Secundus (Arisen Flame Remix) (ASOT 682 Rip)-enTc\nBetsie Larkin &amp; Andy Moor - Not Afraid (ASOT 682 Rip)-enTc\nBobina - Winter (ASOT 682 Rip)-enTc\nBreame - Reject (Soundprank Remix) (ABGT 098 Rip)-enTc\nChicane &amp; Ferry Corsten - 38 Weeks (ABGT 098 Rip)-enTc\nChicane - Fibreglasses (ABGT 098 Rip)-enTc\nChicane feat. Bo Bruce - Still With Me (Original Mix) (ABGT 098 Rip)-enTc\nColdplay - Midnight (Pete K Bootleg Remix) (Cut From Ross Set)-enTc\nCramp feat. Lauren Moore - Invisible (Rise &amp; Fall Remix) (Cut From Barone Set)-enTc\nD-Unity - Tic Toc (Richie Santana Remix) (Cut From Camz Set)-enTc\nDaniel Kandi Pres. Timmus - Symphonica (Angel Ace 2014 Rework Intro Mix) (Set Rip)-enTc\nDart Rayne &amp; Yura Moonlight - Razor (ASOT 682 Rip)-enTc\nDavid Mayne - Inferno (Original Mix) (Cut From Feel Set)-enTc\nDenis Kenzo &amp; Jilliana Danise - Will Be Forever (ASOT 682 Rip)-enTc\nDenis Kenzo feat. Jilliana Danise - Will Be Forever (Original Mix) (Cut From Feel Set)-enTc\nDerek Palmer - Entering Babylon (Original Mix) (Cut From Niki Set)-enTc\nDrumcomplex &amp; Roel Salemink - Charge Me Again (Cut From Camz Set)-enTc\nDurtysoxXx - One Nation (Alberto Ruiz Remix) (Cut From Camz Set)-enTc\nEmdi &amp; Coorby Hope (Original Mix) (Cut From Feel Set)-enTc\nEstiva &amp; The Spacies - Voices (Original Mix) (Cut From Feel Set)-enTc\nFabio XB featuring Adina Butar - Stay (Anske Remix) (GDJB Rip)-enTc\nFrank Dattilo - Angel's City (Original Mix) (Cut From Cosmic Heaven Set)-enTc\nGai Barone - ID -Sept 2014- (Cut From Barone Set)-enTc\nGeorge Boston - Starlight (Libra Remix) (Cut From Cosmic Heaven Set)-enTc\nGrisha - Surge Waves (Cut From Barone Set)-enTc\nHazem Beltagui &amp; Aneym - Remember Me (Club Mix) (Cut From LEON Set)-enTc\nilan Bluestone - Snapdragon (ABGT 098 Rip)-enTc\nJaytech - Arrival (ABGT 098 Rip)-enTc\nJebu - Tension (ABGT 098 Rip)-enTc\nJohn Cosani - Nice (Gvozdini Remix) (Cut From Barone Set)-enTc\nJoonas Hahmo - The Launch (ABGT 098 Rip)-enTc\nJordan Suckley - Contaminated (Adam Ellis Remix) (Set Rip)-enTc\nJulian Jeweil - Air Conditionne (Dart Rayne &amp; Yura Moonlight Remix) (ASOT 682 Rip)-enTc\nKenneth Thomas - The Fade (GDJB Rip)-enTc\nKheda &amp; Ray Violet - Celeste (Cut From PvD Set)-enTc\nLukas Blekaitis - K79 (Original Mix) (Cut From El Jay Set)-enTc\nMarco V - Godd (Adam Ellis Intro Edit) (Set Rip)-enTc\nMatrick - Apnea (Original Mix) (Cut From Feel Set)-enTc\nMatt Skyer- Green (Rob Corbo Remix) (Cut From Prada Set)-enTc\nMaywave - Flowing Passion (Original Mix) (Cut From Feel Set)-enTc\nMeridian - Impression (Original Mix) (Cut From Feel Set)-enTc\nMichael Woods Feat. Lauren Dyson - In Your Arms (Ilan Bluestone Remix) (ASOT 682 Rip)-enTc\nMonochrome - April (Nikhil Prakash Remix) (Cut From Feel Set)-enTc\nO.B.M. Notion - A Virtual Flight (ASOT 682 Rip)-enTc\nOliver Lieb - Caldera (Silinder Remix) (Cut From Barone Set)-enTc\nOmar Essa - Legends of the Fall (Cut From PvD Set)-enTc\nPolaroid - So Damn Beautiful (Liam Wilson Mint Festival Bootleg Remix) (Cut From Wilson Set)-enTc\nSaint Sinner - Rampage (Origina Mix) (Cut From Feel Set)-enTc\nSam Slim - Sterrenbeeld (Original Mix) (Cut From Feel Set)-enTc\nSelu Vibra - Divine (Mark Van Ray Remix) (Cut From Romel Set)-enTc\nShadow Of Two - Rezeda (ABGT 098 Rip)-enTc\nShadow of Two - Rezeda (GDJB Rip)-enTc\nSquarz Kamel - Key Of Happiness (Miroslav Vrlik Emotional Remix) (Cut From Niki Set)-enTc\nSterbai &amp; Rafael Osmo - The Messenger (GDJB Rip)-enTc\nStuart Miller - Cobra (Original Mix) (Cut From Sty Set)-enTc\nSubsky - Strawberry Fields (Namatjira Remix) (Cut From Barone Set)-enTc\nSystem F - Out Of The Blue (Alex Van Gray Remix) (Cut From Cosmic Heaven Set)-enTc\nTalla2XLC - In Silence (ASOT 682 Rip)-enTc\nThomas Mengel - The Challenger (ABGT 098 Rip)-enTc\nTommy Johnson - Son Of Light (ASOT 682 Rip)-enTc\ntyDi Feat. Dashboard Confessional - The Closer I Get (Cut From Tydi Set)-enTc\ntyDi Feat. Luke Mansini - Shipwreck (Cut From Tydi Set)-enTc\ntyDi Feat. Melanie Fontana - Redefined (Cut From Tydi Set)-enTc\nUCast - LAX (ASOT 682 Rip)-enTc\nUnder This - Olympus (Original Mix) (Cut From Fonarev Set)-enTc\nVander &amp; Thomas - Vitality (Cut From Lange Set)-enTc\nVitodito - Multiplicaciones (Sunlight Project Remix) (Cut From Feel Set)-enTc\nZack Shaar - Blue Pulse (Original Mix) (Cut From Feel Set)-enTc\nZack Shaar - Blue Pulse (Original Mix) (Cut From Tom Fall Set)-enTc\nZhu - Faded (Spada Remix) (ABGT 098 Rip)-enTc\n","torrent":{"xt":"urn:btih:8711e4807c6ef9702ffeae1233fca00f114f9cd6","amp;dn":"EnigmaT+Set+Rips+%7B+Cuts+%7D+-+September+27th%2C+2014","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8711e4807c6ef9702ffeae1233fca00f114f9cd6","infoHashBuffer":{"type":"Buffer","data":[135,17,228,128,124,110,249,112,47,254,174,18,51,252,160,15,17,79,156,214]},"announce":[],"urlList":[]}}