{"title":"Hidden Secrets - Part 43 - Eye of The Phoenix - History of The U","uid":12230530,"size":2618456013,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:8876f6ff4242dafd42cbbf84c8a1c2e4eba65080&amp;dn=Hidden+Secrets+-+Part+43+-+Eye+of+The+Phoenix+-+History+of+The+U&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"POtHS11","files":43,"time":1439564851,"description":"Hidden Secrets - Part 43 - Eye of The Phoenix - History of The USA - 4 of 4\n\nThis documentary explores the highly controversial subject of the design of America's capital. Was the city built to reflect the majesty of America's newfound freedom?\n\nOr the hidden agenda of secret societies? With every major cornerstone laid by Freemasons, was the city built in a Masonic pattern? Embark upon this incredible journey as Riddles in Stone interviews experts on both sides of the heated debate. Watch as Freemason apologists defend some of the most direct and hard-hitting questions concerning the influence of Masonry in America, and its symbolism in Washington, D.C.\n\nAlongside them are leading researchers who maintain that occult architecture permeates the city, and conceals a secret agenda. Was D.C. laid out according to the pattern of the stars? Is there really a pentagram in the street layout north of the White House? Does a Masonic square and compass extend from the Capitol building to the Washington monument?\n\nAnd why is the city filled with zodiac symbols, mysterious faces, and various god and goddess images? If America was founded as a Christian nation only, where are the images of Jesus Christ? Or does Washington D.C. symbolize another Christ, the Masonic Christ?","torrent":{"xt":"urn:btih:8876f6ff4242dafd42cbbf84c8a1c2e4eba65080","amp;dn":"Hidden+Secrets+-+Part+43+-+Eye+of+The+Phoenix+-+History+of+The+U","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8876f6ff4242dafd42cbbf84c8a1c2e4eba65080","infoHashBuffer":{"type":"Buffer","data":[136,118,246,255,66,66,218,253,66,203,191,132,200,161,194,228,235,166,80,128]},"announce":[],"urlList":[]}}