{"title":"Charisma School - Personal Magnetism","uid":12135406,"size":549955002,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:888e2dc39f7e5430e2db2b54e66f4833a89d4a0b&amp;dn=+Charisma+School+-+Personal+Magnetism&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"acer47x","files":12,"time":1437165074,"description":"On the 10 Steps to Self-Confidence and Inner Power course we started to develop internal aspects of ourselves, our Inner Power and Will. In this course, we're focusing on the external aspects of Personal Magnetism.You develop a magnetic voice, mastery of your personal space, magnetic touch, external vibrations and so on. You can change the way you walk, talk, move, touch to having a magnetic and stronger impact on others.\n\nYou can find in this course a complete body and mind training for Personal Magnetism\n\nPeople Form Their First Impression Of You In 3 Seconds! Learn to Create An Irresistable Impact on Everyone You Meet!\n\nI figured out a long time ago that Personal Magnetism was the key to a successful personal or professional life.\n\nThose who possess this amazing quality automatically have an unfair advantage in life and can get ahead on any job or situation much easily than everyone else.\n\nBelieve it or not, the first time I realized this I was still in school.\n\nI was a shy and introverted 13 year old boy. I was a good student and behaved well in class so teachers generally liked me.\n\nYet, there was another guy called Aaron. He didn't had good grades but also didn't had bad ones. Just enough to pass.\n\nBut he was the most social guy in school. Everyone loved him, including the teachers.\n\nOne day we were having an important exam, and during the exam, he sneakely asked me for help.\n\nHe passed me a sheet of paper for me to write the answer on and I was really nervous that I would be found out.\n\nI noticed that on one side of the sheet of paper, he had drew the teacher as a funny cartoon with a big head (indeed she had a big head and Aaron was a very talented cartoonist for such a young age)\n\nI didn't care about the drawing and just wrote down the answer for him on the other side of the paper.\n\nI passed him the sheet of paper again and that was it. He crumbled it and put it under the desk.\n\nI was relieved that was over!\n\nBut not yet.\n\nAs an accident, the paper fell on the floor and the teacher saw it.\n\nHe tried to grab it straight away but the teacher took it away from him.\n\nI started shaking as leaf! If the teacher saw the answer to the exam question we would both get suspended!\n\nThe teacher uncrumbled the sheet of paper and saw the drawing of him as a big head that Aaron had drew. He didn't saw the other side of the paper.\n\n&quot;For crying out loud!&quot; she said to Aaron, &quot;instead of paying attention to the test you're making fun of me?&quot;\n\nI was eagerly praying that she wouldn't turn around the sheet of paper.\n\nAnd for the first time ever I saw the age old art of Personal Magnetism or Charm at work.\n\nAaron, for someone who's on the verge of being suspended either for making fun of the teacher or cheating on an important test, very calmy and relaxed, started to talk about his love for drawing and how much he loved cartoons.\n\nHe talked about how he only drew people who he really liked and respected and showed him a cartoon of himself and his parents to prove that.\n\nThe teacher slowly started to understand and also started joking with a situation. He even wanted to keep the cartoon. Which would be a big problem for us!\n\nVery calmy he told him: &quot;I'll tell you what. because this sheet of paper is a bit crumbled, why don't I draw another cartoon for you on a straight sheet of paper?&quot;, and gently took the paper away from him!!\n\nI almost had a heart attack. but finally it was solved!\n\nI realized that he had such a magnetism that he could get away with everything! His voice was magnetic, his presence was magnetic, no wonder everyone loved him.\n\nAnd indeed the last time I heard of him, he was one of the youngest CEOs of a big multinational company. Not bad for someone with average grades that always cheated on tests!\n\nHow many &quot;Aarons&quot; do you also know in your life?\n\nThose individuals that are always liked by others and seem to get away with everything?\n\nI knew my fair share as well. Aaron was just the first one I remembered.\n\nAt such a young age, Aaron was obviously born with it.\n\nBut this led me to think. how about the rest of us? If we weren't born with it, are we forever doomed with none or little Personal Magnetism or Charisma?\n\nI'm sure we could all use a bit more of this unfair advantage in getting ahead in life.\n\nOf course not, there's a way to develop it! As I would find out, there's a whole set of teachings and methods designed precisely for that!\n\nThey are designed to transform every one who wants to apply them, into charismatic and magnetic individuals.\n\nBy a stroke of luck, I came across these teachings also very young. Which led me to practice, research and teach them for about 15 years!\n\nAnd this training program is the culmination of all this time researching and teachings others.\n\nYou can now have access to the a Complete Training Program called &quot;Personal Magnetism&quot; that allows YOU to become a Magnetic Individual!\n\nThis course will have 11 distinct steps each of them developing on top of the other and giving you each time more Personal Magnetism","torrent":{"xt":"urn:btih:888e2dc39f7e5430e2db2b54e66f4833a89d4a0b","amp;dn":"+Charisma+School+-+Personal+Magnetism","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"888e2dc39f7e5430e2db2b54e66f4833a89d4a0b","infoHashBuffer":{"type":"Buffer","data":[136,142,45,195,159,126,84,48,226,219,43,84,230,111,72,51,168,157,74,11]},"announce":[],"urlList":[]}}