{"title":"Modeling and Computation of Boundary-Layer Flows 2nd ed","uid":12211708,"size":23262413,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:892ead3334ce2ce45744d86e4045b1dbcb1b42f4&amp;dn=Modeling+and+Computation+of+Boundary-Layer+Flows+2nd+ed&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"clouderone","files":1,"time":1439106410,"description":"Modeling and Computation of Boundary-Layer Flows 2nd ed - Tuncer Cebeci, Jean Cousteix (Springer, Horizons, 2005).pdf\n\nISBN 3-540-24459-X\n\nThis second edition of Modeling and Computation of Boundary Layer Flows extends the topic to include compressible flows including the energy equation and non-constant fluid properties in the continuity and momentum equations. The necessary additions are included in new chapters, leaving the first nine chapters to serve as an introduction to incompressible flows that can be used as an introduction to computational fluid dynamics with emphasis on the solution of the boundary-layer equations and the modeling and computation of boundary-layer flows. It also provides readers with a good understanding of the basic principles of fluid dynamics and numerical methods. A variety of readers, including undergraduate and graduate students, teachers or scientists working in aerodynamics or hydrodynamics will find the text interesting. The subjects covered in this book include laminar and, turbulent boundary layers and laminar turbulent transition. The viscous inviscid coupling between the boundary layer and the inviscid flow is also addressed. Two-dimensional and three-dimensional incompressible flows are considered. Physical and numerical aspects of boundary-layer flows are described in detail and a large number of homework problems are included","torrent":{"xt":"urn:btih:892ead3334ce2ce45744d86e4045b1dbcb1b42f4","amp;dn":"Modeling+and+Computation+of+Boundary-Layer+Flows+2nd+ed","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"892ead3334ce2ce45744d86e4045b1dbcb1b42f4","infoHashBuffer":{"type":"Buffer","data":[137,46,173,51,52,206,44,228,87,68,216,110,64,69,177,219,203,27,66,244]},"announce":[],"urlList":[]}}