{"title":"Gasoline, Diesel, and Ethanol Biofuels from Grasses and Plants","uid":12147862,"size":3022499,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:898b6326ef4d89a8b0cff99b4e8e2949d226423b&amp;dn=Gasoline%2C+Diesel%2C+and+Ethanol+Biofuels+from+Grasses+and+Plants&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"clouderone","files":1,"time":1437517897,"description":"Gasoline, Diesel, and Ethanol Biofuels from Grasses and Plants (Cambridge, 2010).pdf\n\nISBN 9780521763998\n\nThe world is currently faced with two significant problems: fossil fuel depletion and environmental degradation, which are continuously being exacerbated due to increasing global energy consumption. As a substitute for petroleum, renewable fuels have been receiving increasing attention due a variety of environmental, economic, and societal benefits. The first-generation biofuels - ethanol from sugar or corn and biodiesel from vegetable oils - are already on the market. The goal of this book is to introduce readers to second-generation biofuels obtained from non-food biomass, such as forest residue, agricultural residue, switch grass, corn stover, waste wood, municipal solid wastes, and so on. Various technologies are discussed, including cellulosic ethanol, biomass gasification, synthesis of diesel and gasoline, bio-crude by hydrothermal liquefaction, bio-oil by fast pyrolysis, and the upgradation of biofuel. This book strives to serve as a comprehensive document presenting various technological pathways and environmental and economic issues related to biofuels","torrent":{"xt":"urn:btih:898b6326ef4d89a8b0cff99b4e8e2949d226423b","amp;dn":"Gasoline%2C+Diesel%2C+and+Ethanol+Biofuels+from+Grasses+and+Plants","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"898b6326ef4d89a8b0cff99b4e8e2949d226423b","infoHashBuffer":{"type":"Buffer","data":[137,139,99,38,239,77,137,168,176,207,249,155,78,142,41,73,210,38,66,59]},"announce":[],"urlList":[]}}