{"title":"Stewart Shapiro - The Oxford Handbook of Philosophy of Mathemati","uid":11122621,"size":5158302,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8a2cbbb4efb20c0066517cf577b85862381d153f&amp;dn=Stewart+Shapiro+-+The+Oxford+Handbook+of+Philosophy+of+Mathemati&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"philosophi","files":-1,"time":1411939963,"description":"Stewart Shapiro - The Oxford Handbook of Philosophy of Mathematics and Logic\n\nMathematics and logic have been central topics of concern since the dawn of philosophy. Since logic is the study of correct reasoning, it is a fundamental branch of epistemology and a priority in any philosophical system. Philosophers have focused on mathematics as a case study for general philosophical issues and for its role in overall knowledge- gathering. Today, philosophy of mathematics and logic remain central disciplines in contemporary philosophy, as evidenced by the regular appearance of articles on these topics in the best mainstream philosophical journals; in fact, the last decade has seen an explosion of scholarly work in these areas.\n\nThis volume covers these disciplines in a comprehensive and accessible manner, giving the reader an overview of the major problems, positions, and battle lines. The 26 contributed chapters are by established experts in the field, and their articles contain both exposition and criticism as well as substantial development of their own positions. The essays, which are substantially self-contained, serve both to introduce the reader to the subject and to engage in it at its frontiers. Certain major positions are represented by two chapters--one supportive and one critical.\n\nThe Oxford Handbook of Philosophy of Math and Logic is a ground-breaking reference like no other in its field. It is a central resource to those wishing to learn about the philosophy of mathematics and the philosophy of logic, or some aspect thereof, and to those who actively engage in the discipline, from advanced undergraduates to professional philosophers, mathematicians, and historians.","torrent":{"xt":"urn:btih:8a2cbbb4efb20c0066517cf577b85862381d153f","amp;dn":"Stewart+Shapiro+-+The+Oxford+Handbook+of+Philosophy+of+Mathemati","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8a2cbbb4efb20c0066517cf577b85862381d153f","infoHashBuffer":{"type":"Buffer","data":[138,44,187,180,239,178,12,0,102,81,124,245,119,184,88,98,56,29,21,63]},"announce":[],"urlList":[]}}