{"title":"Hollywood Canteen (1944) Untouched DVD9 - Subs-Eng-Fr -  Musical","uid":11108577,"size":7226961920,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:8a4f8b4dcea6e761b4f985344d88bbebb5d05d7d&amp;dn=Hollywood+Canteen+%281944%29+Untouched+DVD9+-+Subs-Eng-Fr+-++Musical&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"SaM","files":-1,"time":1411761667,"description":"Hollywood Canteen (1944) Untouched DVD9 - Subs-Eng-Fr -  Musical with Many Stars in Cameo Roles [DDR]\n\nHollywood Canteen is a 1944 American musical romantic comedy film starring Joan Leslie, Robert Hutton, and Dane Clark and distributed by Warner Bros. \nThe film was written and directed by Delmer Daves, and is notable for featuring many stars (appearing as themselves) in cameo roles. \nThe film received three Academy Award nominations.\n\nCAST:-\nJoan Leslie\nRobert Hutton\nDane Clark\n\nCAMEO APPEARANCES:-\nThe Andrews Sisters\nJack Benny\nJoe E. Brown \nEddie Cantor \t\nKitty Carlisle\t\nJack Carson\nDane Clark\nJoan Crawford\nHelmut Dantine\nBette Davis\nFaye Emerson\nVictor Francen\nJohn Garfield\nSydney Greenstreet\nAlan Hale \n\nDirected by Delmer Daves\nProduced by Alex Gottlieb\nWritten by Delmer Daves\nMusic by Leo F. Forbstein\nRunning time 124 minutes\n\nSYNOPSIS:- Hollywood Canteen (1944)\nTwo soldiers on leave spend three nights at the Hollywood Canteen before returning to active duty in the South Pacific. Slim Green (Robert Hutton) is the millionth G.I. to enjoy the Canteen, and consequently wins a date with Joan Leslie. The other G.I., Sergeant Nolan (Dane Clark) gets to dance with Joan Crawford. Canteen founders Bette Davis and John Garfield give talks on the history of the Canteen. The soldiers enjoy a variety of musical numbers performed by a host of Hollywood stars, and also comedians, such as Jack Benny and his violin.\n\nTwo soldiers on sick leave spend three nights at the Hollywood Canteen before going back to active duty. With a little friendly help from John Garfield, Slim gets to kiss Joan Leslie, who he has been dreaming about while in the Pacific. He meets her later at the Farmer's Market. On the third night, Slim is the millionth man into the Canteen, earning him a date with Joan. Slim thinks he's been duped when she doesn't show up at his train. Slim's buddy Sergant dances with Joan Crawford. Canteen President Bette Davis praises the canteen and the war effort. Virtually everyone Warners could spare entertains. \n\nThe film's setting is the Hollywood Canteen, a free entertainment club open to servicemen. The Canteen was created as a G.I. morale-booster by movie stars Bette Davis and John Garfield during World War II. Many of those cameoing in the film had previously volunteered to work there or provide entertainment. They include: The Andrews Sisters, Jack Benny, Joe E. Brown, Eddie Cantor, Kitty Carlisle, Jack Carson, Joan Crawford, Faye Emerson, Sydney Greenstreet, Alan Hale, Sr., Paul Henreid, Joan Leslie, Peter Lorre, Ida Lupino, Dorothy Malone, Dennis Morgan, Janis Paige, Eleanor Parker, Roy Rogers (with Trigger), S.Z. Sakall, Zachary Scott, Alexis Smith, Barbara Stanwyck, Jane Wyman, Jimmy Dorsey and The Golden Gate Quartet.\n\nThe East Coast counterpart was the &quot;Stage Door Canteen&quot; also celebrated in an RKO film.\n\nMUSICAL NUMBERS:-\n1. &quot;Hollywood Canteen&quot; - Sung by The Andrews Sisters behind titles.\n2. &quot;What Are You Doin' the Rest of Your Life&quot; - Sung and Danced by Jack Carson and Jane Wyman with Jimmy Dorsey and His Orchetra.\n3. &quot;The General Jumped at Dawn&quot; - Sung by Golden Gate Quartet.\n4. &quot;We're Having a Baby&quot; - Sung by Eddie Cantor and Nora Martin with Jimmy Dorsey and His Orchetra.\n5. &quot;Tumblin' Tumbleweeds&quot; - Sung by Sons of the Pioneers.\n6. &quot;Don't Fence Me In&quot; - Sung by Roy Rogers with Sons of the Pioneers.\n7. &quot;Gettin' Corns For My Country&quot; - Sung by The Andrews Sisters with Jimmy Dorsey and His Orchetra.\n8. &quot;Don't Fence Me In&quot; - Sung by The Andrews Sisters with Jimmy Dorsey and His Orchetra.\n9. &quot;You Can Always Tell a Yank&quot; - Sung by Dennis Morgan and Chorus with Jummy Dorsey and His Orchestra, then Sung by Joe E. Brown with Chorus.\n10. &quot;Sweet Dreams, Sweetheart&quot; - Sung by Joan Leslie (dubbed by Sally Sweetland) and Chorus.\n11. &quot;Ballet in Jive&quot; - Danced by Joan McCracken and Chorus.\n12. &quot;The Bee&quot; - Played by Joseph Szigeti.\n13. &quot;The Souvenir&quot; - Played by Joseph Szigeti and Jack Benny.\n14. &quot;Voodoo Moon&quot; - Played by Carmen Cavallaro and His Orchestra.\n15. &quot;Dance&quot; - Danced by Rosario and Antonio.\n16. &quot;Sweet Dreams, Sweetheart&quot; - Sung by Kitty Carlisle.\n\nFILM RECEPTION:-\nThe film received mixed reviews from critics. Variety noted, &quot;There isn't a marquee big enough to hold all the names in this one, so how can it miss? Besides, it's basically solid. It has story, cohesion, and heart.&quot;Kate Cameron of the Daily News commented, &quot;It is an elaborate show, but it is presented by author-director Delmar Daves in such a patronizing manner as to make one blush for its complete lack of reserve in singing the praises of Hollywood.&quot;\n\nDespite some negatives reviews, Hollywood Canteen was well received by audiences and the film became the fourth highest grossing film of 1944.\nWarner Bros. donated 40% of ticket sales to the real Hollywood Canteen.\n\nTECHNICAL SPECIFICATIONS:-\nVideo Codec: MPEG-2\nVideo Bitrate: 4823 kbps\nVideo Resolution: 720x480\nVideo Aspect Ratio: 1.333:1\nFrames Per Second: 29.970\nAudio Codec:  AC3\nAudio Bitrate: 192kb/s CBR 48000 Hz\nAudio Streams:  1\nAudio Languages: English\nRunTime 124 mins\nSubtitles: English, Francais\nRipped by: Trinidad [DDR]","torrent":{"xt":"urn:btih:8a4f8b4dcea6e761b4f985344d88bbebb5d05d7d","amp;dn":"Hollywood+Canteen+%281944%29+Untouched+DVD9+-+Subs-Eng-Fr+-++Musical","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8a4f8b4dcea6e761b4f985344d88bbebb5d05d7d","infoHashBuffer":{"type":"Buffer","data":[138,79,139,77,206,166,231,97,180,249,133,52,77,136,187,235,181,208,93,125]},"announce":[],"urlList":[]}}