{"title":"On The Town With The League Of Gentlemen - MP3 - Slimoo","uid":12120494,"size":187608575,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:8aa671cf737a2502cc0945e9849216bb109d644f&amp;dn=On+The+Town+With+The+League+Of+Gentlemen+-+MP3+-+Slimoo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"_Slimoo_","files":7,"time":1436815798,"description":"On The Town With The League Of Gentlemen - Series 01 - Audio Comedy - BBC7 \n6 x 30 minute episodes - 128Kbps - Mp3 - Slimoo\n\n\nOn The Town was The League Of Gentlemen's BBC Radio 4 Show Set in the fictional town of Spent..\n\nThe League of Gentlemen is primarily a sitcom, albeit an unusual one. It consists of a series of sketches which come together to form an overall story. Since all the action takes place, and nearly all the characters live, in the same village, there is much overlap, and the events and characters of one story play a part in the lives of others, much as in a soap opera. There is usually a main plot to which the minor stories tend to be tenuously connected.\n\nIn the radio series, the plot involved outsider Benjamin Denton visiting his aunt and uncle in Spent to be interviewed for a job at the local power plant. \nNot surprisingly, he missed the interview and was forced to stay longer than expected.\n\nOn The Town was first aired on Radio 4 on 6th November 1997.\n\n\n\nCharacters\n\nReece Shearsmith \n\nBenjamin Denton - Media student &amp; Nephew of Val &amp; Harvey Denton\nBernice Woodall - Spent FM DJ and agony aunt. Hates everyone and everything\nRoss Gaines - The intellegent one in Paulines Restart\nGeoff Tipps - Works at the plastics factory. Can't tell jokes\nReg Ingley - Tiny shop keeper. He can fit on top of a wedding cake and.. in a condom...\nThe Answerphone Man - He's trying to get in touch with his big woman who's always out. But he's in, he's always in...\n\nSteve Pemberton \n\nSister Meg - Rather naughty nun\nPauline Campbell-Jones - Nasty restart officer. Obsessed with pens\nMike Harris - Geoff's boss at the plastics factory\nHarvey Denton - Ben's uncle. Obsessed with toads and cleanliness\nFarmer jed Tinsel - Owns Ten Acre fields. Calls out Dr Chinnery to put down one of his dogs... \n\nMark Gatiss \n\nGuard - Works in the train station which is about to close down\nMickey M Michaels - Pant wetting simplton on the restart course\nBrian Morgan - Another work colleague and friend of Geoff and Mike\nVal Denton - Ben's Auntie. Also obsessed with cleanliness and certain stains...\nDr Matthew Chinnery - Spents tragic vet. He is suppose to cure the animals but...\nWaiter - Indian man works at Shebab's restaurant\n\n\nOn The Town With The League Of Gentlemen - S01 - E01 - Guest At The Dentons\nOn The Town With The League Of Gentlemen - S01 - E02 - Death By Mau Mau\nOn The Town With The League Of Gentlemen - S01 - E03 - Go To Joan Glover\nOn The Town With The League Of Gentlemen - S01 - E04 - Gunpowder, Treason And Plot \nOn The Town With The League Of Gentlemen - S01 - E05 - A Kind Of Loving\nOn The Town With The League Of Gentlemen - S01 - E06 - God Rest Ye Merry, Gentlemen\n\nPlus\nThe League Of Gentlemen's Ghost Chase &lt;a href=&quot;\nhttp://www.bbc.co.uk/programmes/b00vhfjn&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.bbc.co.uk/programmes/b00vhfjn&lt;/a&gt;\n\nAudio Format : MP3\nDuration Approx : 28mn 54s\nBit rate mode : Constant\nBit rate : 128 Kbps\nChannel(s) : 2 channels\nSampling rate : 44.1 KHz\nResolution : 16 bits","torrent":{"xt":"urn:btih:8aa671cf737a2502cc0945e9849216bb109d644f","amp;dn":"On+The+Town+With+The+League+Of+Gentlemen+-+MP3+-+Slimoo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8aa671cf737a2502cc0945e9849216bb109d644f","infoHashBuffer":{"type":"Buffer","data":[138,166,113,207,115,122,37,2,204,9,69,233,132,146,22,187,16,157,100,79]},"announce":[],"urlList":[]}}