{"title":"Jenova Project - Z Day (Deluxe) [Industrial - Pop]","uid":11076891,"size":244631372,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:8b8b011262a61cce08b6ee6a9db8634c8f68e0dc&amp;dn=Jenova+Project+-+Z+Day+%28Deluxe%29+%5BIndustrial+-+Pop%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Thasis666","files":47,"time":1411343160,"description":"This is the second official release of the Z Day album by Jenova Project. The album, as well as future updates can be found on our Soundcloud pageThe reason for this second release is the proper inclusion of full artwork for each song, a re-considered track ordering playlist for album, and the inclusion of the original album in it's full instrumental form as per it's state 2007-2009.\n\nAs for the project, it is a one man electronic musical project that touches upon a wide variety of sub-genres (pop, industrial, rock, trance/techno, hip-hop, classical/symphonic, downtempo/trip-hop, acid/IDM/glitch) and features a wide variety of different vocal styles (clean, growl, guttural, vocoder, rap, spoken word, screamed, howled, etc). The goal is less to fit a cohesive and specific sound, and more to fit a cohesive emotion or soundscape, with each album carrying either a particular message or concept/story.\n\nFor this album, the concept is the beginning of The World Covered In Ash cycle of albums, and begins the tale with the survivor of mission to a hostile alien world in a far away galaxy crash landing, in retreat from the alien threat, returning to his home planet, a Utopian Earth in the year 2137. Little did he know he carried a parasitic virus that attaches itself to organic life and causes it to rapidly mutate and become vicious and predatory. The virus devastates most of the planet turning vast amounts of the populace into mutant cannibals.\n\nAs one of the few immune to the virus theProphet walks the lands gathering survivors in a desperate attempt to find The Final Solution.","torrent":{"xt":"urn:btih:8b8b011262a61cce08b6ee6a9db8634c8f68e0dc","amp;dn":"Jenova+Project+-+Z+Day+%28Deluxe%29+%5BIndustrial+-+Pop%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8b8b011262a61cce08b6ee6a9db8634c8f68e0dc","infoHashBuffer":{"type":"Buffer","data":[139,139,1,18,98,166,28,206,8,182,238,106,157,184,99,76,143,104,224,220]},"announce":[],"urlList":[]}}