{"title":"What To Know About UFO's","uid":11095704,"size":150255101,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:8cc50f5939db2fb961e69c25dc816e65c7b63b10&amp;dn=What+To+Know+About+UFO%27s&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Mooseleg8","files":-1,"time":1411592648,"description":"Advanced spacecraft of extraterrestrial origin have been downed, retrieved and studied since at least the 1940s. Significant technological breakthroughs in energy generation and propulsion have resulted from the study of these objects. We have insiders and scientists who can prove that we do in fact possess energy generation systems capable of completely and permanently replacing all forms of currently used energy generation and transportation systems. The witnesses who have given testimony are extraordinarily brave men and women who have taken great personal risks in coming forward. Some have been threatened and intimidated. Not a single one of them has been paid for his or her testimony. Classified, above top-secret projects possess new energy generation systems that, if put into peaceful uses, would empower a new human civilization without want, poverty, or environmental damage. Every single person who is concerned about the environment and the human future should call for urgent hearings to allow these technologies to be disclosed, declassified and safely applied","torrent":{"xt":"urn:btih:8cc50f5939db2fb961e69c25dc816e65c7b63b10","amp;dn":"What+To+Know+About+UFO%27s","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8cc50f5939db2fb961e69c25dc816e65c7b63b10","infoHashBuffer":{"type":"Buffer","data":[140,197,15,89,57,219,47,185,97,230,156,37,220,129,110,101,199,182,59,16]},"announce":[],"urlList":[]}}