{"title":"Our Lady Peace -Superman's Dead (Single) mp3","uid":11126456,"size":10265956,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:8d928c8dac2e8c4c4efe31b288ceae172ebd0afe&amp;dn=+Our+Lady+Peace+-Superman%27s+Dead+%28Single%29+mp3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"analogkid6103","files":1,"time":1411972662,"description":"Description\nI have got that album several times and because I wanted to hear this . Right off the top of my head I couldn't name any of the other tracks So I make this cause I cant be the only one......Anyway more info....&quot;Superman's Dead&quot; is a song by Our Lady Peace, released as the first single from their second album Clumsy. This has become one of Our Lady Peace's most popular songs in both Canada and the U.S., as well as many other parts of the world.\n\nThe song has become the definitive example of Our Lady Peace's staple sound, highlighted by vocalist Raine Maida's unusual yet powerful falsetto. This song, in contrast to many others on the album, is very heavy, especially in comparison to tracks like &quot;Automatic Flowers&quot; and &quot;Clumsy&quot;.Meaning\n\n&quot;Superman's Dead&quot; was seen by the band as a dark statement on how much television kids watch and the content of it. It looks at the dark expectations that are garnered from media images:\n\nAn ordinary girl an ordinary waist\nBut ordinary's just not good enough today\n\nRaine Maida stated, &quot;I grew up with the old Superman, the black-and-white one. There was something so honest about it, and it's evolved into Beavis and Butthead&quot;. He also says of youthful TV pleasures, &quot;Their images are defined by television: How they should think or what they should wear. It's kind of sad that way&quot;The first performance of &quot;Superman's Dead&quot; took place on January 13, 1997 at Harbour Station in Saint John, New Brunswick, the first date of the Clumsy tour. Since then it has seldom been excluded from the band's live set. &quot;Superman's Dead&quot; was played live on the Conan O'Brien Show on October 1, 1997.\n\nDuring concerts, when the song always pauses abruptly for the &quot;Doesn't anybody ever know...&quot; section, the band takes a slight pause, and the audience sings the outro. This can be heard in their live album Live (2003), and many other live concerts","torrent":{"xt":"urn:btih:8d928c8dac2e8c4c4efe31b288ceae172ebd0afe","amp;dn":"+Our+Lady+Peace+-Superman%27s+Dead+%28Single%29+mp3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8d928c8dac2e8c4c4efe31b288ceae172ebd0afe","infoHashBuffer":{"type":"Buffer","data":[141,146,140,141,172,46,140,76,78,254,49,178,136,206,174,23,46,189,10,254]},"announce":[],"urlList":[]}}