{"title":"Tymco 600 BAH Operaters Manual","uid":11131928,"size":21364910,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:8dd24f345251305b5094b3c2afca9e2c03edadb0&amp;dn=Tymco+600+BAH+Operaters+Manual&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"1122weiss","files":5,"time":1412056507,"description":"This is the manual for the Tymco 600 BAH Sweeper. It has all the info you need for Parts and maintenance. This is the manual from Industrial Supplies from Waco, TX. You probably only need this manual if you happen to operate this type of Heavy equipment for a municipal or state job. It took me awhile to get this. It is the 2013 model which should have all the current and up to date parts numbers. This is for the operators of this equipment. I will seed this off and on for 1 year, but not every day, Maybe once or twice a month, be patient. Not very many people will find this information useful so only download this if you happen to operate this piece of equipment and need the info contained within. It will be seeded until 10/01/2015, but as I said not every day. I found this to be a lot more useful than the manual that came with the sweeper. I repeat, only download this if you operate this equipment, for the rest of you who are curious, Don't bother, it will not be of interest. This will only help the people who have this model!","torrent":{"xt":"urn:btih:8dd24f345251305b5094b3c2afca9e2c03edadb0","amp;dn":"Tymco+600+BAH+Operaters+Manual","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8dd24f345251305b5094b3c2afca9e2c03edadb0","infoHashBuffer":{"type":"Buffer","data":[141,210,79,52,82,81,48,91,80,148,179,194,175,202,158,44,3,237,173,176]},"announce":[],"urlList":[]}}