{"title":"J.R.R. Tolkien Archive (Various Authors) PDF ePub Mobi Pictures","uid":12293225,"size":4071129203,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:8def25a67e82a3422132d7ed55330bfe09af46bd&amp;dn=J.R.R.+Tolkien+Archive+%28Various+Authors%29+PDF+ePub+Mobi+Pictures&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Philthehip","files":837,"time":1440589198,"description":"Description\nThis is my J.R.R. Tolkien Archive, it has all the major works by Tolkien himself plus various lectures, essays, stories, biographies and learning from other authors. \n\nPlease be aware that I have created almost all of the PDF's myself from various sources from online or my own books. These will obviously not always be to the highest retail quality but they are all almost very readable (I use a tablet to read these and it works great) \n\nIt is broken down into sections and hopefully it is as anybody wishing to learn more about Middle-earth will need. This has been a huge undertaking and I should thank all the people over the years who have scanned and edited Tolkien related material. I can not name them all here but you will see some of your own work and I take this chance to thank you all for making my own Tolkien digital collection possible.\n\nIncluded in this upload is many books ranging from Tolkien's created world of Middle-earth to his academic life. Around 500 books and articles all relating to his work. Many thanks go to Pippin54 for helping me build this. Many many of the epubs and mobis related to Tolkien's work came from her, she knows she is ace!!!\n\n\nI have not edited or improved any of the History of Middle-earth PDF's and all that are included here have been previously posted online. By the time I finish turning these into decent copies they will be available as retail eBooks.\n\nEnjoy and please seed","torrent":{"xt":"urn:btih:8def25a67e82a3422132d7ed55330bfe09af46bd","amp;dn":"J.R.R.+Tolkien+Archive+%28Various+Authors%29+PDF+ePub+Mobi+Pictures","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8def25a67e82a3422132d7ed55330bfe09af46bd","infoHashBuffer":{"type":"Buffer","data":[141,239,37,166,126,130,163,66,33,50,215,237,85,51,11,254,9,175,70,189]},"announce":[],"urlList":[]}}