{"title":"The Ugly Face of Disability Hate Crimes ENG SUBS WEBRIP [MPup]","uid":12155900,"size":643798167,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:8e9a5f4b4bf5773135bdaa9ed7c8ee708d233636&amp;dn=The+Ugly+Face+of+Disability+Hate+Crimes+ENG+SUBS+WEBRIP+%5BMPup%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"makinapufterpup","files":4,"time":1437782717,"description":"BBC.Documentaries.2015.07.23.The.Ugly.Face.of.Disability.Hate.Crimes.ENG.SUBS.WEBRIP.[MPup]\n\nFormat: MPEG-4\nSize: 832x468\nDisplayAspectRatio: 16:9\nFrameRate: 25.000 fps\nAudioCodec: AAC\nChannels: 2 channels\nSamplingRate: 48.0 KHz\n\nAdam Pearson - who has neurofibromatosis type 1 - is on a mission to explore disability hate crime: to find out why it goes under-reported, under-recorded and under people's radar.\n\n[img]http://extraimago.com/images/2015/07/24/e6cc1bae844e0551f97c1d2439d4bf1d.png[/img]\n\n[img]http://extraimago.com/images/2015/07/24/f91b1e4d6323e3b9251f55ac4de7f0f9.jpg[/img]\n\nAdam Pearson is on a mission to explore disability hate crime - to find out why it goes under-reported, under-recorded and under people's radar. In this documentary, Adam challenges people into questioning their attitudes towards disability and disfigurement, to uncover the roots of the issue.\n\nAdam has neurofibromatosis type 1, a condition that causes benign tumours to grow on nerve endings - in his case, on his face. He is disfigured and disabled and has experienced disability hate crime first-hand, like a number of his friends, some of whom he meets with in the film. Their stories may differ, but their disability as the motivating factor is constant.\n\nJust days into his investigation, Adam becomes the target of some grossly offensive online hate speech. While this isn't unusual for him, for the first time Adam decides to take action, reporting it to the police - with some unexpected outcomes.\n\nUndeterred, he looks to understand the laws specific to disability hate crime, and finds that a mixture of ignorance and inequalities mean that these crimes often don't make it to our courts, or are sentenced less severely than other hate crimes when they do.\n\nAdam looks to uncover what attitudes and influences may be causing people to commit disability hate crime in the first place, questioning whether the portrayal of disfigurement and disability in the media, for example, could be leading us to associate them with being 'the bad guys'.\n\nWith help from Miles Hewstone, professor of social psychology at the University of Oxford, Adam conducts an experiment measuring peoples' innate prejudice towards disfigurement that gives some shocking results, and leads him to question if he alone can hope to affect a change - and if so, how?","torrent":{"xt":"urn:btih:8e9a5f4b4bf5773135bdaa9ed7c8ee708d233636","amp;dn":"The+Ugly+Face+of+Disability+Hate+Crimes+ENG+SUBS+WEBRIP+%5BMPup%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8e9a5f4b4bf5773135bdaa9ed7c8ee708d233636","infoHashBuffer":{"type":"Buffer","data":[142,154,95,75,75,245,119,49,53,189,170,158,215,200,238,112,141,35,54,54]},"announce":[],"urlList":[]}}