{"title":"The Bandit Queen of India: An Indian Woman's Amazing Journey","uid":12272632,"size":11701932,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8f00e01c2458bd8b70129f5308d9651a816c8c68&amp;dn=The+Bandit+Queen+of+India%3A+An+Indian+Woman%27s+Amazing+Journey&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"mdusanjay","files":1,"time":1440307826,"description":"The Bandit Queen of India: An Indian Woman's Amazing Journey from Peasant to International Legend by Marie-Therese Cuny\n\nEnglish | Aug. 1, 2006 | ISBN: 1592286410 | 512 Pages | PDF | 11.16 MB\n\nShe was born in India to the lowest caste, a group with few rights and even fewer prospects. Enduring cruel poverty, Phoolan Devi survived the humiliation of an abusive marriage, the savage killing of her bandit-lover, and horrifying gang rape to claim retribution for herself and all low-caste women of the Indian plains. In a three-year campaign that rocked the government, she delivered justice to rape victims and stole from the rich to give to the poor, before negotiating surrender on her own terms. Throughout her years of imprisonment without trial, Phoolan Devi remained a beacon of hope for the poor and the downtrodden. In 1996, amidst both popular support and media controversy, she was elected to the Parliament. On July 25, 2001, Phoolan Devi was shot dead in Delhi. The identity of her killers is unknown, but it is thought that they may include relatives of villagers killed by her gang nearly twenty years ago. For over a decade millions have found the power and scope of Phoolan Devi's myth irresistible. Here is the story of her life through her eyes and in her own voice","torrent":{"xt":"urn:btih:8f00e01c2458bd8b70129f5308d9651a816c8c68","amp;dn":"The+Bandit+Queen+of+India%3A+An+Indian+Woman%27s+Amazing+Journey","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8f00e01c2458bd8b70129f5308d9651a816c8c68","infoHashBuffer":{"type":"Buffer","data":[143,0,224,28,36,88,189,139,112,18,159,83,8,217,101,26,129,108,140,104]},"announce":[],"urlList":[]}}