{"title":"Tripping The Rift Complete Series","uid":12169977,"size":7443490478,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:8fc66b6e9d2d84c180b365f147f38526f15970c5&amp;dn=Tripping+The+Rift+Complete+Series&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":43,"time":1438134742,"description":"Tripping the Rift is a adult CGI science fiction comedy television series. It is based on two short animations published on the Internet by Chris Moeller and Chuck Austen. The series was produced by CineGroupe in association with the Sci Fi Channel. It did very well in ratings; however, because Sci Fi didn't have a major 18-34 demographic coming to the network regularly and Sci Fi was not seen as a source of comedy programming, the network decided to postpone ordering more episodes. CineGroupe continued producing the series for the other North American and International broadcasters. The series aired on the Canadian speciality channel Space in 2004. Canada's cartoon network Teletoon has been airing the series since August 2006. The third season aired on Teletoon in 2007, and a feature-length movie version was released on DVD in 2008.\n\nMany episodes parody or allude to movies, television shows or novels. For example, &quot;23Â½&quot; makes reference to the series 24 and Snakes on a Plane. In fact, the opening of each of the series' episodes pays homage to three specific science fiction shows and movies; Star Trek (Whip's remote toy), Star Wars (Gus' vacuum), and 2001: A Space Odyssey (the back of T'Nuk's chair)","torrent":{"xt":"urn:btih:8fc66b6e9d2d84c180b365f147f38526f15970c5","amp;dn":"Tripping+The+Rift+Complete+Series","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8fc66b6e9d2d84c180b365f147f38526f15970c5","infoHashBuffer":{"type":"Buffer","data":[143,198,107,110,157,45,132,193,128,179,101,241,71,243,133,38,241,89,112,197]},"announce":[],"urlList":[]}}