{"title":"I Kill It TS 8 XXX 2014 (Trans500 Studios) WEB-DL","uid":12239604,"size":3419587610,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:91a3ffca6779d09eeae6c7ef4bb61f807b384fa2&amp;dn=I+Kill+It+TS+8+XXX+2014+%28Trans500+Studios%29+WEB-DL&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Ctrlme","files":4,"time":1439740851,"description":"I Kill It TS 8 XXX 2014 (Trans500 Studios) WEB-DL\n\nScreenshot(s): &lt;a href=&quot;\nhttp://imgctrl.com/image/NZU&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgctrl.com/image/NZU&lt;/a&gt;\n &lt;a href=&quot;\nhttp://imgctrl.com/image/NZg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgctrl.com/image/NZg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://imgctrl.com/image/NZj&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgctrl.com/image/NZj&lt;/a&gt;\n\nDescription:The eighth film in the I Kill It TS series begins with Castro Supreme and Ramon plotting to get some pussy on Halloween. They dress up in a most respectable banana and monkey suit. Their first stop: Vaniity's place. Vaniity is dressed in a super cute and colorful skirt with knee high socks and a not so veiling red g-string. Vaniity starts by blowing them both at the same time and them doing a bit of face fucking. Then Castro starts fucking her doggy style while she blows Ramon and then Castro fucks her from behind while laying side by side. Ramon removes himself from the picture for a bit and Castro keeps fucking her on her side while he's standing. Next, it switches to Vaniity riding Ramon's cock reverse cowgirl while she's blowing Castro. Her uncut cock bouncing around is sexy as hell. Then Ramon fucks her on her side from behind while she blows Castro and then while she's on her back. They close the scene by first Ramon giving her a massive facial, then her jerking until she cums and then Castro Supreme giving her a facial. The next scene begins with Ariel Everts and Ramon outside the Luxor in Las Vegas. Ariel is in a black top and jeans. The scene quickly switches to them in a room together and Ariel downing Ramon's massive cock. After Ramon sizes up her ass a bit, she hops on his dick cowgirl and starts riding it. Then she flips around reverse cowgirl while holding her cock. After a bit, they switch to laying side by side on the couch while Ramon fucks her and then doggy stye and on her back. Ramon finishes by cumming on her cock and then Ariel strokes herself to completion. Following Ariel is Agatha McCartney she's dressed in some sexy black and red lingerie. After a bit of chatting she dives right in on the cock, giving him a really nice blowjob. After a bit, she hops on his cock reverse cowgirl with a raging boner she strokes a little while facing the camera. After a bit, they switch to cowgirl and then side by side with Ramon coming in from behind. Ramon switches to fucking her on top while she's on her back while she strokes herself and they both come at the same time, with Ramon cumming all over her tits. Busty blonde Jessica in a bright red top opens the next scene. The top is quickly removed though and we next see her massaging and playing with her tits which are much more natural looking than most. Ramon steps in and plays with her a bit and then she goes down on him. After a bit of head, Jessica takes him in doggy style and then she rides him reverse cowgirl and then takes him in while she lays on her side and strokes herself. Then it switches to her riding him reverse cowgirl and she comes shortly after. After a bit more riding, Ramon finishes by cumming on her tits. The closing scene is with sexy Asian Sami who is in a striped black and white top, short shorts and hoop earrings. They're quickly removed though and she shows off her body and her cute natural chest to open the scene. After a bit, Ramon steps in and she begins blowing him on a couch. After the warm up, it switches to Ramon fucking her doggy style, then to her riding him reverse cowgirl while she whimpers and moans she flips around cowgirl style and then they switch to fucking side by side. Ramon finishes with a huge facial and a smile.\n\nLength:1:56:10\n\nScene 1: Vaniity\nScene 2: Ariel Everts\nScene 3: Agatha McCartney\nScene 4: Jessica\nScene 5: Sami\n\nâ˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…\n\n               If you like this torrent, please post a comment!\n            \n                            Don't forget to seed!\n\nâ˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…\n &lt;a href=&quot;\nhttps://pirates-forum.org/User-Ctrlme&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://pirates-forum.org/User-Ctrlme&lt;/a&gt;\n &lt;a href=&quot;\nhttps://thepiratebay.vg/user/Ctrlme/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://thepiratebay.vg/user/Ctrlme/&lt;/a&gt;","torrent":{"xt":"urn:btih:91a3ffca6779d09eeae6c7ef4bb61f807b384fa2","amp;dn":"I+Kill+It+TS+8+XXX+2014+%28Trans500+Studios%29+WEB-DL","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"91a3ffca6779d09eeae6c7ef4bb61f807b384fa2","infoHashBuffer":{"type":"Buffer","data":[145,163,255,202,103,121,208,158,234,230,199,239,75,182,31,128,123,56,79,162]},"announce":[],"urlList":[]}}