{"title":"Edward Hopper (Abrams Art Ebook).pdf","uid":12181921,"size":9108258,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:92c0454193352ce4a699bff2b551250a69f71900&amp;dn=Edward+Hopper+%28Abrams+Art+Ebook%29.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"STBGD","files":1,"time":1438466807,"description":"HN Abrams / 1976 / Pdf / English / ISBN10 0810910616 / 158 pag / 8.68 MB\n\nEdward Hopper has left a legacy of work that is once familiar and elusive in the American consciousness. This monograph examines Hopper's world on canvas by placing his work within the context of the changes brought about by America's history and technology. From silent urban scenes to countryside vistas, particular attention is paid to the introduction of the automobile into American life, as well as such modern surroundings as fluorescent lighting, diners, and rail travel, all of which lent unique subject matter to Hopper's paintings. The text provides a comprehensive look at artist's life and includes a bibliography and chronology.\n\nThe author, Lloyd Goodrich (1897-1987) was director of the Whitney Museum in New York and a leading author and advocate of American art for more than a half century.\n\nThe bequest of the Edward Hopper collection, by Hopper's widow Josephine, in 1968, also resulted from Mr. Goodrich's reputation as the leading scholar and friend of Edward Hopper. Today, the collection of some 2,000 works by Hopper is a major strength of the museum, and makes it the world's major center for st dy of the artist.\n\nAs the director of the Whitney Museum, from 1958 to 1968, Mr. Goodrich guided its transition from an essentially private institution to a public one, broadening its governing board beyond the family of Gertrude Vanderbilt Whitney, who founded the museum in 1930, to include many individuals and arts patrons from New York society. He also presided over construction of the museum's present quarters, at Madison Avenue and 75th Street, a controversial but generally popular building designed in distinctive minimalist style by the architect Marcel Breuer in 1966. Changed View of American Art.\n\nAmazon","torrent":{"xt":"urn:btih:92c0454193352ce4a699bff2b551250a69f71900","amp;dn":"Edward+Hopper+%28Abrams+Art+Ebook%29.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"92c0454193352ce4a699bff2b551250a69f71900","infoHashBuffer":{"type":"Buffer","data":[146,192,69,65,147,53,44,228,166,153,191,242,181,81,37,10,105,247,25,0]},"announce":[],"urlList":[]}}