{"title":"John Harris The Dark Side of the Moon The Making of the Pink Flo","uid":12170353,"size":3941833,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:944ed30b09ac7231a3281fe06afdcace4abb9079&amp;dn=John+Harris+The+Dark+Side+of+the+Moon+The+Making+of+the+Pink+Flo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Hand_of_Doom","files":3,"time":1438157962,"description":"Pink Floyd's The Dark Side of the Moon (1973) is one of the most acclaimed albums of all time. A stunning exploration of madness, death, anxiety, and alienation, it remained on the Billboard charts for 724 weeks--the longest consecutive run for an LP ever--and has sold 30 million copies worldwide. It still sells some quarter million copies every year. Besides being perhaps rock's most fully realized and elegant concept album, The Dark Side of the Moon was among the most technically advanced records of its time, perfectly blending studio wizardry and fearless innovation. The rich story behind The Dark Side of the Moon is now skillfully illuminated by acclaimed journalist John Harris's exploration of the album's many secrets and the band's fractured history, including the mental collapse of group founder Syd Barrett. Drawing on original interviews with bassist and chief lyricist Roger Waters, guitarist Dave Gilmour, drummer Nick Mason, keyboardist Richard Wright, and the album's supporting cast, The Dark Side of the Moon is a must-have for the millions of devoted fans looking for the definitive story of one of the most timeless, compelling, and mysterious albums ever made","torrent":{"xt":"urn:btih:944ed30b09ac7231a3281fe06afdcace4abb9079","amp;dn":"John+Harris+The+Dark+Side+of+the+Moon+The+Making+of+the+Pink+Flo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"944ed30b09ac7231a3281fe06afdcace4abb9079","infoHashBuffer":{"type":"Buffer","data":[148,78,211,11,9,172,114,49,163,40,31,224,106,253,202,206,74,187,144,121]},"announce":[],"urlList":[]}}