{"title":"Unraveling Thermoluminescence [2015] [PDF]","uid":12116525,"size":5216344,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:95da7ffc18b95a6bb60c3a5b0a9ab8a1bb23e858&amp;dn=Unraveling+Thermoluminescence+%5B2015%5D+%5BPDF%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"NoctDeath","files":3,"time":1436728727,"description":"Title: Unraveling Thermoluminescence \nSeries: Springer Series in Materials Science (Book 202) \nAuthor: C M Sunta \nFormat: PDF \nHardcover: 188 pages \nPublisher: Springer; 2015 edition (July 15, 2014) \nLanguage: English \nISBN: 978-8132219392 \n\n\nThe book is essentially about the theoretical aspects of thermoluminescence (TL). It is structured and written in a manner which will specially be of interest to the fresh undergraduate students and young researchers planning to take up work in the field of thermoluminescence. It is arranged into seven chapters, starting with the historical growth of the subject of TL and an overview of the luminescence phenomena. A Physical model involving thermally disconnected deep traps is specially described. Using this model expressions are derived for the TL intensity growth curve, the supralinearity factor and the pre-dose sensitization factor. A new factor, called the sensitization factor is introduced which co-relates the supralinearity and the pre-dose sensitization factors. Dealing with the theoretical models of TL, limitations of the general order (GO) kinetics and the mixed order kinetics models are specially brought out. Due to the lacunae of GO model the determination of activation energy becomes subject to error, when GO model is applied to the experimental TL glow curves. Satisfying the quasi-equilibrium (QE) condition is essential for the validity of analytical models of TL. A new method is given to ascertain if QE condition is satisfied in an experimental glow curve. The book assumes a basic knowledge of physics and mathematics at an undergraduate level and takes the reader to the results at the cutting edge of understanding of the subject in an easy to understand manner","torrent":{"xt":"urn:btih:95da7ffc18b95a6bb60c3a5b0a9ab8a1bb23e858","amp;dn":"Unraveling+Thermoluminescence+%5B2015%5D+%5BPDF%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"95da7ffc18b95a6bb60c3a5b0a9ab8a1bb23e858","infoHashBuffer":{"type":"Buffer","data":[149,218,127,252,24,185,90,107,182,12,58,91,10,154,184,161,187,35,232,88]},"announce":[],"urlList":[]}}