{"title":"Chanel Preston_Anal Fanatic 2 XXX DVDRip 07 30 2015 Mylove mkv ","uid":12176722,"size":428472911,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:968ff51f2eff27219a076f6dac48df783b6d90f7&amp;dn=+Chanel+Preston_Anal+Fanatic+2+XXX+DVDRip+07+30+2015+Mylove+mkv+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Chinu685","files":1,"time":1438328791,"description":"Director: Mick Blue (as Grazer)\nStarring: Chanel Preston, Mick Blue\n\n\n\nDescription: Our next scene takes us outside right next to the pool with water spouts shooting the liquid high into the air. We do not have to look hard to find Chanel who is the center of attention fairly quickly. Nice lavender colored bikini and we do not have to wait long before the zoom in shots capture that fine ass. The good shots keep cumming as Miss Preston loses the top allowing us a full on shot of her boobs, nice hard nipples. Looks like Chanel will make use a glass toy as well to ready her butt but not before sucking on it a bit and then slipping it inside her tush. The close shots were nice and continue when we take the action inside, Chanel making good use of the toy and she pipes in with some dirty talk, the first of the dvd. Mick then joins and gets a great birds eye view from above looking down on Chanel's ass. Mick replaces the toy with his tongue and I'm all for watching some ass licking more so with g / g but Mick's good with the oral pleasing whether it's to her ass or to her pussy so I'm down with that too. Mick then pushes her legs back nearly to Chanel's head as he goes back in for more plus we get some strong fingering action, I think Chanel liked this judging from her vocal work. Mick keeps this up even as Chanel's working his cock out, bending down we get a full front shot of her face as she engulfs him. We bypass the pussy altogether here as Mick goes right to nailing Chanel's ass doggiestyle. There is some good face fucking A2M too from Chanel here. Some more more anal pounding and it's time to unload, a good facial for Chanel who is doing better and better in her anal scenes.\n\n\n\nReleased: 2011\nIssued: USA / Elegant Angel\nDuration: 00:32:02\nLanguage: English\nGenre: Gonzo, Anal, Straight, Blowjob, Oral, Facial, Toys\n &lt;a href=&quot;\nhttp://teenimage.org/img-55bb0bbf29e01.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://teenimage.org/img-55bb0bbf29e01.html&lt;/a&gt;\n &lt;a href=&quot;\nhttp://teenimage.org/img-55bb0bf73e87d.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://teenimage.org/img-55bb0bf73e87d.html&lt;/a&gt;","torrent":{"xt":"urn:btih:968ff51f2eff27219a076f6dac48df783b6d90f7","amp;dn":"+Chanel+Preston_Anal+Fanatic+2+XXX+DVDRip+07+30+2015+Mylove+mkv+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"968ff51f2eff27219a076f6dac48df783b6d90f7","infoHashBuffer":{"type":"Buffer","data":[150,143,245,31,46,255,39,33,154,7,111,109,172,72,223,120,59,109,144,247]},"announce":[],"urlList":[]}}