{"title":"Atomix Virtual DJ Pro v8.0.2094","uid":12126474,"size":42462035,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:971adf6c0c916033907d29a6095993cdb596feaf&amp;dn=Atomix+Virtual+DJ+Pro+v8.0.2094&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":3,"time":1436932988,"description":"Atomix Productions is the leading company on the Digital DJing market.\nIts main software, VirtualDJ, has been downloaded more than 150,000,000 times, \nand is currently being used by more than 6 million different people EVERY DAY.\nIt is incontestably the most used DJ software on the planet, by far.\n\n\n The company\n\nEstablished since 1996, Atomix Productions started as a French startup, and helped create and then grow the then-niche market of Digital DJing.\nWith advanced technology that was new and ground-breaking at the time, such as automatic beatmatching, seamless loops, etc, VirtualDJ helped the earlier generation of Digital DJs to mix faster and better, and ushered in the new era of Digital DJing, which finally became the de-facto norm of DJing nowadays.\nToday, Atomix Productions has offices all over the world, from United States to Ukraine to China, and employees and freelancers in more than 12 different countries.\nIts software is now bundled with controllers from almost all the DJ equipment manufacturers in the world, such as Pioneer, Numark, Hercules, Gemini, American Audio, Vestax, etc...\nAnd it has been endorsed in marketing operations by super stars like Carl Cox or Tiesto.\n\n\n The vision\n\nAtomix Productions' philosophy has always been to use ground-breaking technology to help bring DJing to the masses by reducing the costs and accessibility, and to use this technology to help DJs mix better.\nWe believe that nobody cares if you know how to beatmatch tracks in 1 second or 1 minute, that is not what makes you a better DJ. What you play and how you play it, does. Based on that, we focus on bringing out technological tools that help the DJs focus on the artistic part of their skills, and relegate the technical side to the machine.\nUnlike some of our competitors, our goal is not only to preserve the legacy of the DJing culture, and we are not afraid to break the rules and do things differently, if we feel it would improve the performances in the long run.\nWe have often been criticized by the DJ establishment because of this. Nobody likes to be told that what you spent years of your life learning, is becoming obsolete. Nobody likes to see that a young kid who started to mix a few months ago can outperform your years of experience.\nBut history have shown again and again that every change we implemented, no matter how frowned upon at the beginning, always ended up becoming the norm a few years later.\n\n\n The team\n\nAtomix Productions was founded by visionary businessman and software developer Stephane Clavel. Mr Clavel is still today the owner and CEO of the company, and still actively writes code for VirtualDJ, switching hats between mad coder and successful businessman, and liking both with the same passion (and success).\nHe's assisted on the business side by Mr Andrew Van Almen, COO of the company, who supervises the rest of the team and handles the day to day operations, and business development. Mr Van Almen has been working in the field for more than 15 years, and was previously General Manager at PCDJ, another smaller DJ software company.\nAnd on the coding side, Mr Clavel is assisted by Mr Gwen Roelants, Atomix' lead developer. Mr Roelants also used to code DJ software for many years, and prior to joining Atomix Productions was the owner and creator of the DJ software &quot;DJDecks&quot;.\nAlongside them, a dedicated and highly competent team of devoted employees help keep the company moving forward.\nAnd all of them agree to say that working for Atomix Productions is not a job. It's a passion","torrent":{"xt":"urn:btih:971adf6c0c916033907d29a6095993cdb596feaf","amp;dn":"Atomix+Virtual+DJ+Pro+v8.0.2094","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"971adf6c0c916033907d29a6095993cdb596feaf","infoHashBuffer":{"type":"Buffer","data":[151,26,223,108,12,145,96,51,144,125,41,166,9,89,147,205,181,150,254,175]},"announce":[],"urlList":[]}}