{"title":"Elasticsearch Blueprints ","uid":12211961,"size":11369065,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:976efc075a1d07a4cea75894ef105e61f98ef3eb&amp;dn=Elasticsearch+Blueprints+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Jenson100","files":3,"time":1439115452,"description":"About This Book\n\n    Discover the power of Elasticsearch by implementing it in a variety of real-world scenarios such as restaurant and e-commerce search\n    Discover how the features you see in an average Google search can be achieved using Elasticsearch\n    Learn how to not only generate accurate search results, but also improve the quality of searches for relevant results\n\nWho This Book Is For\n\nIf you are a data enthusiast and would like to explore and specialize on search technologies based on Elasticsearch, this is the right book for you. A compelling case-to-case mapping of features and implementation of Elasticsearch to solve many real-world use cases makes this book the right choice to start and specialize on Elasticsearch.\nWhat You Will Learn\n\n    Build a simple scalable server for effective searching in Elasticsearch\n    Design a scalable e-commerce search solution to generate accurate search results using various filters such as filters based on date range and price range\n    Improve the relevancy and scoring of your searches\n    Manage real-world, complex data using various techniques, including parent-child search and searching questions based on the criteria of questions and answers\n    Use the excellent data crunching and aggregation capability of Elasticsearch to analyze your data\n    Generate real-time visualizations of your data using compelling visualization techniques, such as time graphs, pie charts, and stacked graphs\n    Enhance the quality of your search and widen the scope of matches using various analyzer techniques, such as lower casing, stemming, and synonym matching\n\nIn Detail\n\nElasticsearch is a distributed search server similar to Apache Solr with a focus on large datasets, schemaless setup, and high availability. Utilizing the Apache Lucene library (also used in Apache Solr), Elasticsearch enables powerful full-text search, as well as autocomplete &quot;morelikethis&quot; search, multilingual functionality, and an extensive search query DSL.\n\nThis book starts with the creation of a Google-like web search service, enabling you to generate your own search results. You will then learn how an e-commerce website can be built using Elasticsearch. We will discuss various approaches in getting relevant content up the results, such as relevancy based on how well a query matched the text, time-based recent documents, geographically nearer items, and other frequently used approaches.\n\nFinally, the book will cover various geocapabilities of Elasticsearch to make your searches similar to real-world scenarios.\n\n\n\nPaperback: 183 pages\nPublisher: Packt Publishing - ebooks Account (December 31, 2015)\nLanguage: English\nISBN-10: 1783984929\nISBN-13: 978-1783984923","torrent":{"xt":"urn:btih:976efc075a1d07a4cea75894ef105e61f98ef3eb","amp;dn":"Elasticsearch+Blueprints+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"976efc075a1d07a4cea75894ef105e61f98ef3eb","infoHashBuffer":{"type":"Buffer","data":[151,110,252,7,90,29,7,164,206,167,88,148,239,16,94,97,249,142,243,235]},"announce":[],"urlList":[]}}