{"title":"Karina Terebun","uid":12172427,"size":89959047,"categoryP":"other","categoryS":"pictures","magnet":"?xt=urn:btih:998244350f792e93d01631656e5bf553e17b49eb&amp;dn=Karina+Terebun&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":12,"time":1438252900,"description":"Karina Terebun is being Stalked!\n\nBenjamin Parrish Cook has been harassing Karina and threatening her and her new website for several months now.\n\nBenjamin Parrish Cook photographed her over the summer by promising her riches which never materialized.\n\nBenjamin Parrish Cook does not have the model Karina's permission, her mother's permission, or a Minor Model Release form. Therefore he cannot commercially exploit Karina. This means her cannot post her pictures or any other work. He cannot sell her work. And any attempt to do so is illegal!\n\nSince Karina told Benjamin Parrish Cook to leave her alone, he has continually written to her, told her she would get in big trouble; that her website would be shutdown and that her friends are misleading her. All of which are untrue. He has bashed the name of her mom. And he continues to do everything possible to destroy her website.\nAnd so many other disgusting things towards Karina that I simply do not have time to write about.\n\nBenjamin Parrish Cook , through coercion and pressure, and relentless pursuit, convinced Karina that he was the only one in the world that could get her the money she needs for her University Studies. Thankfully, Karina now knows better. When he finally did offer her money for her work, he offered about $250 per month, which obviously will not pay for her college.\n\nKarina has deleted his friendship fromBlacklisted him and he still pursues her.\n\nIs there anyone out there that can convince this Mr. Benjamin Parrish Cook to leave Karina Terebun alone?????","torrent":{"xt":"urn:btih:998244350f792e93d01631656e5bf553e17b49eb","amp;dn":"Karina+Terebun","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"998244350f792e93d01631656e5bf553e17b49eb","infoHashBuffer":{"type":"Buffer","data":[153,130,68,53,15,121,46,147,208,22,49,101,110,91,245,83,225,123,73,235]},"announce":[],"urlList":[]}}