{"title":"[MommysGirl] Aug , 2015 - Cherie DeVille , Samantha Rone - You T","uid":12265960,"size":356909552,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:99ab0b280592c36846349d58e29d2124b0d38c7d&amp;dn=%5BMommysGirl%5D+Aug+%2C+2015+-+Cherie+DeVille+%2C+Samantha+Rone+-+You+T&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"pornboy89","files":1,"time":1440234767,"description":"[MommysGirl] Aug , 2015 - Cherie DeVille &amp; Samantha Rone - You Tricked Me, Part One - 400p\n\n...:::ScreenShots:::...\n &lt;a href=&quot;\nhttp://imgnemo.com/?v=879477&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgnemo.com/?v=879477&lt;/a&gt;\n &lt;a href=&quot;\nhttp://imgnemo.com/?g=492851&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgnemo.com/?g=492851&lt;/a&gt;\n\nDescription:\n\nSpending the weekend at the in -laws, Samantha Rone gets a call from her friend Tara. Samantha is so relieved she has someone to talk to about how weirded out she is with her step mother Cherie Deville. Samantha elaborates on how Cherie looks at her, touches her, and just last night she put her foot right between her legs at the dinner table! What kind of behavior was that from a mother in law anyway?!? Even though this was one awkward situation, Samantha looks at the glass half full, saying how her husband was leaving her teasing letters around the house making her horny as hell, but couldn't have sex because the in-laws were always around. She couldn't wait to fuck his brains out, but it wasn't going to be today, nor was it going to be her husband either!\n\nCherie walks into the kitchen like a ninja, wearing a very revealing hot pink lingerie. She sneaks up behind Samantha, spanking her on her ass. Samantha stands straight up, demanding what the hell was going on, and whatever was going on in Cherie's head was not going to happen. Samantha was married to her son! But Cherie was not going to give up her pursuit for Samantha's body. Cherie seemed to be convincing, assuring her all she needed was one day and her life would change forever. Luring her in with seduction and persistence, Samantha caves in allowing Cherie to taste her daughter in laws lips and tongue. It didn't last long though as Samantha came back to reality, leaving Cherie high and dry.\n\nA few days pass, and things seem to be back to normal until one early morning, Samantha sees a note on the computer saying ' Go Upstairs'.Thinking this was a surprise her husband left her, she quickly runs up the stairway to find another note reading 'Put me on'. Thrilled to open a gift bag with sparking red high heels and matching lingerie, Samantha undressed quickly, eager to finally have some alone time with him. She sits on the bed, wearing a blindfold to amplify the occasion. But Samantha didn't know who was behind her, and that person was her mother in law....What will Samantha do once she finds out whose been touching her all along? Will be go with it or will she use this against the persistent mother in law for blackmail? Watch and find out today! \n\nThe scene includes some great lesbian action like, kissing, fingering, f2f cunnilingus and even some squirting from Samantha. Enjoy!","torrent":{"xt":"urn:btih:99ab0b280592c36846349d58e29d2124b0d38c7d","amp;dn":"%5BMommysGirl%5D+Aug+%2C+2015+-+Cherie+DeVille+%2C+Samantha+Rone+-+You+T","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"99ab0b280592c36846349d58e29d2124b0d38c7d","infoHashBuffer":{"type":"Buffer","data":[153,171,11,40,5,146,195,104,70,52,157,88,226,157,33,36,176,211,140,125]},"announce":[],"urlList":[]}}