{"title":"Strokes of Genius 3 (ePUB,Retail){23Skulls}","uid":11095753,"size":7750213,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9a1d1e809ad234dbf85af5302f61ca9ba70a87dc&amp;dn=Strokes+of+Genius+3+%28ePUB%2CRetail%29%7B23Skulls%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"32Skulls","files":-1,"time":1411593619,"description":"                      â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ \n\n\nDrawing is the connection between eye, heart and hand. -Linda Wesner Drawing is a fundamental skill for artists in any medium, a wonderfully direct means of expression and the driving inspiration behind this provoking collection. Strokes of Genius 3 celebrates drawing as an art form in its own right, featuring work from 95 of today's brightest artists. In this brilliant collection of drawings, 95 contemporary artists explore the subjects that touch their hearts and discuss how they capture them in their medium of choice. In addition to traditional pencil, charcoal and ink, you'll find a number of scratchboard, colored pencil and mixed-media works. Subject matter ranges from timeworn city architecture to portraits of beloved dogs, including such perennial favorites as landscapes, harbor scenes, flowers, still life, the human figure and more. . 140 world-class drawings, from simple, direct sketches to meticulously layered works of art selected from thousands of submissions . Exciting mix of styles, mediums and techniques, presented in subject-specific chapters: Town County, Portraits, Pets, Still Life, The Human Figure and Wildlife . Artists' commentary on the concepts and techniques behind each piece To further explore the Fresh Perspectives theme, each featured artist was asked to finish the phrase, Drawing is Their responses, scattered throughout, add yet another dimension to this book: Drawing is a moment of poetry. Drawing is to art what physics is to science. Drawing is art stripped to its bare bones. Above all, it is the art itself that will cause you to keep this volume handy on the coffee table or bookshelf for when you want to curl up, look at the world through these artists' eyes, and come away with a more vivid sense of what drawing is-or can be-to you. Whether you are an artist in search of fresh inspiration or a connoisseur fascinated by great artwork and the processes behind it, Strokes of Genius 3 promises many pleasurable hours of browsing, appreciation and discovery.\n\n\nBy Rachel Rubin Wolf\nPublished by North Light Books in 2011\nEPUB, Retail, 144 pages, English","torrent":{"xt":"urn:btih:9a1d1e809ad234dbf85af5302f61ca9ba70a87dc","amp;dn":"Strokes+of+Genius+3+%28ePUB%2CRetail%29%7B23Skulls%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9a1d1e809ad234dbf85af5302f61ca9ba70a87dc","infoHashBuffer":{"type":"Buffer","data":[154,29,30,128,154,210,52,219,248,90,245,48,47,97,202,155,167,10,135,220]},"announce":[],"urlList":[]}}