{"title":"[NEWEST] The Forest WITH CRACK","uid":12118247,"size":671105596,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:9a89082461a89d7d41be39ebc0376fe341987f10&amp;dn=%5BNEWEST%5D+The+Forest+WITH+CRACK&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"eHate09","files":1,"time":1436775346,"description":"Hey everyone! \n\nI LOVE all of you and all of the torrents you all so kindly provide that I thought I'd give back to the community a little bit by giving my cracked version of The Forest out for everyone to have for free. While most torrented games do not allow you to play multiplayer for some reason this one does. \n\nI honestly have no idea why, maybe it's just the current build of The Forest but I've tested this on 3 different PC's and every single one lets me join my multiplayer server.\n\nSo enjoy this free cracked version of The Forest and I seriously beg of you.. like I'm on my knees right now offering a blowjob to everyone who seeds!\n\nPLEASE SEED! Even if it's only for one day, let's get this game out to everyone so we can support it and have fun doing it! \n\nThanks and be sure to read the readme.txt for detailed instructions on installation, but in case you're lazy here they are:\n\n1. Unpack the .rar to your desktop.\n2. Run the crack. If you're on Windows 7 using .NET framework 4.0 or highter or windows 8 you WILL get a warning about the program not working, but do NOT WORRY it IS WORKING.\n3. Enjoy the free game and fuck around with your friends!\n4. SEED THE FUCK OUT OF THIS PLEASE TO REDEEM YOUR FREE BLOWJOB!\n\nThanks again!\neHate","torrent":{"xt":"urn:btih:9a89082461a89d7d41be39ebc0376fe341987f10","amp;dn":"%5BNEWEST%5D+The+Forest+WITH+CRACK","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9a89082461a89d7d41be39ebc0376fe341987f10","infoHashBuffer":{"type":"Buffer","data":[154,137,8,36,97,168,157,125,65,190,57,235,192,55,111,227,65,152,127,16]},"announce":[],"urlList":[]}}