{"title":"Wolf Hall S01E06 - Masters of Phantoms HDTV x264 - GHOST DOG","uid":12139948,"size":345672808,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:9ad30d411eb3d96b7600bd373d938847cb704cb7&amp;dn=Wolf+Hall+S01E06+-+Masters+of+Phantoms+HDTV+x264+-+GHOST+DOG&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"marxph","files":2,"time":1437325768,"description":"Historical drama chronicling the rise of Thomas Cromwell, the son of a humble blacksmith who became King Henry VIII's chief minister, as he navigated the corridors of power in the Tudor court.\n\nEpisode 6 of 6: Masters of Phantoms\n\nAnne accuses Cromwell of betrayal when she finds out he tried to protect Mary and not Elizabeth at a time of crisis. But Anne's power is dissolving rapidly and her enemies are gathering.\n\nAnne argues with Jane Rochford but in her anger Anne divulges that the musician Mark Smeaton and the nobles Francis Weston and Harry Norris have all declared their love to her, a treasonable offence.\n\nJane Rochford takes great pleasure in reporting these events to Cromwell. She further insinuates that her husband George Boleyn's unhealthy sexual appetite extends to his sister. Cromwell is dumbfounded by such accusations, but brings Mark Smeaton in for questioning. Smeaton foolishly boasts of his own exploits with the Queen, and under duress starts to spill other names including Norris, Weston and William Brereton. Cromwell now has enough information to act and these men together with Anne and George Boleyn are brought to the Tower of London.\n\nAs Cromwell visits each gentleman in his cell, he thinks back to Cardinal Wolsey's demise and remembers how each of Norris, Weston, Brereton and George Boleyn had cruelly mocked his master. Cromwell has exacted the ultimate revenge.\n\nAnne is also found guilty and sentenced to death. But with so many heads removed, who now stands between Cromwell and the King?\n\n===================================================================================\nSource.......: HDTV\nSize.........: 329MB\nFormat.......: mp4\nResolution...: 640x360\nVideo........: h.264, 703Kbps @ 25 fps\nAudio........: aac, 93Kbps, 48 KHz, 2 channels\n===================================================================================\n\nghost dog","torrent":{"xt":"urn:btih:9ad30d411eb3d96b7600bd373d938847cb704cb7","amp;dn":"Wolf+Hall+S01E06+-+Masters+of+Phantoms+HDTV+x264+-+GHOST+DOG","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9ad30d411eb3d96b7600bd373d938847cb704cb7","infoHashBuffer":{"type":"Buffer","data":[154,211,13,65,30,179,217,107,118,0,189,55,61,147,136,71,203,112,76,183]},"announce":[],"urlList":[]}}