{"title":"Wolf Hall S01E02 - Entirely Beloved HDTV x264 - GHOST DOG","uid":12139844,"size":350107318,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:9b37c5b1d5192b2193e052554dbe094169242007&amp;dn=Wolf+Hall+S01E02+-+Entirely+Beloved+HDTV+x264+-+GHOST+DOG&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"marxph","files":2,"time":1437325170,"description":"Historical drama chronicling the rise of Thomas Cromwell, the son of a humble blacksmith who became King Henry VIII's chief minister, as he navigated the corridors of power in the Tudor court.\n\nEpisode 2 of 6: Entirely Beloved\n\nCardinal Wolsey has been forced out of court to travel north to his archdiocese in York. For Thomas Cromwell, this is only a tactical retreat; in time the cardinal will regain the King's favour. Wolsey urges Cromwell to find a way to get close to Anne Boleyn for she is the key to persuading the King to restore him.\n\nCromwell visits Thomas More and his family at their home in Chelsea. More is amiable but the atmosphere is tense. He is determined to clamp down on heresy and is convinced that Cromwell has Protestant leanings.\n\nAnne Boleyn summons Cromwell, wanting to know if she has an ally in him. She is aware of letters sent between Queen Katherine and the cardinal which are tantamount to treason and is becoming impatient waiting for Henry. Cromwell observes her taking her frustration out on her ladies-in-waiting, including young Jane Seymour who Cromwell takes pity on.\n\nThe King starts to take notice of Cromwell. Henry admires his loyalty to the cardinal and appreciates the honest and open way Cromwell talks to him. An intimacy develops and Henry comes to rely on Cromwell's advice.\n\nThere is then news from the north. The cardinal is arrested for treason by Harry Percy, a vengeful act for denying his betrothal to Anne Boleyn eight years earlier. The cardinal's health deteriorates rapidly and he dies on the journey south to the Tower of London.\n\nAt court, a party is held to mark the demise of the Cardinal. Cromwell closely watches those that celebrate Wolsey's death and as Cromwell is sworn in to the King's Council, he swears vengeance on those that brought the cardinal down.\n\n===================================================================================\nSource.......: HDTV\nSize.........: 333MB\nFormat.......: mp4\nResolution...: 640x360\nVideo........: h.264, 703Kbps @ 25 fps\nAudio........: aac, 93Kbps, 48 KHz, 2 channels\n===================================================================================\n\nghost dog","torrent":{"xt":"urn:btih:9b37c5b1d5192b2193e052554dbe094169242007","amp;dn":"Wolf+Hall+S01E02+-+Entirely+Beloved+HDTV+x264+-+GHOST+DOG","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9b37c5b1d5192b2193e052554dbe094169242007","infoHashBuffer":{"type":"Buffer","data":[155,55,197,177,213,25,43,33,147,224,82,85,77,190,9,65,105,36,32,7]},"announce":[],"urlList":[]}}