{"title":"Lion.Man.One.World.African.Safari.S01E06.720p.HDTV.x264-CBFM.mkv","uid":12205130,"size":668867174,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:9b7129b974820b6a26f7198e3fbd32233c391012&amp;dn=Lion.Man.One.World.African.Safari.S01E06.720p.HDTV.x264-CBFM.mkv&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":1,"time":1438925707,"description":"Lion.Man.One.World.African.Safari.S01E06.720p.HDTV.x264-CBFM.mkv\n\n\nThe Lion Man is a New Zealand television documentary series about a New Zealand big cat park called Zion Wildlife Gardens. The series was named after Craig Busch, the park's founder, who had styled himself as &quot;the Lion Man&quot;. The series followed Busch and the park's employees as they managed the park and its collection of approximately 30 lions and tigers of various species, and other animals. As well as first-hand comment from Busch and his staff, the series was narrated throughout by Paul Casserley in New Zealand and actor Miles Anderson in the United Kingdom.\n\nThe series also showed Busch during related promotional activities as well as his various wildlife missions abroad, including trips to Africa and Thailand. The Lion Man was one of New Zealand's most successful television series, showing in 93 countries worldwide, including Sky1 in the United Kingdom.\n\nThree series were produced, the first of which began screening in New Zealand on 17 June 2004. The first two series were commissioned by state broadcaster TVNZ, but a third series looked in doubt following Busch's conviction in 2007 for assaulting his ex-wife at the park in 2005. Independent funding was found to produce the third series and TVNZ decided to broadcast it after determining that there was still popular demand for the show. The show was produced by Great Southern Television. All three series' music was composed by Peter Blake and the theme tune lyrics written by Bob Smith.\n\nThe show highlighted the activities of the park, including the birth of cubs from different species, and the filming of lions for television adverts and other promotions. As well as its visitor income and these promotions, the series itself became a source of vital funding for the park.\n\nThe Lion Man did broadcast in the United Kingdom on Sky3 (now Pick) but no longer does.\n\n\n\nInfo from Wikipedia\n    &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/The_Lion_Man&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/The_Lion_Man&lt;/a&gt;","torrent":{"xt":"urn:btih:9b7129b974820b6a26f7198e3fbd32233c391012","amp;dn":"Lion.Man.One.World.African.Safari.S01E06.720p.HDTV.x264-CBFM.mkv","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9b7129b974820b6a26f7198e3fbd32233c391012","infoHashBuffer":{"type":"Buffer","data":[155,113,41,185,116,130,11,106,38,247,25,142,63,189,50,35,60,57,16,18]},"announce":[],"urlList":[]}}