{"title":"Herbie Hancock - Head Hunters (1973) 1999 SACD-DFF","uid":11089217,"size":1759395918,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:9bb0432ac748df0d07e49040b3068b6b439cce96&amp;dn=Herbie+Hancock+-+Head+Hunters+%281973%29+1999+SACD-DFF&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"hal4000","files":-1,"time":1411499221,"description":"Herbert Jeffrey &quot;Herbie&quot; Hancock (born April 12, 1940) is an American pianist, keyboardist, bandleader and composer. As part of Miles Davis's Second Great Quintet, Hancock helped to redefine the role of a jazz rhythm section and was one of the primary architects of the &quot;post-bop&quot; sound. He was one of the first jazz musicians to embrace music synthesizers and funk music (characterized by syncopated drum beats). Hancock's music is often melodic and accessible; he has had many songs &quot;cross over&quot; and achieved success among pop audiences. His music embraces elements of funk and soul while adopting freer stylistic elements from jazz. In his jazz improvisation, he possesses a unique creative blend of jazz, blues, and modern classical music, with harmonic stylings much like the styles of Claude Debussy and Maurice Ravel.\n\nHead Hunters was a pivotal point in Herbie Hancock's career, bringing him into the vanguard of jazz fusion. Hancock had pushed avant-garde boundaries on his own albums and with Miles Davis, but he had never devoted himself to the groove as he did on Head Hunters. Drawing heavily from Sly Stone, Curtis Mayfield, and James Brown, Hancock developed deeply funky, even gritty, rhythms over which he soloed on electric synthesizers, bringing the instrument to the forefront in jazz. It had all of the sensibilities of jazz, particularly in the way it wound off into long improvisations, but its rhythms were firmly planted in funk, soul, and R&amp;B, giving it a mass appeal that made it the biggest-selling jazz album of all time (a record which was later broken). Jazz purists, of course, decried the experiments at the time, but Head Hunters still sounds fresh and vital decades after its initial release, and its genre-bending proved vastly influential on not only jazz, but funk, soul, and hip-hop.\n\nDFF files extracted with Scarletbook\n &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/10942620/Scarletbook-SACD-Extractor&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/10942620/Scarletbook-SACD-Extractor&lt;/a&gt;\n\nfrom the Japanese 1999 SACD.\n\nSACD-ISO-DFF-1Bit-2.8Mhz.","torrent":{"xt":"urn:btih:9bb0432ac748df0d07e49040b3068b6b439cce96","amp;dn":"Herbie+Hancock+-+Head+Hunters+%281973%29+1999+SACD-DFF","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9bb0432ac748df0d07e49040b3068b6b439cce96","infoHashBuffer":{"type":"Buffer","data":[155,176,67,42,199,72,223,13,7,228,144,64,179,6,139,107,67,156,206,150]},"announce":[],"urlList":[]}}