{"title":"Ceramic Materials - Science and Engineering 2nd ed","uid":12126442,"size":42178765,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9bc0433e604790f55d73f3aeb29e009202bc09dd&amp;dn=Ceramic+Materials+-+Science+and+Engineering+2nd+ed&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"clouderone","files":1,"time":1436932835,"description":"Ceramic Materials - Science and Engineering 2nd ed - C. Barry Carter, M. Grant Norton (Springer, 2013).pdf\n\nISBN: 9781461435228\n\nCeramic Materials: Science and Engineering is an up-to-date treatment of ceramic science, engineering, and applications in a single, comprehensive text. Building on a foundation of crystal structures, phase equilibria, defects, and the mechanical properties of ceramic materials, students are shown how these materials are processed for a wide diversity of applications in today's society. Concepts such as how and why ions move, how ceramics interact with light and magnetic fields, and how they respond to temperature changes are discussed in the context of their applications. References to the art and history of ceramics are included throughout the text, and a chapter is devoted to ceramics as gemstones. This course-tested text now includes expanded chapters on the role of ceramics in industry and their impact on the environment as well as a chapter devoted to applications of ceramic materials in clean energy technologies. Also new are expanded sets of text-specific homework problems and other resources for instructors. The revised and updated Second Edition is further enhanced with color illustrations throughout the text","torrent":{"xt":"urn:btih:9bc0433e604790f55d73f3aeb29e009202bc09dd","amp;dn":"Ceramic+Materials+-+Science+and+Engineering+2nd+ed","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9bc0433e604790f55d73f3aeb29e009202bc09dd","infoHashBuffer":{"type":"Buffer","data":[155,192,67,62,96,71,144,245,93,115,243,174,178,158,0,146,2,188,9,221]},"announce":[],"urlList":[]}}