{"title":"Encyclopedia of Atmospheric Sciences - 1st Ed (Vols 1-6) Gooner","uid":12149817,"size":220770647,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9d7d0949488974ef57049be73682c5de02a790bb&amp;dn=Encyclopedia+of+Atmospheric+Sciences+-+1st+Ed+%28Vols+1-6%29+Gooner&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"GoonerTPB","files":1,"time":1437589081,"description":"Publisher: Academic Press; 1 edition (January 6, 2003)\nLanguage: English\nISBN-10: 0122270908\nISBN-13: 978-0122270901\n\nThis authoritative resource covers all aspects of atmospheric sciences-including both theory and applications. Nearly 350 articles and over 1,900 figures and photographs are presented, many in full-color. The Encyclopedia is an ideal resource for academia, government, and industry in the fields of atmospheric, ocean, and environmental sciences. It is written at a level that allows undergraduate students to understand the material, while providing active researchers with the latest information in the field. The Encyclopedia of Atmospheric Sciences has been developed alongside the award-winning Encyclopedia of Ocean Sciences. Together these references provide readers with a comprehensive resource and a link between these two fields.\n\n*Covers all aspects of atmospheric sciences-including both theory and applications\n*Presents nearly 350 articles and over 1,900 figures and photographs\n*Broad-ranging articles include topics such as atmospheric chemistry, biogeochemical cycles, boundary layers, clouds, general circulation, global change, mesoscale meteorology, ozone, radar, satellite remote sensing, and weather prediction.\n*An ideal resource for academia, government, and industry in the fields of atmospheric, ocean, and environmental sciences\n*The Encyclopedia of Atmospheric Sciences was developed alongside the award-winning Encyclopedia of Ocean Sciences; together these references provide readers with a comprehensive resource and a link between these two fields","torrent":{"xt":"urn:btih:9d7d0949488974ef57049be73682c5de02a790bb","amp;dn":"Encyclopedia+of+Atmospheric+Sciences+-+1st+Ed+%28Vols+1-6%29+Gooner","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9d7d0949488974ef57049be73682c5de02a790bb","infoHashBuffer":{"type":"Buffer","data":[157,125,9,73,72,137,116,239,87,4,155,231,54,130,197,222,2,167,144,187]},"announce":[],"urlList":[]}}