{"title":"Engineering and Scientific Computations Using MATLAB®","uid":12182814,"size":18921948,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9d8c7fca357114a4008cbf2a0c710c7335919c10&amp;dn=Engineering+and+Scientific+Computations+Using+MATLAB%26reg%3B&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"clouderone","files":1,"time":1438488127,"description":"Engineering and Scientific Computations Using MATLABÂ® - Sergey E. Lyshevski (Wiley, 2003).pdf\n\nISBN 0471462004\n\nMaster MATLAB(r) step-by-step\nThe MATLAB-- &quot;MATrix LABoratory&quot;--computational environment offers a rich set of capabilities to efficiently solve a variety of complex analysis, simulation, and optimization problems. Flexible, powerful, and relatively easy to use, the MATLAB environment has become a standard cost-effective tool within the engineering, science, and technology communities. Excellent as a self-teaching guide for professionals as well as a textbook for students, Engineering and Scientific Computations Using MATLAB helps you fully understand the MATLAB environment, build your skills, and apply its features to a wide range of applications.\n\nGoing beyond traditional MATLAB user manuals and college texts, Engineering and Scientific Computations Using MATLAB guides you through the most important aspects and basics of MATLAB programming and problem-solving from fundamentals to practice. Augmenting its discussion with a wealth of practical worked-out examples and qualitative illustrations, this book demonstrates MATLAB's capabilities and offers step-by-step instructions on how to apply the theory to a practical real-world problem. In particular, the book features:\n* Coverage of a variety of complex physical and engineering systems described by nonlinear differential equations\n* Detailed application of MATLAB to electromechanical systems\nMATLAB files, scripts, and statements, as well as SIMULINK models which can be easily modified for application-specific problems encountered in practice Readable, user-friendly, and comprehensive in scope this is a welcome introduction to MATLAB for those new to the program and an ideal companion for engineers seeking in-depth mastery of the high-performance MATLAB environment","torrent":{"xt":"urn:btih:9d8c7fca357114a4008cbf2a0c710c7335919c10","amp;dn":"Engineering+and+Scientific+Computations+Using+MATLAB%26reg%3B","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9d8c7fca357114a4008cbf2a0c710c7335919c10","infoHashBuffer":{"type":"Buffer","data":[157,140,127,202,53,113,20,164,0,140,191,42,12,113,12,115,53,145,156,16]},"announce":[],"urlList":[]}}