{"title":"Hidden Secrets - Part 40 - The Hidden Faith of The Founding Fath","uid":12220440,"size":3249158505,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:9e26aeb62cca4cbbbea263297f2291a82f55d607&amp;dn=Hidden+Secrets+-+Part+40+-+The+Hidden+Faith+of+The+Founding+Fath&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"POtHS11","files":66,"time":1439354795,"description":"One of America's most important founders was a man named Charles Thomson, who was said to have been closer to the events and people of the American Revolution than any other man of that era. Thomson was the Congressional secretary from 1774 to 1789, all the way through the Revolution and the establishment of the federal government. He was also the man who made the final decisions for the design of the Great Seal of the United States, which can now be found on the back of America's dollar bill.\n\nAs the new American Republic was being founded, Thomson made a detailed history of the events that took place during the Revolution and of the men who are being celebrated as heroes across the country. Though he was compelled for repeatedly to publish this history, Thomson declined, &quot;No&quot; he said, &quot;I ought not, for I should contradict all the histories of the great events of the Revolution. Let the world admire the supposed wisdom and valor of our great men.&quot; He said, &quot;I shall not undeceive future generations.&quot;\n\nAs a result, Thomson eventually destroyed his manuscript and what may have been the truest account of the American Revolution was lost for all time. It might be said that any serious investigation into America's history should begin with Thomson's story and his decision not to undeceive future generations. What did Thomson mean? What was he hiding? Since we are the future generations, what have we been deceived about?\n\nToday, the founding fathers of America are perhaps the most famous men in the world, for setting forth a new form of government that has been the marvel of the modern age. In the discussion over whether America was founded as a Christian nation, it is important to divide her history. Most agree that the Pilgrims who landed at Plymouth in 1620 were undoubtedly Christians who built their cities and schools based on the teachings of the Bible. Yet 150 years would pass before the United States was founded, as a result of the American Revolution. Because of the Christian influence early on, the Revolutionary philosophies have been embraced in what might be called &quot;Patriotic Christianity.&quot;","torrent":{"xt":"urn:btih:9e26aeb62cca4cbbbea263297f2291a82f55d607","amp;dn":"Hidden+Secrets+-+Part+40+-+The+Hidden+Faith+of+The+Founding+Fath","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9e26aeb62cca4cbbbea263297f2291a82f55d607","infoHashBuffer":{"type":"Buffer","data":[158,38,174,182,44,202,76,187,190,162,99,41,127,34,145,168,47,85,214,7]},"announce":[],"urlList":[]}}