{"title":"Robert Johnson - King of the Delta Blues Singers (flac)","uid":12141220,"size":443661079,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:a0e322677b710b866b3aa6fd317c0c0aeafd5f36&amp;dn=Robert+Johnson+-+King+of+the+Delta+Blues+Singers+%28flac%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Archivist_of_the_Damned","files":63,"time":1437350795,"description":"Robert Johnson &quot;The King of the Delta Blues&quot;  was born in Hazlehurst, Mississippi around 1911, and died outside of Greenwood, Mississippi in 1938.  Johnson has been the subject of a lot of revisionist mythologizing since the late 1960's when acts such as the Rolling Stones, Cream, and Taj Mahal started covering his songs which brought them to a much wider demographic.  \n\nJohnson did not create the Blues, nor was he the first bluesman to be recorded. A lot of hype and sensationalism still unfortunately surrounds the man. Most reasonable people don't believe that he sold his soul to Satan for extraordinary guitar abilities.  He might have started that rumor, or it could have sprung from his competition and he shrewdly manipulated the gossip as free publicity. He was an incredible guitarist, but he wasn't an anachronism that stood out like a sore thumb. Johnson simply absorbed the existing lyrical and instrumental regional strains of the Delta Blues into an innovative rhythmic structure that became the apogee of the genre.  Muddy Waters and Howlin' Wolf were contemporaries of Johnson who were heavily influenced by the style and later electrified it and morphed it into the Chicago Blues. \n\nJohnson was an incredible guitarist whose technical genius of melding alternating rhythmic structures gave the effect of two guitar players to the listener.  He drew upon the existing lyrical tropes of the Delta Blues to create a thought-provoking exploration of depression, lust, and obsession in the human psyche that still rings true today.  \n\nModern listening tastes will probably not immediately fall in love with this music.  The recordings were made in motel rooms and studios that bore little resemblance to their current counterparts. It sometimes takes years for the music to sink in and become a part of you, but it will and it is completely worth it. Enjoy","torrent":{"xt":"urn:btih:a0e322677b710b866b3aa6fd317c0c0aeafd5f36","amp;dn":"Robert+Johnson+-+King+of+the+Delta+Blues+Singers+%28flac%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a0e322677b710b866b3aa6fd317c0c0aeafd5f36","infoHashBuffer":{"type":"Buffer","data":[160,227,34,103,123,113,11,134,107,58,166,253,49,124,12,10,234,253,95,54]},"announce":[],"urlList":[]}}