{"title":"Kai Nielsen - Atheism &amp; Philosophy","uid":11076832,"size":5365518,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a131fbfc74e71dc8010ec729c7bfb03a8ea725b0&amp;dn=Kai+Nielsen+-+Atheism+%26amp%3B+Philosophy&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"philosophi","files":-1,"time":1411341700,"description":"Kai Nielsen - Atheism &amp; Philosophy\n\nThe indeterminacy of the modern concept of God has made the distinction between belief and unbelief increasingly problematic. Both the complexity of the religious response and the variety of skeptical philosophies preclude simplistic definitions of what constitutes belief in God. Making the discussion even more difficult are assertions by fundamentalists who dismiss the philosophical perplexities of religious claims as unreal pseudo-problems.\n\nAtheism &amp; Philosophy is a detailed study of these and other issues vital to our understanding of atheism, agnosticism, and religious belief. Philosopher Kai Nielsen develops a coherent and integrated approach to the discussion of what it means to be an atheist. In chapters such as &quot;How is Atheism to be Characterized?&quot;, &quot;Does God Exist?,&quot; &quot;Agnosticism,&quot; &quot;Religion and Commitment,&quot; and &quot;The Primacy of Philosophical Theology,&quot; Nielsen defends atheism in a way that answers to contemporary concerns.\n\nThis paperback edition features a new preface in which Nielsen, showing the increasing influence of the later Ludwig Wittgenstein, Donald Davidson, the classical pragmatists, and such neopragmatists as Richard Rorty and Hilary Putnam, defends his account against some persistent and plausible criticisms, particularly against his skeptical arguments concerning the coherence and intelligibility of belief in God.","torrent":{"xt":"urn:btih:a131fbfc74e71dc8010ec729c7bfb03a8ea725b0","amp;dn":"Kai+Nielsen+-+Atheism+%26amp%3B+Philosophy","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a131fbfc74e71dc8010ec729c7bfb03a8ea725b0","infoHashBuffer":{"type":"Buffer","data":[161,49,251,252,116,231,29,200,1,14,199,41,199,191,176,58,142,167,37,176]},"announce":[],"urlList":[]}}