{"title":"Time of Nagual","uid":11084422,"size":22203881,"categoryP":"applications","categoryS":"android","magnet":"?xt=urn:btih:a324ce3d7f8a263910a9da1a38c261686ad6f4dc&amp;dn=Time+of+Nagual&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Syncaine","files":-1,"time":1411438974,"description":"Would you like to plunge into the world of magic of the ancient shamans? Surrounding reality is full of beauty, mystery and discovery. We invite you to go beyond the boundaries of your perception with the help of this application and see for themselves in the infinity of the world. What we call reality is just one of the possible schemes of perception, there are different ways to enhance perception. This application is based on the reception of ancient Mexico naguals separation of your attention. The most well this method is described in the books of Carlos Castaneda. Randomly from the system 143 phonemes generated two proposals, one whispering in the left ear, the other, whispering in my right ear. As Juan meaning it does not matter, it is important that your attention is divided, and with it, your perception is shared and stop the internal dialogue. This is the key to the world of magic. It is not easy and will not the first time, but practicing every day for 5-15 minutes, you can break out of this boring and monotonous world and perceive what the shamans of Mexico said.\n\n- = Features = -\n- An ancient nagual.\n- Ability to expand perception.\n- Stopping the internal dialogue.\n- Generate random phrases.\n- World of Magic opens for you.\n- Shamans and sorcerers of antiquity preserved for us this practice.","torrent":{"xt":"urn:btih:a324ce3d7f8a263910a9da1a38c261686ad6f4dc","amp;dn":"Time+of+Nagual","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a324ce3d7f8a263910a9da1a38c261686ad6f4dc","infoHashBuffer":{"type":"Buffer","data":[163,36,206,61,127,138,38,57,16,169,218,26,56,194,97,104,106,214,244,220]},"announce":[],"urlList":[]}}