{"title":"Kerbal Space Program","uid":12118713,"size":89871851,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:a44c2d62d49ef57f8d59656683a29f2f9217856f&amp;dn=Kerbal+Space+Program&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"gynulroy","files":3,"time":1436788078,"description":"Kerbal Space Program\n\n\n\n\n\nThe player controls a nascent space program operated by Kerbals, a race of small green humanoids, who have constructed a fully furnished and functional spaceport (known as the Kerbal Space Center, or KSC) on their homeworld Kerbin, similar to Earth. Despite being shown as funny cartoon-like little green men, sometimes lacking common sense,they have shown themselves to be able to construct very well-made spacecraft parts and perform experiments.\n\nGameplay consists of constructing rockets and spaceplanes out of a provided set of components and launching them from the in-game space center's launch pad or runway, then going on to complete their desired mission while averting catastrophic failure, such as running out of fuel or electricity, or the spacecraft breaking apart due to structural problems, otherwise being unable to succeed.\n\nDue to the complexity of orbital physics and the development of spacecraft, the game can be difficult for new users. However, it has been praised for making difficult concepts of spaceflight accessible","torrent":{"xt":"urn:btih:a44c2d62d49ef57f8d59656683a29f2f9217856f","amp;dn":"Kerbal+Space+Program","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a44c2d62d49ef57f8d59656683a29f2f9217856f","infoHashBuffer":{"type":"Buffer","data":[164,76,45,98,212,158,245,127,141,89,101,102,131,162,159,47,146,23,133,111]},"announce":[],"urlList":[]}}