{"title":"Hal Clement -Through the Eye of a Needle","uid":11062513,"size":128275501,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:a48c676c93952bb64ea490ee6e870c4f3e5a3da1&amp;dn=Hal+Clement+-Through+the+Eye+of+a+Needle&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"twocows","files":8,"time":1411183832,"description":"Tenebra has a gravity three times that of Earth, a day temperature at the equator of 380 degrees centigrade, an atmosphere of water mixed with other chemicals, and a constantly shifting crust. There is life, with intelligence, on the planet, and a scientific expedition has been attempting to make contact. The scientists have devised a remote-controlled unit that lands on the planet, takes away 10 youngsters from their tribe and teaches them to communicate with it - then, when they have grown up, they will be the means of contact with the other natives.\n\nAll is going according to plan until two children of the political officers who are watching the experiment from an orbit 160,000 miles out climb into the bathyscaphe that has been designed to land humans on the surface of the planet. They accidentally set it in motion and it soon gets too close to the planet's atmosphere to be pursued and controlled. So instructions are radioed for it to land. The native group, through the control unit, are then set to trace the bathyscaphe and carry out the technical work necessary before it can return to the parent ship.","torrent":{"xt":"urn:btih:a48c676c93952bb64ea490ee6e870c4f3e5a3da1","amp;dn":"Hal+Clement+-Through+the+Eye+of+a+Needle","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a48c676c93952bb64ea490ee6e870c4f3e5a3da1","infoHashBuffer":{"type":"Buffer","data":[164,140,103,108,147,149,43,182,78,164,144,238,110,135,12,79,62,90,61,161]},"announce":[],"urlList":[]}}