{"title":"Tales of Illyria v5.21 APK (Android)","uid":12210637,"size":13151555,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:a56dc26ff36b1297058b74a280f31b136a83c579&amp;dn=Tales+of+Illyria+v5.21+APK+%28Android%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Pahly","files":1,"time":1439078759,"description":"Rise as the hero of your own story as you struggle to survive in a world where demons and dysentery could plague your every step. Choose your name, appearance, gender and one of six kingdom origins. Each origin will have their own unique questline to pursue at your leisure.\n\nDon't want a personal quest? Become a mercenary and hire strong allies to battle at your side. Fight in the arena, sail the seas to distant ports, hunt down dragons and murderers, save that village, or rob that merchant caravan because you really, really need the gold.\n\nEarn a high enough reputation and kings will ask you to perform secret missions against rival kingdoms. Gain the favor of royalty, and you will receive estates, noble titles, and eternal glory.\n\nTales of Illyria is a party-based RPG hybrid where you manage your supplies and fortunes while traveling in a challenging, open-world environment. Each party member has their own quest, and distinct personalities that will react differently to every hard choice you make on the road. What will your story be?\n\nFeatures:\nA standalone story you make your own\n25+ hours of gameplay and high replayability\n900+ unique encounters\n12 unique party members to hire, train and equip\nHunt exotic animals and harvest plants to feed your party\nJungle, savanna, forest, desert and mountain environments\n6 kingdoms with dozens of villages, castles, cities and islands to visit\nImproved battle system featuring new spell-casting enemies. Control your party's actions or let the AI do it for you!\nLearn what happened in the years following the chaotic events of Tales of Illyria Episode One: Fallen Knight and Tales of Illyria: Beyond the Iron Wall\nA Note on the IAP Content - Tales of Illyria: Destinies is perfectly playable without the IAP content. The quest packs are merely expansions for those who want even more content, but both fans and new players can still experience thrilling gameplay from just the core game\n\nAfter the game installs, additional graphic files will be downloaded depending on the resolution you pick. This ranges from 200MB to 1.2GB. You will need double that in free space to install the game.\n\nRequired Android O/S : 4.0+","torrent":{"xt":"urn:btih:a56dc26ff36b1297058b74a280f31b136a83c579","amp;dn":"Tales+of+Illyria+v5.21+APK+%28Android%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a56dc26ff36b1297058b74a280f31b136a83c579","infoHashBuffer":{"type":"Buffer","data":[165,109,194,111,243,107,18,151,5,139,116,162,128,243,27,19,106,131,197,121]},"announce":[],"urlList":[]}}