{"title":"Alaska: Earth's Frozen Kingdom - 1. Spring HDTV x264 - GHOST DOG","uid":12139625,"size":354057377,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:a5ba07160af133ae6443535b5a0b7b8452989170&amp;dn=Alaska%3A+Earth%27s+Frozen+Kingdom+-+1.+Spring+HDTV+x264+-+GHOST+DOG&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"marxph","files":2,"time":1437321722,"description":"Three-part series that looks at a year in Alaska, revealing the stories of pioneering Alaskans, both animal and human, as they battle the elements and reap the benefits of nature's seasonal gold rush.\n\nEpisode 1 of 3: Spring\n\nAlaska is one of the most iconic wildernesses on the planet - America's last frontier.\n\nIn this three-part series, we follow a year in Alaska and reveal the stories of pioneering Alaskans, both animal and human, as they battle the elements and reap the benefits of nature's seasonal gold rush.\n\nAlaska is huge - by far the biggest US state - and still one of the wildest places on earth. It has deep forests and vast mountain ranges, and a third of it sits above the Arctic Circle.\n\nThe whole state goes through some of the most extreme seasonal changes: temperatures can reach into the 90s F in summer and can plummet to -80F in the winter.\n\nYet plenty survives here, and it is home to some of the hardiest animals on the planet. Each one has its own quirky way of getting through the challenges of the seasons. Above all, this is a land of great characters.\n\nWe meet black bear cubs faced with a daunting climb down from their tree-den and a mother sea otter nursing her fluff-ball baby through the chilly days of early spring. Stealthy 50-tonne sperm whales steal fish from the end of fishermen's lines in an extraordinary marine 'heist', grizzly bears grow big on a sudden wealth of salmon and a huge male moose finds unlikely ways to impress a female. Thousands of bald eagles gather for a winter feast, and arctic foxes risk everything to find food in the alien world of an oil boomtown. People, too, must go with the flow of the extreme seasons, facing winter storms at sea to catch snow crabs, rushing across ice rivers with teams of huskies and taking advantage of Alaska's endless summer daylight to grow world-class giant vegetables.\n\nAs spring lights up the land, Alaska faces one of the greatest transformations on earth. Temperatures soar, and as the sun's rays hit the snow and ice, water, light and warmth return. Alaska's transition to spring may look magical, but for those animals emerging from a long winter's sleep, it's a time of intense competition, as everything is in a rush to cash in on Alaska's riches.\n\n===================================================================================\nSource.......: HDTV\nSize.........: 337MB\nFormat.......: mp4\nResolution...: 640x360\nVideo........: h.264, 700Kbps @ 25 fps\nAudio........: aac, 93Kbps, 48 KHz, 2 channels\n===================================================================================\n\nghost dog","torrent":{"xt":"urn:btih:a5ba07160af133ae6443535b5a0b7b8452989170","amp;dn":"Alaska%3A+Earth%27s+Frozen+Kingdom+-+1.+Spring+HDTV+x264+-+GHOST+DOG","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a5ba07160af133ae6443535b5a0b7b8452989170","infoHashBuffer":{"type":"Buffer","data":[165,186,7,22,10,241,51,174,100,67,83,91,90,11,123,132,82,152,145,112]},"announce":[],"urlList":[]}}