{"title":"Mass Effect v1.02 + M.E.U.I.T.M","uid":12214111,"size":11582695658,"categoryP":"games","categoryS":"mac","magnet":"?xt=urn:btih:a692ad2b65476ca9c756a1fcb5cb70dca6c2a800&amp;dn=Mass+Effect+v1.02+%2B+M.E.U.I.T.M&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"DankoB","files":3,"time":1439197462,"description":"The galaxy is trapped in an endless cycle of extinction. Every 50,000 years, an ancient machine race invades the galaxy. With ruthless efficiency, the machines wipe out all advanced organic civilization. They leave behind only the scattered ruins of technology, destroying all evidence of their own existence.\n\nFew believe this ancient legend. You, however, know it to be true. The fight to stop this extinction event has become the most important mission in the galaxy.\n\nIt is your mission. As Commander Shepard of the SS Normandy, you will take your elite recon squad across a galaxy in turmoil, in a desperate race to stop the return of an enemy without mercy. To stop this enemy, you must act without remorse, without hesitation, and outside the limits of the law. Your only imperative is to preserve the safety of civilized life in the galaxy - at any cost. You must become the tip of the spear of humanity, for you alone know the full extent of what is at stake if you should fail\n\nLose Yourself in a Living Galaxy\n\nMass Effect combines astonishing photo-realistic graphics with innovative new dialog systems to create a cast of living characters to interact with. Engage these characters in real-time conversations that allow you to immerse yourself in dramatically charged situations.\nCharacters communicate with full voice-acting and amazing animation that displays their emotions right down to subtle nuances in their facial expressions. Every wrinkled brow and slight twist of the mouth is captured to infuse every interaction with a feeling of realism.\n\nScience-fiction Role-playing: Perfected\n\nMass Effect allows you to create your own customizable version of Commander Shepard (or jump in and use the pre-created character) and plunge yourself into the center of an epic science-fiction story. Choose your squad-mates, your weapons, skills and abilities, and customize your vehicles, armor and appearance - you are in complete control over your experience.\nIn the course of your mission to stop the machine invasion, you may choose to follow the path of the soldier, the tech-specialist, or the biotics-specialist, each of which brings an arsenal of unique yet equally powerful abilities to use against the enemy. Wield a multitude of weapon types with precision accuracy, utilize your technical skill to turn enemy war machines against their creators or unleash the full power of Dark Energy against your foe with devastating effects.\nAs you progress throughout the game you will improve your character's skills, abilities, and equipment (including weapons, armor, biotic implants and more) to ensure that you have the means to face the growing threat before you.\nThe role you choose to play in Mass Effect will have tremendous consequences on the galaxy around you. You will face moral dilemmas in which the decision you ultimately make will significantly alter the fate of civilized life in the galaxy.\n\nTested on:\nMac OS X 10.10.4\nIntel Quad Core i7 @ 2.3GHz\n16GB 1333Mz DDR3 RAM\nRadeonHD 6750M w/ 512MB vRAM\nApprox. 20GB required HD space\n\nInstallation:\nMount the disk image located in the Mass Effect folder\nDrag and drop the Mass Effect.app to your preferred gaming folder\nDouble click the app to launch the game\n\nThis port uses Wineskin WS9Wine-Staging1.7.48","torrent":{"xt":"urn:btih:a692ad2b65476ca9c756a1fcb5cb70dca6c2a800","amp;dn":"Mass+Effect+v1.02+%2B+M.E.U.I.T.M","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a692ad2b65476ca9c756a1fcb5cb70dca6c2a800","infoHashBuffer":{"type":"Buffer","data":[166,146,173,43,101,71,108,169,199,86,161,252,181,203,112,220,166,194,168,0]},"announce":[],"urlList":[]}}