{"title":"Fake or Fortune S04E04","uid":12163262,"size":653553525,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:a6a86c356c8004c7f81cb77ca8689ca6be72c84c&amp;dn=Fake+or+Fortune+S04E04&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"xela_5","files":1,"time":1437968785,"description":"\nMunnings and Churchill\n\nFake or Fortune?, Series 4 Episode 4 of 4\n \nCharles Henty, the man in charge of the Old Bailey, has a problem - the death of his uncle has left him with a working farm to run in France and a crippling inheritance tax bill to pay. He is desperate to protect the jobs of the farmworkers and keep the farm running in his uncle's memory, but the only way he can do that is by selling two paintings he owns - if he can prove they're genuine.\n\nOne, believed to be by Sir Winston Churchill, was discovered in the coalhole of Charles' family home in London in the 60s. It's a picturesque scene of a medieval village in the south of France. But which village? For the painting to be accepted as genuine, the Fake or Fortune team must first find the exact location and then prove that Churchill painted the scene. There's a lot at stake, with a Churchill painting selling at Sotheby's in 2014 for Â£1.8 million, but a leading expert has grave misgivings about the authenticity of the picture.\n\nCharles' other painting is a landscape of Dedham in Essex, believed to be by Sir Alfred Munnings, best known for his paintings of horses and once the most expensive British artist of his day. However, Dedham was also the home of Tom Keating, Britain's most notorious forger of the 20th century. Presenter Philip Mould is drawn into the murky world of fakes and forgeries, where nothing is quite as it seems. \n\nThe Fake or Fortune team pull out all the stops in this dramatic and emotionally charged investigation, but can they prove that both pictures are genuine?","torrent":{"xt":"urn:btih:a6a86c356c8004c7f81cb77ca8689ca6be72c84c","amp;dn":"Fake+or+Fortune+S04E04","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a6a86c356c8004c7f81cb77ca8689ca6be72c84c","infoHashBuffer":{"type":"Buffer","data":[166,168,108,53,108,128,4,199,248,28,183,124,168,104,156,166,190,114,200,76]},"announce":[],"urlList":[]}}