{"title":"[FemaleAgent] Uknown (1254 / 09.23.2014)","uid":11086300,"size":548593676,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:a6eb68cc802a14c54c4facd6c98f63b7eb9b43a6&amp;dn=%5BFemaleAgent%5D+Uknown+%281254+%2F+09.23.2014%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"chkm8te","files":1,"time":1411461134,"description":"[FemaleAgent] Uknown (1254 / 09.23.2014)\n\nThomas (25 mins). Thomas was a good looking guy who wanted to try his hand at modelling. He had already done porn in the past and it had ruined a relationship with his girlfriend at the time, so now he wanted to try his hand at normal modelling, so that situation could never happen again. Of course, this was totally going against what I wanted from him today, which was mainly his cock in my pussy. I kept pressing the point home that I thought he'd be better suited for erotica, until eventually I think he got what I was after. He offered to fuck me hard in exchange for normal modelling jobs. This was amazing, this guy was propositioning me. I quickly agreed and within seconds he had me bent over my own desk as he licked my pussy from behind. He was dominating me in my own office and I was loving it. He moved me onto the couch and undressed me and after licking my pussy some more, he stuffed his cock into me and began to fuck me hard. Then, again much to my surprise, he grabbed one of the cameras and began to film me POV style whilst fucking me. This guy was practically doing my job for me, was he here for a casting or was I? I rode him in the cowgirl position before he turned me round and starting fucking me from behind. It was turning into an amazing casting session, when all of a sudden it all came crashing down. Just as I could feel the beginnings of my orgasm grow, he pulled out and dribbled his spunk all over my ass cheeks. I was pissed off, this guy was useless, I threw him out, disappointed and frustrated. I was so horny because of that tease that I decided I had to take matters into my own hands and out came my favorite vibrator. I played it all over my pussy and I soon came to an amazing orgasm that shook my whole body. Just a shame that guys stamina wasn't up to much, I've boiled eggs for longer then he lasted.\n\nScreens: &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=rctd32dvpwp6q3wl08ff.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=rctd32dvpwp6q3wl08ff.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=dga9osgqx7xqj18qrq8v.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=dga9osgqx7xqj18qrq8v.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:a6eb68cc802a14c54c4facd6c98f63b7eb9b43a6","amp;dn":"%5BFemaleAgent%5D+Uknown+%281254+%2F+09.23.2014%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a6eb68cc802a14c54c4facd6c98f63b7eb9b43a6","infoHashBuffer":{"type":"Buffer","data":[166,235,104,204,128,42,20,197,76,79,172,214,201,143,99,183,235,155,67,166]},"announce":[],"urlList":[]}}