{"title":"Pets - Wild at Heart HDTV x264 - GHOST DOG","uid":12139620,"size":695214382,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:a726e1585570d47b2b1a6e1c8c47690cfd06a48e&amp;dn=Pets+-+Wild+at+Heart+HDTV+x264+-+GHOST+DOG&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"marxph","files":4,"time":1437321206,"description":"Two-part documentary. The team behind Penguins - Spy in the Huddle use innovative techniques to reveal the incredible secrets of your pets' behaviour in ways never seen before.\n\nNarrated by David Tennant.\n\n\nEpisode 1 of 2: Playful Creatures\n\nThe team behind Penguins - Spy in the Huddle reveal the incredible secrets of your pets' behaviour in ways never seen before.\n\nAs astonishing photography explores the wild side of our playful pets, find out why hamsters love to run in a wheel, how dogs pick up the rules of the pack and how kittens learn to be solitary hunters. Featuring incredible views of plunge-diving dogs, babysitting cats, acrobatic hamsters and a playful cat outwitted by his prey - you'll never look at your favourite companions in quite the same way again. The latest science also reveals why budgies talk, how a cat scales a vertical wall with the help of a special claw, why hamsters stuff their faces with more food than they can eat and the real meaning behind a rabbit's hop.\n\nOur pets are also given a chance to explore their wild side as we join the free-roaming pet dogs of Cusco Peru, pet rabbits living in a natural warren and the wild-living inhabitants of Cat Island, Japan. A range of innovative techniques such as moving X-rays, thermal imagery, minicam-carrying dogs and revelatory slow-motion photography shows why our pets play and how their true wild nature is just a whisker away.\n\n\nEpisode 2 of 2: Secretive Creatures\n\nTake another walk on the wild side with our favourite pets. Extraordinary photography reveals their hidden senses and secret communication skills. Dogs take a car trip through Paris, using their legendary sense of smell to show us a very different city. A hamster uses his remarkable senses to stage a great escape and then deploys more navigational talents to find his way home. Cats become intoxicated on the scent of a plant and suffer the consequences.\n\nA budgie shows his hidden charms to his mate as, under UV light, his crown and cheeks positively glow. Goldfish reveal secret senses that can detect the slightest water movement. A guinea pig gives birth and the newborns receive surprising care from their father. In South America, where guinea pigs have lived with people for 7,000 years, they express the true meaning of their entertaining calls.\n\nWhen we groom a horse we speak their language, but horses use ears to communicate in ways that we are rarely aware of. In Japan cats show their secret messages and in Peru dogs reveal the hidden signs that allow them to communicate across a city.\n\nPacked with extraordinary facts and wild behaviour - you'll never look at your pet in the same way again.\n\n===================================================================================\nSource.......: HDTV\nSize.........: 663MB\nFormat.......: mp4\nResolution...: 640x360\nVideo........: h.264, 700Kbps @ 25 fps\nAudio........: aac, 93Kbps, 48 KHz, 2 channels\n===================================================================================\n\nghost dog","torrent":{"xt":"urn:btih:a726e1585570d47b2b1a6e1c8c47690cfd06a48e","amp;dn":"Pets+-+Wild+at+Heart+HDTV+x264+-+GHOST+DOG","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a726e1585570d47b2b1a6e1c8c47690cfd06a48e","infoHashBuffer":{"type":"Buffer","data":[167,38,225,88,85,112,212,123,43,26,110,28,140,71,105,12,253,6,164,142]},"announce":[],"urlList":[]}}