{"title":"Sporting Art England 1700-1900 (Art Ebook).pdf","uid":11115623,"size":30349928,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a79473f76ea669a49f5880102ca7aaf2ff629fc7&amp;dn=Sporting+Art+England+1700-1900+%28Art+Ebook%29.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"STBGD","files":-1,"time":1411853660,"description":"pdf / English / 200 pages / 1972 / 28.9 MB\n\nThis book is the first since Walter Shaw Sparrow's British Sporting Artists (1922) to examine in detail the phenomenon of British sporting art in the eighteenth and nineteenth centuries. Not only is the work of such well known artists as George Stubbs and Ben Marshall discussed, but the paintings of Francis Barlow, John Wootton, James Seymour, Sawrey Gilpin, John Ferneley and Henry Aiken, to mention just a few, are dealt with in an authoritative and perceptive way. All aspects of sporting life are covered, from the classic races and famous hunts to the simpler pleasures of coursing the hare, angling and shooting. The evolution of the Thoroughbred is described as well as the brief heyday of the coaching era, the competitive world of farm-stock breeding and the arrival of the sporting print. These sections are followed by a study of sporting illustrators such as Rowlandson, Bewick, and Leech, and the book concludes with a look at sporting artists of the Victorian period and early twentieth century. The text is lavishly\nillustrated by 100 black and white photographs and 23 full color illustrations.","torrent":{"xt":"urn:btih:a79473f76ea669a49f5880102ca7aaf2ff629fc7","amp;dn":"Sporting+Art+England+1700-1900+%28Art+Ebook%29.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a79473f76ea669a49f5880102ca7aaf2ff629fc7","infoHashBuffer":{"type":"Buffer","data":[167,148,115,247,110,166,105,164,159,88,128,16,44,167,170,242,255,98,159,199]},"announce":[],"urlList":[]}}