{"title":"Imaging in Medical Diagnosis and Therapy - Tomosynthesis Imaging","uid":11112487,"size":15362666,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a7a9ad20df42fb61477dd2a7bbcd45b1db2aab0f&amp;dn=Imaging+in+Medical+Diagnosis+and+Therapy+-+Tomosynthesis+Imaging&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"vickey1992","files":1,"time":1411818565,"description":"Image-Guided Radiation Therapy presents key image-guided radiation treatment (IGRT) technologies for external beam radiotherapy. The book explores the decades-long technological developments that have occurred in the realm of image-guided conformal, customized radiation treatment. Expert authors, all of whom have actively participated in the development or implementation of IGRT, imaging, and enabling technologies, share their first-hand experiences on the science, clinical uses, and impact of these technologies. They describe kilovoltage and megavoltage imaging as well as radiological, ultrasound, and optical technologies for determining and validating target and patient positioning. The book examines how anatomical and biological imaging using CT and PET has contributed to the understanding of target volume boundaries and biological behavior. It also explores such innovations as 4D PET/CT and digital tomosynthesis. Advancing patient care, this book focuses on a wealth of hybrid IGRT technologies and devices for coupled imaging and treatment inside the radiation treatment room. It thoroughly covers the modalities, software tools, and imaging treatment geometries that constitute IGRT.\n\nTomosynthesis Imaging (Imaging in Medical Diagnosis and Therapy)\nby Ingrid Reiser (Editor), Stephen Glick (Editor)\n\nTrue PDF, Bookmarked and Indexed.\n\nCopyright to the respective owners.If you like this book then please buy it.\nSharing is caring,Seed this torrent so others could enjoy it too.","torrent":{"xt":"urn:btih:a7a9ad20df42fb61477dd2a7bbcd45b1db2aab0f","amp;dn":"Imaging+in+Medical+Diagnosis+and+Therapy+-+Tomosynthesis+Imaging","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a7a9ad20df42fb61477dd2a7bbcd45b1db2aab0f","infoHashBuffer":{"type":"Buffer","data":[167,169,173,32,223,66,251,97,71,125,210,167,187,205,69,177,219,42,171,15]},"announce":[],"urlList":[]}}