{"title":"Amy Lane - Various Titles","uid":11108985,"size":3156490618,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:a7b9f259599aad94ae7c33827be4995e2a94dfcd&amp;dn=Amy+Lane+-+Various+Titles&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"katelynor","files":20,"time":1411773126,"description":"Granby Knitting \n\nBook 1 - The Winter Courtship Rituals of Fur-Bearing Critters Unabridged\n2 hrs and 26 mins\nRance Crawford is an alpaca rancher, fiber mill owner, and self-proclaimed grumpy bastard. When sweet, charming tenderfoot Ben McCutcheon moves onto Crawford's rural road, Rance is very aware that Ben makes it a grand total of two gay men in their tiny town, and even though he is instantly, painfully smitten, any move he makes could be simply chalked up to being hard up. \n\n\nJohnnies\n\nBook 1 - Chase in Shadows\n9 hrs and 39 mins\nNobody knows the real Chase. Chase Summers has a razor blade to his wrist and the smell of his lover's goodbye clinging to his skin. He has a door in his heart so frightening he'd rather die than open it, and the lies he's used to block it shut are thinning with every forbidden touch. Chase has spent his entire life unraveling, and his decision to set his sexuality free in secret has only torn his mind apart faster. \n\nBook 2 - Dex in Blue\n10 hrs and 28 mins \nTen years ago David Worral had plans to go to college and the potential for a beautiful future in front of him. One tragic accident later, he fled to California and reinvented himself as Dex, top porn model of Johnnies. Dex's life is a tangled mess now, but the guys he works with only see the man who makes them believe even porn stars can lead normal lives. When Kane, one of Dex's coworkers, gets kicked out of his house, the least Dex can do is give him a place to stay. \n\nBook 3 - Ethan in Gold\n10 hrs and 46 mins \nEvan Costa learned from a very early age that there was no such thing as unconditional love and that it was better to settle for what you could get instead of expecting the world to give you what you need. As Ethan, porn model for Johnnies, he gets exactly what he wants - comradeship and physical contact on trade -and he is perfectly satisfied with that. He's sure of it. \n\nPromises\n\nBook 1 - Keeping Promise Rock\n10 hrs and 51 mins \nCarrick Francis has spent most of his life jumping into trouble with both feet. The only thing saving him from prison or worse is his absolute devotion to Deacon Winters. Deacon was Crick's sanity and salvation during a miserable, abusive childhood, and Crick would do anything to stay with him forever. \n\n\nSingle Stories - \n\nBehind the Curtain - 7 hrs and 59 mins\nBold-Hole -  8 hrs\nClear Water - 7 hrs and 23 mins\nGoing Up - 2 hrs and 39 mins\nRacing for the Sun - 8 hrs and 32 mins\nThe Locker Room - 7 hrs and 40 mins\nTurkey in the Snow - 2 hrs and 32 mins\n\nTalker\n\nTalker -  2 hrs and 19 mins\nTalker's Redemption - 2 hrs and 12 mins\nTalker's Graduation - 1 hr and 43 mins\n\nPlease seed and enjoy","torrent":{"xt":"urn:btih:a7b9f259599aad94ae7c33827be4995e2a94dfcd","amp;dn":"Amy+Lane+-+Various+Titles","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a7b9f259599aad94ae7c33827be4995e2a94dfcd","infoHashBuffer":{"type":"Buffer","data":[167,185,242,89,89,154,173,148,174,124,51,130,123,228,153,94,42,148,223,205]},"announce":[],"urlList":[]}}