{"title":"Ben H. Winters - Android Karenina","uid":12160378,"size":552634682,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:a7ef7ea080391f2659093291ed561e2290c9f32e&amp;dn=Ben+H.+Winters+-+Android+Karenina&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Cybotage","files":18,"time":1437894878,"description":"\nSense and Sensibility and Sea Monsters co-author Ben H. Winters is back with an all-new collaborator, legendary Russian novelist Leo Tolstoy, and the result is Android Karenina an enhanced edition of the classic love story set in a dystopian world of robots, cyborgs, and interstellar space travel.\n\nAs in the original novel, our story follows two relationships: the tragic adulterous romance of Anna Karenina and Count Alexei Vronsky, and the much more hopeful marriage of Konstantin Levin and Kitty Shcherbatskaya.These four, yearning for true love, live in a steampunk-inspired 19th century of mechanical butlers, extraterrestrial-worshiping cults, and airborne debutante balls. Their passions alone would be enough to consume them-but when a secret cabal of radical scientific revolutionaries launches an attack on Russian high society's high-tech lifestyle, our heroes must fight back with all their courage, all their gadgets, and all the power of a sleek new cyborg model like nothing the world has ever seen.&quot;\n\nFilled with the same blend of romance, drama, and fantasy that made the first two Quirk Classics New York Times best sellers, Android Karenina brings this celebrated series into the exciting world of science fiction","torrent":{"xt":"urn:btih:a7ef7ea080391f2659093291ed561e2290c9f32e","amp;dn":"Ben+H.+Winters+-+Android+Karenina","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a7ef7ea080391f2659093291ed561e2290c9f32e","infoHashBuffer":{"type":"Buffer","data":[167,239,126,160,128,57,31,38,89,9,50,145,237,86,30,34,144,201,243,46]},"announce":[],"urlList":[]}}