{"title":"Doctor Finlay - S01 to 03 - Audio Drama - MP3 - Slimoo","uid":12120629,"size":480625837,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:a8102694c1bde7b6335bf985351fabf98a941d1f&amp;dn=Doctor+Finlay+-+S01+to+03+-+Audio+Drama+-+MP3+-+Slimoo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"_Slimoo_","files":18,"time":1436817096,"description":"Doctor Finlay - S01 to 03 - Audio Drama - BBC Radio 7\n18 x 30 minute episodes - 128Kbps - Mp3 - Slimoo\n\n\nDr. Finlay is a fictional doctor, the hero of a series of stories by Scottish author A. J. Cronin.\n\nThe stories were used as the basis for the long-running BBC television and radio series\n\nBased on Cronin's novella entitled Country Doctor, the storylines centered on Dr. Finlay's general medical practice in the fictional Scottish town of Tannochbrae during the late 1920s. The main characters were Dr. Finlay, a junior partner in the practice, Dr. Cameron, the craggy senior partner,, and Janet, their unflappable housekeeper and receptionist at Arden House\n\n\nCast:\nGordon Sinclair - Dr. Finlay\nBrian Pettifer - Dr Cameron\nKaty Murphy - Janet\n &lt;a href=&quot;\nhttp://www.radiolistings.co.uk/programmes/dr_finlay___the_adventures_of_a_black_bag.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.radiolistings.co.uk/programmes/dr_finlay___the_adventures_of_a_black_bag.html&lt;/a&gt;\n\n\n\nDoctor Finlay - The Adventures Of A Black Bag - S01 - E01 - The Resolution That Went Wrong\nDoctor Finlay - The Adventures Of A Black Bag - S01 - E02 - Who Laughs Last\nDoctor Finlay - The Adventures Of A Black Bag - S01 - E03 - The Day Dandini Came To Town\nDoctor Finlay - The Adventures Of A Black Bag - S01 - E04 - Actor And Alibi\nDoctor Finlay - The Adventures Of A Black Bag - S01 - E05 - The Wife Of A Hero\nDoctor Finlay - The Adventures Of A Black Bag - S01 - E06 - The Sisters Scobie\n\nDoctor Finlay - The Further Adventures Of A Black Bag - S01 - E01 - The Catch\nDoctor Finlay - The Further Adventures Of A Black Bag - S01 - E02 - The Fever\nDoctor Finlay - The Further Adventures Of A Black Bag - S01 - E03 - The Miracle Of Lestrange\nDoctor Finlay - The Further Adventures Of A Black Bag - S01 - E04 - Birth And Death\nDoctor Finlay - The Further Adventures Of A Black Bag - S01 - E05 - The Golden Fishbone\nDoctor Finlay - The Further Adventures Of A Black Bag - S01 - E06 - The Match\n\nDoctor Finlay - The Further Adventures Of A Black Bag - S02 - E01 - Better Safe Than Sorry\nDoctor Finlay - The Further Adventures Of A Black Bag - S02 - E02 - The Levenford Ghost\nDoctor Finlay - The Further Adventures Of A Black Bag - S02 - E03 - A Terrible Charm\nDoctor Finlay - The Further Adventures Of A Black Bag - S02 - E04 - The Accident\nDoctor Finlay - The Further Adventures Of A Black Bag - S02 - E05 - The Visitor\nDoctor Finlay - The Further Adventures Of A Black Bag - S02 - E06 - The Day Before The Wedding\n.\n\nAudio Format : MP3\nDuration : 28mn 1s\nBit rate mode : Constant\nBit rate : 128 Kbps\nChannel(s) : 2 channels\nSampling rate : 44.1 KHz\nResolution : 16 bits\n\n\n[","torrent":{"xt":"urn:btih:a8102694c1bde7b6335bf985351fabf98a941d1f","amp;dn":"Doctor+Finlay+-+S01+to+03+-+Audio+Drama+-+MP3+-+Slimoo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a8102694c1bde7b6335bf985351fabf98a941d1f","infoHashBuffer":{"type":"Buffer","data":[168,16,38,148,193,189,231,182,51,91,249,133,53,31,171,249,138,148,29,31]},"announce":[],"urlList":[]}}