{"title":"Marcus Hook Roll Band -  1973 (Angus Malcolm pre AC-DC)","uid":11118673,"size":104556347,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:a94749770e2e51314a4433afd5d66e1ecf1d726f&amp;dn=Marcus+Hook+Roll+Band+-++1973+%28Angus+Malcolm+pre+AC-DC%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"analogkid6103","files":15,"time":1411885149,"description":"Marcus Hook Roll Band - Tales Of Old Grand-Daddy 1973 (Angus &amp; Malcolm pre AC-DC)Uploader Speak- I would not normally post this but has anyone heard what has become of Malcolm Its very depressing and I am posting this Malcolm and Angus first pro recorded work God bless Malcolm. An awesome talent we will remember even if you cant................\n\n\nSo who has heard of a rare album from early 1973 called &quot;Tales of Old Granddaddy&quot; by the Marcus Hook Roll Band (Angus, Malcolm, and George Young, and Harry Vanda\n\n\nAC/DC fans will know this contains early Young Bros.\n\nGenerally believed to be the first commercial recordings made by Malcolm and Angus Young, who had just formed AC/DC\n\nThis album contains all known existing tracks of The Marcus Hook Roll Band -\n\n\n\n\nQuote:\nLittle short history of 3 brothers........George Young's and\nhis younger brothers  Malcolm  Young and Angus Young.\n\nMalcolm picked up the guitar first, graduating quickly from acoustic to\nelectric. With adhoc advice along the way from George he made rapid\nprogress. Angus messed around with his older brother's guitars before\nhis mother finally bought him his own.Malcolm left school at 15 and found\ngainful employment as a machine maintenance engineer for a bra company\n(Berlei Bras). In 1971, he joined up with a band called Velvet Underground\n(no relation to the Lou Reed band). Ironically, the original singer in the\nband was called Brian Johnson. In 1972, George invited Malcolm and Angus\nto join with his new band, the Marcus Hook Roll Band, for the recording\nsessions of his album 'Tales Of Old Granddaddy'. In fact, George and Harry\ndidn't take the project very seriously so they thought it would be a good\nidea to include George's brothers to give them an idea of what recording\nwas all about. That was the first thing Malcolm and Angus did before AC/DC.\nAt fourteen and nine months (the legal age you could leave school), Angus\nleft and went to work for a soft porn magazine called Ribald as a printer.\nMeanwhile, Angus had already formed his own band , Tantrum, and had become\nproficient as a musician through playing along to any records he could find........and then the Ac dc adventure begins....\n\nMembers:\nVanda Harry (g)\nYoung George (g,p,b)\nYoung Angus (g)\nYoung Malcolm (g) A\nCampbell Ian (b)\nCasey Howie (sax)\nProud John (d)\nSmith Freddie (d)\nYoung Alex (sax\n\nThis is fun to have for true Acdc fans\n\n\n\n01. Natural Man\n02. Louisiana Lady\n03. Shot In The Head\n04. Can't Stand The Heat\n05. Goodbye Jane\n06. Quick Reaction\n07. People &amp; The Power\n08. Red Revolution\n09. Cry For Me\n10. Silver Shoes &amp; Strawberry Wine\n11. Watch Her Do It Now\n12. Ape Man\n\n\n\n\nShot in the head.Youtube nice guitar playing on that tune.\n\nGenre:\tRock\nSubgenre:\tBlues rock","torrent":{"xt":"urn:btih:a94749770e2e51314a4433afd5d66e1ecf1d726f","amp;dn":"Marcus+Hook+Roll+Band+-++1973+%28Angus+Malcolm+pre+AC-DC%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a94749770e2e51314a4433afd5d66e1ecf1d726f","infoHashBuffer":{"type":"Buffer","data":[169,71,73,119,14,46,81,49,74,68,51,175,213,214,110,30,207,29,114,111]},"announce":[],"urlList":[]}}