{"title":"A Cupboard Full of Coats by Yvvette Edwards {dwg}","uid":11110826,"size":2030313,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a9c448bbe5a0023f9bc0789ab31d06a4ba6779b7&amp;dn=A+Cupboard+Full+of+Coats+by+Yvvette+Edwards+%7Bdwg%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"gratefuldawg77","files":6,"time":1411792072,"description":"Redolent of Monica Ali and Zadie Smith, Yvvette Edwards' bold debut is a searing story of family, jealousy, and tragic betrayal. &quot;He just knocked, that was all, knocked at the front door and waited, like the fourteen years since the night I'd killed my mother hadn't happened at all...&quot; Fourteen years ago, Jinx' mother was brutally murdered in their East London home. Overwhelmed by the part she played, Jinx's whole life has been poisoned by guilt. Then, out of nowhere, Lemon arrives on her doorstep. An old friend of her mother's, he wants to revisit the events leading to that terrible night, forcing Jinx to finally confront her past, and offering her the possibility of redemption alongside the pain of remembrance. Estranged from her husband and detached from her son, Jinx knows that this is her only chance to make her confession, and end the emotional paralysis that has blighted her life. But Lemon has his own secrets to share, and over the course of one weekend they unravel an unforgettable family drama, stoked with violence and passion. Rich with voices from East London and the West Indies, Edward's narrative is delivered with a unique and uncompromsing bight that announces a new talent in British fiction.","torrent":{"xt":"urn:btih:a9c448bbe5a0023f9bc0789ab31d06a4ba6779b7","amp;dn":"A+Cupboard+Full+of+Coats+by+Yvvette+Edwards+%7Bdwg%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a9c448bbe5a0023f9bc0789ab31d06a4ba6779b7","infoHashBuffer":{"type":"Buffer","data":[169,196,72,187,229,160,2,63,155,192,120,154,179,29,6,164,186,103,121,183]},"announce":[],"urlList":[]}}