{"title":"The Biology of Desire: Why Addiction Is Not a Disease","uid":12166538,"size":1300335,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a9c776c325e4591e9cf89f3b8b73f6a26c81285b&amp;dn=The+Biology+of+Desire%3A+Why+Addiction+Is+Not+a+Disease&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"mdusanjay","files":1,"time":1438052888,"description":"The Biology of Desire: Why Addiction Is Not a Disease by Marc Lewis PhD\n\n2015 | ISBN: 1610394372 | English | 256 pages | EPUB \n\nThrough the vivid, true stories of five people who journeyed into and out of addiction, a renowned neuroscientist explains why the &quot;disease model&quot; of addiction is wrong and illuminates the path to recovery.\n\nThe psychiatric establishment and rehab industry in the Western world have branded addiction a brain disease, based on evidence that brains change with drug use. But in The Biology of Desire, cognitive neuroscientist and former addict Marc Lewis makes a convincing case that addiction is not a disease, and shows why the disease model has become an obstacle to healing.\n\nLewis reveals addiction as an unintended consequence of the brain doing what it's supposed to do-seek pleasure and relief-in a world that's not cooperating. Brains are designed to restructure themselves with normal learning and development, but this process is accelerated in addiction when highly attractive rewards are pursued repeatedly. Lewis shows why treatment based on the disease model so often fails, and how treatment can be retooled to achieve lasting recovery, given the realities of brain plasticity. Combining intimate human stories with clearly rendered scientific explanation, The Biology of Desire is enlightening and optimistic reading for anyone who has wrestled with addiction either personally or professionally","torrent":{"xt":"urn:btih:a9c776c325e4591e9cf89f3b8b73f6a26c81285b","amp;dn":"The+Biology+of+Desire%3A+Why+Addiction+Is+Not+a+Disease","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a9c776c325e4591e9cf89f3b8b73f6a26c81285b","infoHashBuffer":{"type":"Buffer","data":[169,199,118,195,37,228,89,30,156,248,159,59,139,115,246,162,108,129,40,91]},"announce":[],"urlList":[]}}