{"title":"The Burning Answer: The Solar Revolution","uid":12214134,"size":1897987,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:aa57d77ed8f6ce4e05d25de3902957a6188e4a7d&amp;dn=The+Burning+Answer%3A+The+Solar+Revolution&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"mdusanjay","files":1,"time":1439198232,"description":"Keith Barnham, &quot;The Burning Answer: The Solar Revolution, A Quest for Sustainable Power&quot;\n\nISBN: 160598776X | 2015 | EPUB | 400 pages | 871 KB\n\nUsing the little-known equation E=hf as the foundation for a compelling new vision, The Burning Answer reveals the importance of embracing solar energy as the only solution to the global energy crisis.Our society faces a choice. We could be enjoying a sustainable lifestyle but we have chosen not to. In three generations we have consumed half the oil produced by photosynthesis over eight million generations. In two generations we have used half our uranium resources. With threats from global warming, oil depletion and nuclear disaster, we are running out of options. Solar power, as Keith Barnham explains, is our necessary solution.\n\nIn The Burning Answer he uncovers the connections between physics and politics that have resulted in our dependence on a high-carbon lifestyle, which only a solar revolution can now overcome. Einstein's famous equation E=mc2 led to the atomic bomb and the widespread use of nuclear energy; it has delayed a solar revolution in many countries. In a fascinating tour of recent scientific history, Keith Barnham reveals Einstein's other, less famous equation, the equation the world could have relied on","torrent":{"xt":"urn:btih:aa57d77ed8f6ce4e05d25de3902957a6188e4a7d","amp;dn":"The+Burning+Answer%3A+The+Solar+Revolution","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aa57d77ed8f6ce4e05d25de3902957a6188e4a7d","infoHashBuffer":{"type":"Buffer","data":[170,87,215,126,216,246,206,78,5,210,93,227,144,41,87,166,24,142,74,125]},"announce":[],"urlList":[]}}