{"title":"Reggie Yates Extreme Russia Complete x264 720p EN SUB [MPup]","uid":12212435,"size":3074005016,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:ab60f78f1727642652443c0f7ac3ed04ee754abd&amp;dn=Reggie+Yates+Extreme+Russia+Complete+x264+720p+EN+SUB+%5BMPup%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"makinapufterpup","files":9,"time":1439135232,"description":"Reggie Yates Extreme Russia Complete Series 1 x264 720p ENG SUBS WEBRIP [MPup] Far Right and Proud Gay and Under Attack Teen Model Factory\n\nFormat: MPEG-4\nSize: 1280x720\nDisplayAspectRatio: 16:9\nFrameRate: 25.000 fps\nAudioCodec: AAC\nChannels: 2 channels\nSamplingRate: 48.0 KHz\n\n\nReggie.Yates.Extreme.Russia.s01e01.Far.Right.And.Proud.ENG.SUBS.WEBRIP.[MPup]\n\nIn the first of three programmes revealing the extreme side of Russia, Reggie Yates visits Moscow to get up close and personal with some of the country's far-right nationalists.\n\n[img]http://extraimago.com/images/2015/08/08/f4f47142dc8a8e6050a27c895ede5e55.jpg[/img]\n\nRussia is the largest country on earth and home to nearly 150 million people. Vladimir Putin is well into his third term as president and, with the West imposing tough sanctions, relations are now the frostiest since the Cold War.\n\nReggie Yates gets up close and personal with three very different communities in contemporary Russia. By living with them for a week, he explores what it's like for young people living here, 24 years after the fall of the Soviet Union.\n\nIn the first of three programmes revealing the extreme side of Russia, Reggie travels to Moscow to meet some of the country's most dangerous people - the nationalists. With Putin flexing his muscles and squaring up to the West, Reggie arrives in the Russian capital only days before a march in which thousands of ultra-nationalists take to the streets in a show of strength and unity. Reggie immerses himself into a world where patriotism and loving your country is becoming the norm, one with very dangerous consequences.\n\nHe trains with knife-wielding far-right nationalists, talks to the young artists who idolise Putin, and confronts teenage neo-Nazis who believe that if you're not white then you have no place in Russia. Reggie also meets the non-Russians who live in fear of persecution and hears horrific stories of those who have survived vicious racist attacks.\n\nAnd with the rise of the far right not just in Russia but across many other Western countries, including the UK, Reggie asks if this is what can happen when you love your country too much.\n\n\nReggie.Yates.Extreme.Russia.s01e02.Gay.And.Under.Attack.ENG.SUBS.WEBRIP.[MPup]\n\nWhat life is like for young people in a country where it is very difficult to be gay.\n\n[img]http://extraimago.com/images/2015/08/08/dc6706d34dee4e442cf6c74890928e9f.jpg[/img]\n\nRussia is the largest country on earth and home to nearly 150 million people. Vladimir Putin is well into his third term as president and with the West imposing tough sanctions, relations are now the frostiest since the Cold War.\n\nReggie Yates gets up close and personal with three very different communities in contemporary Russia. By living with them for a week, he explores what it's like for young people living here, 24 years after the fall of the Soviet Union.\n\nA year after the introduction of the controversial anti-propaganda law, Reggie finds out what life is really like for young people in what has been described as the hardest place in Europe to be gay. He travels to St Petersburg for Queerfest, a ten-day arts and culture get-together for the LGBT community. Reggie spends time on both sides of the battle lines - with the Queerfest team as they face the daily fight to keep their festival open, and the homophobes who want to see it closed.\n\nHe also meets Dayra, a young lesbian viciously stabbed and left for dead by homophobes, and activist Kiril who is still fighting back and who shows Reggie how Putin's repressive laws make it almost impossible to protest without risk of arrest. Ivan and Nusrulla are a young gay couple very much in love, but who are so scared of the consequences of coming out that they have made up a pretend girlfriend - and have a huge decision to make about their future.\n\nOn the other side, Reggie meets leaders of Orthodox pressure groups like God's Will, who would stone gays to death if the law allowed it, and Vitali Milonov, the architect of the anti-gay propaganda law. Reggie ends up in a sauna, being beaten with twigs by a naked man, in a bid to understand what it means to be not just Russian in this post-Soviet era, but what it means to be a Russian man.\n\nReggie.Yates.Extreme.s01e03.Teen.Model.Factory.ENG.SUBS.WEBRIP.[MPup]\n\nReggie visits Siberia to meet young girls trying to break into the world of modeling.\n\n[img]http://extraimago.com/images/2015/08/08/09e69ce34b5d7288d24a5a2d8107f271.jpg[/img]\n\nRussia is the largest country on earth and home to nearly 150 million people. Vladimir Putin is well into his third term as president and with the west imposing tough sanctions, relations are now the frostiest since the Cold War.\n\nReggie Yates gets up close and personal with three very different communities in contemporary Russia. By living with them for a week, he explores what it's like for young people living here, 24 years after the fall of the Soviet Union.\n\nAn army of Siberian models is invading the west. Siberia is known around the world for its frigid temperatures, but within the fashion world it is famous for being home to the world's most beautiful women. Reggie joins international scouts as they board the Trans-Siberian railway and cross Siberia looking for the freshest new faces.\n\nAt the open castings - the first one in Krasnoyarsk, 2,800km east of Moscow - Reggie meets girls as young as 13 as they parade in bikinis, hoping that their stunning looks will get them noticed. In Novosibisk, Siberia's capital, he visits some of the city's 26 modelling agencies and schools - where children as young as five are learning how to walk, pose, apply make-up, and diet.\n\nHe meets Anya, who would love to be an artist, but realistically knows that, here in Siberia, there's more chance of her making money as a model; Vika, who has been eating buckwheat for breakfast, lunch and dinner in a bid to lose those extra two centimetres for the casting; and Katia, whose parents are distraught when they have to make a decision about whether she goes to work in China - at the age of just 15.\n\nBut how likely is it that they will really succeed? What are the pitfalls of the modelling industry? And what is the life they are leaving behind like?","torrent":{"xt":"urn:btih:ab60f78f1727642652443c0f7ac3ed04ee754abd","amp;dn":"Reggie+Yates+Extreme+Russia+Complete+x264+720p+EN+SUB+%5BMPup%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ab60f78f1727642652443c0f7ac3ed04ee754abd","infoHashBuffer":{"type":"Buffer","data":[171,96,247,143,23,39,100,38,82,68,60,15,122,195,237,4,238,117,74,189]},"announce":[],"urlList":[]}}