{"title":"The Swede (My Name is N)- Robert Karjel","uid":12159976,"size":377796,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ac947d8637896f701877ebad5c4c773c9a22a541&amp;dn=The+Swede+%28My+Name+is+N%29-+Robert+Karjel&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"ZamKhan","files":1,"time":1437863657,"description":"Jo Nesbo meets Homeland in this sophisticated debut literary thriller about a Swedish security force agent sent to the U.S. for a special assignment, which delivers a breathtaking global twist on the darkly riveting narrative tradition of Nordic noir. Ernst Grip of the Swedish security police has no idea why he is being summoned to the U.S. When he lands at a remote military base in the Indian Ocean, his escort, FBI agent Shauna Friedman, asks him to determine whether a prisoner who has been tortured by the CIA is a Swedish citizen. At the military base, the prisoner, known only as N., refuses to talk. It appears he was involved in an Islamist-inspired terror attack in Topeka, Kansas. The attack was real, but the motivations behind it are not so simple. Evidence points to a group of desperate souls who survived the 2004 Thailand tsunami: a ruthless American arms dealer, a Czech hit man, a mysterious nurse from Kansas, a heartbreakingly naive Pakistani - and a Swede. Meanwhile, Grip himself is leading a double life. No one in Sweden knows that he is bisexual, passionately in love with an art dealer in New York who is fighting AIDS. Together, the couple will do anything to get him the drugs he needs to survive, a situation that leads Grip into terra incognita","torrent":{"xt":"urn:btih:ac947d8637896f701877ebad5c4c773c9a22a541","amp;dn":"The+Swede+%28My+Name+is+N%29-+Robert+Karjel","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ac947d8637896f701877ebad5c4c773c9a22a541","infoHashBuffer":{"type":"Buffer","data":[172,148,125,134,55,137,111,112,24,119,235,173,92,76,119,60,154,34,165,65]},"announce":[],"urlList":[]}}