{"title":"Japan: Earth's Enchanted Islands HDTV x264 - GHOST DOG","uid":12140141,"size":1054559052,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:adb7e0d456bad2202a7ca809caee0d2ceef4d285&amp;dn=Japan%3A+Earth%27s+Enchanted+Islands+HDTV+x264+-+GHOST+DOG&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"marxph","files":3,"time":1437330913,"description":"Japan's landscapes range from snowy mountains to subtropical warmth. They are full of wildlife - and animals' and people's lives often cross as they adapt to these extremes. Michelle Dockery reveals a nation comprising a multitude of islands, each full of surprises and places where nature thrives. Each episode explores how life survives across these wildly diverse islands, dominated by forested mountains, volcanic forces and powerful seas, arctic winters and tropical, typhoon ravaged summers; and reveals the unusual and unexpected relationships between human characters and the wild.\n\n\nEpisode 1 of 3: Honshu\n\nThe central island of Honshu is home to over 100 million people, and its biggest city, Tokyo, is one of the largest urban metropolises on earth. But it has a wild heart - most of Honshu is mountainous. This wilderness is home to an astonishing range of wildlife - black bears, monkeys, exquisite fireflies and even cow demons. But all across this island, from the mountains to the edge of the sea, people and nature are drawn together in the most unexpected ways.\n\n\nEpisode 2 of 3: The Southwest Islands\n\nIn the far south west of Japan, there is a chain of islands stretching towards the tropics - a place where all life is influenced by the power of the sea, and where volcanoes and typhoons are forces to be reckoned with. The journey begins at an island at the top of the chain and travels south, revealing unexpected stories of isolation, unique wildlife and unsolved mysteries.\n\n\nEpisode 3 of 3: Hokkaido\n\nHokkaido is Japan's northernmost - and wildest - island, a place totally unlike the rest of the country. Every year it swings from a bitter Siberian winter into the warmth of a Mediterranean-like summer, when the thaw reveals a landscape changed beyond all recognition. It takes tough animals and tough people with real ingenuity to survive, and even thrive, in this ever-changing place.\n\n===================================================================================\nSource.......: HDTV\nSize.........: 1005MB\nFormat.......: mp4\nResolution...: 640x360\nVideo........: h.264, 700Kbps @ 25 fps\nAudio........: aac, 93Kbps, 48 KHz, 2 channels\n===================================================================================\n\nghost dog","torrent":{"xt":"urn:btih:adb7e0d456bad2202a7ca809caee0d2ceef4d285","amp;dn":"Japan%3A+Earth%27s+Enchanted+Islands+HDTV+x264+-+GHOST+DOG","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"adb7e0d456bad2202a7ca809caee0d2ceef4d285","infoHashBuffer":{"type":"Buffer","data":[173,183,224,212,86,186,210,32,42,124,168,9,202,238,13,44,238,244,210,133]},"announce":[],"urlList":[]}}