{"title":"Udemy - How to Become a Freelancer in 30 Days","uid":12160348,"size":1808152970,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:ae3c5e0b262d7b764befc0b52c4c51ce60b71507&amp;dn=Udemy+-+How+to+Become+a+Freelancer+in+30+Days&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"NepsterJay","files":30,"time":1437892574,"description":"How to Become a Freelancer in 30 Days\n\n5 Hours | Video: AVC (.MP4) 1280x720 30fps | Audio: AAC 44.1KHz 2ch | 1.68GB\nGenre: eLearning | Language: English\n\nMore than 100 million Americans consider themselves freelancers - skilled workers who work directly with clients in their niche of choice. The most successful of these freelancers enjoy exceptional freedom - working wherever they can carry a laptop.\n\n30 Days to Freelance Freedom shows you how to monetize your own creative skills, from content writing to graphic design to website development. You'll have access to 30 individual video lessons, one for each day in the first month of your freelance business. Each video focuses on a specific tactic or tool needed to build your freelance business from the ground up, including:\n\nBuilding Your Portfolio\nHow to Bid on Projects\nThe Software Needed to Manage Your Projects\nStarting a Simple Website that Attracts Attention\nHow to Use Content to Promote Your New Business\nHow to Get Constructive Feedback and Get Better\nThe Specific Things Needed in Your 60 Second Sales Pitch\nHow to Start Making Passive Income in Your Down Time\nThe Key Performance Indicators for Your First Month\nAlong with each video lesson, you'll receive a write up of what to expect and examples of each lesson in action.\n\n\nIf you are interested in becoming an online freelancer and want to know the first steps required to build your portfolio, find projects, build relationships with your clients, and start generating income, this course is for you.\n\nI started freelancing online only a few months out of college when I realized the sinking job market had little to offer. For four years I built my freelance business, created new contacts, and supported my family. I started an agency offering content marketing services from that freelance career and today utilize my skills as a copywriter, digital marketer, and entrepreneur in a number of ways online, including teaching courses like this one","torrent":{"xt":"urn:btih:ae3c5e0b262d7b764befc0b52c4c51ce60b71507","amp;dn":"Udemy+-+How+to+Become+a+Freelancer+in+30+Days","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ae3c5e0b262d7b764befc0b52c4c51ce60b71507","infoHashBuffer":{"type":"Buffer","data":[174,60,94,11,38,45,123,118,75,239,192,181,44,76,81,206,96,183,21,7]},"announce":[],"urlList":[]}}