{"title":"Robert Santelli, Emily Davidson, Hard travelin': the life and le","uid":12205876,"size":1616851,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:af5c8f2117fe83d4784cab20cca62d66dffbe380&amp;dn=Robert+Santelli%2C+Emily+Davidson%2C+Hard+travelin%27%3A+the+life+and+le&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Hand_of_Doom","files":3,"time":1438954793,"description":"For the first ever American Music Masters event sponsored by the Rock and Roll Hall of Fame and Museum, musicians and folkies came together to salute the life and legacy of Woody Guthrie, America's folk troubadour. With contributions from Guthrie's son Arlo and his longtime friends Pete Seeger and Harold Leventhal, and with new appreciations and insights provided by scholars and critics, Hard Travelin' continues that celebration, offering a new understanding of Guthrie's contribution to America's music and culture. It is illustrated with photographs and drawings, many never-before-seen, from the Woody Guthrie Archives. Guthrie's songs -- such as &quot;&quot;&quot;&quot;This Land Is Your Land,&quot;&quot;&quot;&quot; &quot;&quot;&quot;&quot;Pretty Boy Floyd,&quot;&quot;&quot;&quot; or &quot;&quot;&quot;&quot;Roll on Columbia&quot;&quot;&quot;&quot; -- are still known and sung by many Americans, while the story of his life has taken on a mythic cast -- the modern troubadour, the hobo balladeer and union supporter, the wandering folk singer who heard and wrote in the voice of the people. Guthrie's influence is felt not only whenever someone sings one of his songs, but any time a modern folk group or rocker sings a protest song or joins a social or political cause. In this book, Guthrie's family and friends offer personal and often poignant recollections of his life. Noted writers such as Dave Marsh, David Shumway, and Robert Cantwell shed new light on the Guthrie legacy, including an expanded appreciation of his impact on rock and roll, through such figures as Bob Dylan and Bruce Springsteen. They also assess Guthrie's place in the political and social movements of his time, especially his support for unions and for the communist party; his attitudes toward race; and the little-studied topic of his visual art, the often very personal drawings, doodles, sketches, and paintings that he produced throughout his life. The book concludes with a valuable biblio/discography","torrent":{"xt":"urn:btih:af5c8f2117fe83d4784cab20cca62d66dffbe380","amp;dn":"Robert+Santelli%2C+Emily+Davidson%2C+Hard+travelin%27%3A+the+life+and+le","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"af5c8f2117fe83d4784cab20cca62d66dffbe380","infoHashBuffer":{"type":"Buffer","data":[175,92,143,33,23,254,131,212,120,76,171,32,204,166,45,102,223,251,227,128]},"announce":[],"urlList":[]}}