{"title":"A Backpacker's Guide to Making Every Ounce Count","uid":12155301,"size":11843177,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b11add968c157e19a12e8f32c2fbc42457802afb&amp;dn=A+Backpacker%27s+Guide+to+Making+Every+Ounce+Count&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"mdusanjay","files":1,"time":1437768337,"description":" Steven Lowe, &quot;A Backpacker's Guide to Making Every Ounce Count: Tips and Tricks for Every Hike&quot;\n\n2015 | ISBN-10: 1632206943 | 160 pages | EPUB | 11 MB\n\nPacking Light was written by an avid outdoorsman, for those interested in knowing how a Gram Weenie thinks. If you are interested in lightening your pack a few ounces at a time, this book covers that very subject. Steven Lowe discusses how he used to pack for a trip and how he learned from the so-called &quot;experts&quot;. After following their advice, he ended up with a very heavy pack and soon realized that there had to be a lighter way to backpack. Packing Light offers tips that may allow you to approach your pack from a different point of view, like cutting the tags from your clothes and cutting your toothbrush in half--all in the name of shaving a few ounces of weight. When planning a trip, you need to look at your gear and ask questions like, &quot;How many ounces can I shave from this item?&quot; This book offers some ideas on how to lighten a few ounces from any pack, reduce the weight on your Big Three, and help you define just what type of backpacker you are--a lightweight or an ultra-lightweight backpacker. There are sixteen ounces in a pound. If you can shave four ounces from four areas in your pack, you just shaved one pound from your pack. Every ounce truly does count","torrent":{"xt":"urn:btih:b11add968c157e19a12e8f32c2fbc42457802afb","amp;dn":"A+Backpacker%27s+Guide+to+Making+Every+Ounce+Count","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b11add968c157e19a12e8f32c2fbc42457802afb","infoHashBuffer":{"type":"Buffer","data":[177,26,221,150,140,21,126,25,161,46,143,50,194,251,196,36,87,128,42,251]},"announce":[],"urlList":[]}}