{"title":"Charisma School - The 10 Steps to Confidence and Inner Power","uid":12147500,"size":295594852,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:b219d0971e625f49fecf18df87a35e26a9f21b03&amp;dn=Charisma+School+-+The+10+Steps+to+Confidence+and+Inner+Power&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"acer47x","files":13,"time":1437508136,"description":"The goal of this course is to exponentially improve your Self-Confidence and Inner Power using the Charisma School tried and tested techniques. Confidence and Inner Power are not a misty &quot;feel good&quot; feeling that is independent of our actions in the world. It is fundamentally our understanding that we are in control of our response to whatever life throws our way. We won't be overwhelmed by life; we deal with it and take our right to happiness and power.\n\nYour Inner Power and Self-Confidence are EARNED, every minute of every day you are doing something that is either building your confidence or destroying it... in this course we want you to make sure you're doing the right things to build it.\n\nWith this course, you can become prepared to deal with life's up and downs, but, more specifically, you have specific exercises and techniques in order to change your behavior with everyone around you; most likely, these techniques and exercises go against the behaviors you've been having all your life.\n\nBut think about it for a second...\n\n\nIf you have lack of Confidence NOW it's because your habits, behaviors and the overall way of thinking are NOT optimized to have that superior level of Self-Confidence that you now seek. So it's natural that you have to change some deeply ingrained habits and behaviors in order to change it.\n\nInvesting in this course might have been the best decision of your life. IF - and only if - you follow it through the end, you have the ability to develop a superior level of Self-Confidence and Inner Power that can radically change the course of your life.\n\n\nStart by watching and reading the three sections immediately below this paragraph. In them, you'll understand the fundamentals of Inner Power &amp; Confidence, you'll also be introduced to the 5 Basic Tenets of Inner Power, understand how the course works and how to take the most out of it","torrent":{"xt":"urn:btih:b219d0971e625f49fecf18df87a35e26a9f21b03","amp;dn":"Charisma+School+-+The+10+Steps+to+Confidence+and+Inner+Power","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b219d0971e625f49fecf18df87a35e26a9f21b03","infoHashBuffer":{"type":"Buffer","data":[178,25,208,151,30,98,95,73,254,207,24,223,135,163,94,38,169,242,27,3]},"announce":[],"urlList":[]}}