{"title":"RussellBrandDocsFromAddicitionToRecoveryEndTheDurgsWar[MPup]","uid":12163113,"size":564144900,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:b3b5784b13043fc8f19d56958f78198bf4706c85&amp;dn=RussellBrandDocsFromAddicitionToRecoveryEndTheDurgsWar%5BMPup%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"makinapufterpup","files":4,"time":1437959636,"description":"Russell.Brand.BBC.Documentaries.From.Addiction.to.Recovery.and.End.The.Drugs.War.360p.LDTV.ABC.AU.WEBRIP.[MPup]\nLow-Definition Television (LDTV) ABC iview WEBRIP: 640x360\n\nTwo Russell Brand Documentaries. One aired on BBC in 2012; The other aired in 2014.\n\n[img]http://extraimago.com/images/2015/07/26/68ea73202256f14300a00876b9bce20c.png[/img]\n\n[img]http://extraimago.com/images/2015/07/26/92d81d6bb7bf89dcd587be61c56b994a.png[/img]\n\n[b]BBC.Documentaries.2012.08.16.Part.1.Russell.Brand.From.Addiction.to.Recovery.360p.LDTV.ABC.AU.WEBRIP.[MPup][/b]\nLow-Definition Television (LDTV) ABC iview WEBRIP: 640x360\n\nFormat: MPEG-4\nSize: 640x360\nFrameRate: 25.000 fps\nAudioCodec: AAC\nChannels: 2 channels\nSamplingRate: 44.1 KHz\n\nThe story of how Russell Brand successfully battled heroin addiction is at the heart of this eye-opening and searingly honest, personal film in which Brand challenges how society deals with addicts and addiction.\n\n[img]http://extraimago.com/images/2015/07/26/dd6df704b9f3ea0d0aef1cc804c2dc76.jpg[/img]\n\n\n[b]BBC.Documentaries.2014.12.15.Part.2.Russell.Brand.End.The.Drugs.War.360p.LDTV.ABC.AU.WEBRIP.[MPup][/b]\nLow-Definition Television (LDTV) ABC iview WEBRIP: 640x360\n\nFormat: MPEG-4\nSize: 640x360\nFrameRate: 25.000 fps\nAudioCodec: AAC\nChannels: 2 channels\nSamplingRate: 44.1 KHz\n\nRussell Brand sets out to find out how other countries are tackling problems of drug abuse and to explore how the framework of criminalisation implicit in the 'war on drugs' produces enormous harm in the treatment of addicts.\n\n[img]http://extraimago.com/images/2015/07/26/557d4214fb865f29552dbb3b9ec61ef5.jpg[/img]\n\nThe documentary Russell Brand made for BBC Three in 2012 concluded with him giving evidence to the Home Affairs Select Committee. Drawing on his own experience of drug taking and recovery, he advocated treating addiction as a health issue rather than a criminal problem and underlined his own belief that abstinence is the best way to help addicts.\n\nSince then the Committee has reported its findings, concluding that the British drugs laws were failing and that it was a 'now or never' moment to reform them. But David Cameron didn't agree, insisting that the drugs policy is working in Britain and that we should 'stick at it'.\n\nIn this personal journey for BBC Three, Russell Brand sets out to challenge that point of view. He wants to find out how other countries are tackling their problems of drug abuse and to explore how the framework of criminalization implicit in the 'war on drugs' produces enormous harm in the treatment of addicts. Russell believes that 'a shift' is happening in the way that people view drug addiction. But to really change things he needs to persuade those who have power.\n\nRussell starts on the frontline of the 'war on drugs' by joining the Met Police as they carry out dawn drug raids, and ends up sharing a police cell with a young addict who has been in and out of prison since she began taking drugs aged 12. He witnesses the dangers of street addiction in Birmingham, but is as shocked by what he sees in the legal 'drug-consumption room' he visits in Berne, capital of conservative Switzerland.\n\nAt a drug recovery conference, Russell is drawn into an argument about abstinence versus government methadone programmes, but also finds an unlikely ally for his campaign in a Tory lord. At a UN drugs conference in Vienna he meets the politician who in 2001 decriminalized drugs in Portugal. What Russell discovers from him informs his impassioned plea at the end of the conference that drugs should be decriminalized.\n\nAs he takes his argument public, Russell finds his views are challenged by those who say that the public fear that lifting criminalization will also lift drug use. But a second encounter with the young addict he met during the Met drug raid (who, since then, has been in prison, been released and is back on drugs) bolsters his belief.\n\nRussell meets the deputy prime minister, Nick Clegg, who surprises him by agreeing in principle that the 'war on drugs' is futile and unsuccessful, but then frustrates him by explaining the lack of political will to move forward quickly to change things for the better.\n\nRemarkably, just three weeks later a Home Office-sponsored report is published, concluding that there is no evidence that tough laws lessen drug use. The shift in attitude is permeating high levels of government - but not, as it turns out, the very top. Just as happened with the Home Affairs Select Committee, the Government response has been to disagree and to restate that they were happy with the status quo. Russell sets out to find a Tory politician who can explain the Government's thinking","torrent":{"xt":"urn:btih:b3b5784b13043fc8f19d56958f78198bf4706c85","amp;dn":"RussellBrandDocsFromAddicitionToRecoveryEndTheDurgsWar%5BMPup%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b3b5784b13043fc8f19d56958f78198bf4706c85","infoHashBuffer":{"type":"Buffer","data":[179,181,120,75,19,4,63,200,241,157,86,149,143,120,25,139,244,112,108,133]},"announce":[],"urlList":[]}}