{"title":"Railworks TS2015 Just Trains CRH380A High Speed Train","uid":12133436,"size":60858355,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:b3cab198f3c8a2e885854f7275e6a6d123428329&amp;dn=Railworks+TS2015+Just+Trains+CRH380A+High+Speed+Train&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"TS2015","files":1,"time":1437117683,"description":"The CRH380A is the newest generation of Chinese high speed train, capable of running at 380 km/h and one of the fastest and most advanced production trains in the world.\n\nThe CRH380A uses state-of-the-art flat-screen glass panels to display the train information as well as the route speed and signal data from suitably equipped routes. It can be manually driven or set to use the on-board computers to drive the train from a standing start at your departure station to your destination with not much more effort than adjusting the cruise control to comply with the speed limits.\n\nAs well as the standard CRH380A Passenger train a CRH380AJ-0203 Comprehensive Inspection Train version is included.\n\nThe CRH380A is designed for and interacts with the CTCS-3 (China Train Controlling System) speed and signalling system that is included in the Chengdu-Suining High Speed Route and the Southwest China High Speed Rail Network routes that are both available to purchase from Just Trains.\n\nHighly detailed models\nFull custom sounds\nDetailed passenger view including First Class and Second Class Coach\nAdjustable wiper speed\nPantograph spark/flash\nDetailed state-of-the-art driver's cab\nCruise Control\nFlat-screen in-cab displays which show the next signal aspect, distance to next signal, next speed limit and distance to it on suitably equipped routes, Cruise Control set speed, brake pressures, door status, pantograph information and more\nOperational speed monitor\nAudible driver alerts\nRealistic and definable train service number display on the exterior of the cars, set from the driver's cab\nLight lens flare effects\nRain effects on windscreen and carriage windows\nCRH380A passenger train\nCRH380AJ-0203 Comprehensive Inspection Train","torrent":{"xt":"urn:btih:b3cab198f3c8a2e885854f7275e6a6d123428329","amp;dn":"Railworks+TS2015+Just+Trains+CRH380A+High+Speed+Train","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b3cab198f3c8a2e885854f7275e6a6d123428329","infoHashBuffer":{"type":"Buffer","data":[179,202,177,152,243,200,162,232,133,133,79,114,117,230,166,209,35,66,131,41]},"announce":[],"urlList":[]}}