{"title":"Mathematica by Example Revised ed","uid":12203752,"size":21883561,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b3f4d1c571842dbf4ac5334c56376f7941b50e9a&amp;dn=Mathematica+by+Example+Revised+ed&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"clouderone","files":1,"time":1438881921,"description":"Mathematica by Example Revised ed - Martha L. Abell, James P. Braselton (Academic Press, 1994).pdf\n\nISBN 0120415305\n\n(from preface):\nSome of the changes in the revised edition include:\n1. Table of contents. The table of contents includes all chapters, section headings, and sub-section headings. Along with the index, we hope that users will be able to locate information quickly and easily.\n2. Additional examples. We have considerably expanded the topics in Chapters 1 through 6. The results should be more useful to instructors, students, business people, engineers, and other professionals using Mathematica on a variety of platforms. In addition, several sections have been added to help make locating information easier for the user.\n3. Index. The index to the text is substantially more comprehensive than that in the first edition. Consequently, mathematical examples of commands and elementary sequences of commands will be easier to locate. In addition, commands listed in the index are cross-referenced with frequently used options. Functions contained in packages are cross-referenced both by package and alphabetically","torrent":{"xt":"urn:btih:b3f4d1c571842dbf4ac5334c56376f7941b50e9a","amp;dn":"Mathematica+by+Example+Revised+ed","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b3f4d1c571842dbf4ac5334c56376f7941b50e9a","infoHashBuffer":{"type":"Buffer","data":[179,244,209,197,113,132,45,191,74,197,51,76,86,55,111,121,65,181,14,154]},"announce":[],"urlList":[]}}