{"title":"CSI.S15E01.HDTV.x264-LOL","uid":11127872,"size":303158364,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:b4686daea5bf3df703ed42f410629dcc3b628b85&amp;dn=CSI.S15E01.HDTV.x264-LOL&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Thhaque","files":1,"time":1411948959,"description":"[b]CSI - Crime Scene Investigation\n\n[IMG]http://i.imgur.com/TPqUEGO.jpg[/IMG]\n\nGenre: Action, Crime, Drama, Mystery, Thriller\nYear: 2013\nCountry: USA\nRuntime: 42 min\nProducer: Anthony E. Zuiker\nCast: Ted Danson, Elisabeth Shue, George Eads, Paul Guilfoyle, Eric Szmanda, Robert David Hall, Paul Guilfoyle\n\n.: Plot :.\nThis show follows the nights of the detectives working at the Las Vegas Police Department Crime Scene Investigations bureau. Being the second busiest crime lab in America, CSI officers use the best scientific and technical methods to solve puzzles and catch criminals.\n\nThe Las Vegas PD Criminalistics Division is the #2 crime lab in the US, solving crimes that practically every other crime lab has given up on. Led by hard-nosed Captain Jim Brass and quirky Gil Grissom, they track down perpetrators using scientific analysis and the occasional leap in logic.\n\nIn the city of Las Vegas, Nevada, its reputation for providing instant success for those willing to try their luck draws in the hopeful and the naive. This constant influx of visitors also provides ripe targets for criminals of all varieties, confident they will never be caught. Unfortunately for them, most are proven wrong by the Las Vegas Police Department's night shift Crime Scene Investigations unit led by Gill Grissom. With almost obsessive dedication towards his quest for the facts, he and his elite team of investigators work various perplexing cases using scientific skills and equipment that are capable of finding valuable clues from the most seemingly unlikely sources. In a city of empty dreams and false fronts, Gill Grissom leads the quest for the one thing that can cut through the lies to the truth and justice, the evidence.[/b]","torrent":{"xt":"urn:btih:b4686daea5bf3df703ed42f410629dcc3b628b85","amp;dn":"CSI.S15E01.HDTV.x264-LOL","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b4686daea5bf3df703ed42f410629dcc3b628b85","infoHashBuffer":{"type":"Buffer","data":[180,104,109,174,165,191,61,247,3,237,66,244,16,98,157,204,59,98,139,133]},"announce":[],"urlList":[]}}