{"title":"John Leslie Mackie's Philosophical Writings","uid":11071210,"size":94940403,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b4c36f6a7b1e9961e4872c78f4f3bfdf0f85ae26&amp;dn=John+Leslie+Mackie%27s+Philosophical+Writings&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"philosophi","files":-1,"time":1411269058,"description":"John Leslie Mackie's Philosophical Writings\n\nJohn Leslie Mackie was an Australian philosopher, originally from Sydney. He made significant contributions to the philosophy of religion, metaphysics, and the philosophy of language, and is perhaps best known for his views on meta-ethics, especially his defense of moral skepticism.\n\nHe authored six books. His most widely known, Ethics: Inventing Right and Wrong (1977), opens by boldly stating that &quot;There are no objective values.&quot; It goes on to argue that because of this ethics must be invented, rather than discovered.\n\nMackie was most well known for his contributions to the fields of meta-ethics, philosophy of religion, and metaphysics. In meta-ethics, he took a position that he called moral skepticism (though, arguably, it would be better termed &quot;moral nihilism&quot;), arguing against the objective existence of right and wrong as intrinsically normative entities on fundamental grounds as unsure about what kinds of things such entities would be, if they existed.\n\nHis perhaps most widely known work, Ethics: Inventing Right and Wrong, bluntly begins with the opening sentence &quot;There are no objective values&quot;. He uses several arguments to support this claim that objective values are false. He argues that some aspects of moral thought are relative, and that objective morals require an absurd intrinsic action-guiding feature. Most of all, he thinks it is very unclear how objective values could supervene on features of the natural world (see the Argument from queerness). Fourth, he thinks it would be difficult to justify our knowledge of &quot;value entities&quot; or account for any links or consequences they would have. And, finally, he thinks it is possible to show that even without any objective values, people would still have reason to firmly believe in them (hence, he claims that it is possible for people to be mistaken or fooled into believing that objective values exist). The Times called the book &quot;a lucid discussion of moral theory which, although aimed at the general reader, has attracted a good deal of professional attention.&quot;\n\nConcerning religion, he was well known for vigorously defending atheism, and also arguing that the problem of evil made untenable the main monotheistic religions. His criticisms of the free will defense are particularly significant. He argued that the idea of human free will is no defense for those who wish to believe in an omnipotent being in the face of evil and suffering, as such a being could have given us both free will and moral perfection, thus resulting in us choosing the good in every situation. In 1955 he published one of his most reprinted articles, &quot;Evil and Omnipotence&quot;, summarizing his view that the simultaneous existence of evil and an all-powerful, all-knowing and all-good God was &quot;positively irrational&quot;. Mackie's views on this so-called logical problem of evil prompted Alvin Plantinga to respond with his version of the Free Will Defense to which Mackie later responded to in his The Miracle of Theism.\n\nIn metaphysics, Mackie made significant contributions relating to the nature of causal relationships, especially regarding conditional statements describing them and the notion of an INUS condition.\n\nUpon being given a copy of Richard Dawkins' The Selfish Gene as a Christmas present, he in 1978 wrote an article in the journal Philosophy praising the book and discussing how its ideas might be applied to moral philosophy. Philosopher Mary Midgley responded in 1979 with &quot;Gene-Juggling&quot;, an article arguing that The Selfish Gene was about psychological egoism, rather than evolution. This started a dispute between Mackie, Midgley, and Dawkins that was still ongoing at the time of Mackie's death.","torrent":{"xt":"urn:btih:b4c36f6a7b1e9961e4872c78f4f3bfdf0f85ae26","amp;dn":"John+Leslie+Mackie%27s+Philosophical+Writings","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b4c36f6a7b1e9961e4872c78f4f3bfdf0f85ae26","infoHashBuffer":{"type":"Buffer","data":[180,195,111,106,123,30,153,97,228,135,44,120,244,243,191,223,15,133,174,38]},"announce":[],"urlList":[]}}