{"title":"Battlestation Harbinger v1.1.2 APK (Android)","uid":12232521,"size":22917944,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:b4d101b2971bc1cbf53c08a13b14caa46180e72c&amp;dn=Battlestation+Harbinger+v1.1.2+APK+%28Android%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Pahly","files":1,"time":1439594550,"description":"Take command of a space ship in this epic sci-fi space adventure game, combining the game play\nof games like Faster Than Light (FTL), Out There and other space operas.\n\nBattlestation is a game series, consisting of mobile and PC games set in a deep and rich sci-fi world. Try also Battlestation: First Contact, the best roguelike tower defense game that started it all.\n\nCommander! Your next mission is to download this game. It is time to stop reaching for the stars and instead join the Battlestation universe and experience it first hand! - Admiral Geezer\n\nBattlestation: Harbinger is a real-time (RTS) space strategy game. Set in a universe, where 3 other species and an unknown threat are nearby, you will command many of the best ships the human race has to offer. Discover new technology and enjoy a gripping story this space adventure simulation game offers.\n\nExperience the intense atmosphere of adventuring deep into the space and trying to save the human race. Dangerous and mysterious missions await you as you encounter challenges only a real space ship commander can face.\nMany achievements to unlock\nIntense and gripping sci-fi space adventure simulation\nExplore a galaxy full of mysterious places and dangerous encounters\nCarry out missions, discover new technnology and help humanity survive\nMany ships and weapons to equip and upgrade\n\nWhat's in this version : (Updated : Aug 13, 2015)\nCrash fix\nfixed a bug when buying from battlestation\nKeep reporting bugs and we will fix it!\nRequired Android O/S : 2.1","torrent":{"xt":"urn:btih:b4d101b2971bc1cbf53c08a13b14caa46180e72c","amp;dn":"Battlestation+Harbinger+v1.1.2+APK+%28Android%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b4d101b2971bc1cbf53c08a13b14caa46180e72c","infoHashBuffer":{"type":"Buffer","data":[180,209,1,178,151,27,193,203,245,60,8,161,59,20,202,164,97,128,231,44]},"announce":[],"urlList":[]}}