{"title":"The Engineering Project - Its Nature, Ethics, and Promise","uid":12163195,"size":2306336,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b4fae3f0deeaedadf403f5659cd15b3f2c123300&amp;dn=The+Engineering+Project+-+Its+Nature%2C+Ethics%2C+and+Promise&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"clouderone","files":1,"time":1437965560,"description":"The Engineering Project - Its Nature, Ethics, and Promise - Gene Moriarty (Pennsylvania State University, 2008).pdf\n\nISBN 9780271032542\n\nWe all live our daily lives surrounded by the products of technology that make what we do simpler, faster, and more efficient. These are benefits we often just take for granted. But at the same time, as these products disburden us of unwanted tasks that consumed much time and effort in earlier eras, many of them also leave us more disengaged from our natural and even human surroundings. It is the task of what Gene Moriarty calls focal engineering to create products that will achieve a balance between disburdenment and engagement: How much disburdenment will be appropriate while still permitting an engagement that enriches one's life, elevates the spirit, and calls forth a good life in a convivial society? One of his examples of a focally engineered structure is the Golden Gate Bridge, which draws people to it, enlivens and elevates the human spirit, and resonates with the world of its congenial setting. Humans, bridge, and world are in tune. These values of engagement, enlivenment, and resonance are key to the normative approach Moriarty brings to the profession of engineering, which traditionally has focused mainly on technical measures of evaluation such as efficiency, productivity, objectivity, and precision. These measures, while important, look at the engineered product in a local and limited sense. But from a broader perspective, what is locally benign may present serious moral problems, undermining social justice, environmental sustainability, and health and safety of affected parties. It is this broader perspective that is championed by focal engineering, the subject of Part III of the book, which Moriarty contrasts with modern engineering in Part I and pre-modern engineering in Part II","torrent":{"xt":"urn:btih:b4fae3f0deeaedadf403f5659cd15b3f2c123300","amp;dn":"The+Engineering+Project+-+Its+Nature%2C+Ethics%2C+and+Promise","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b4fae3f0deeaedadf403f5659cd15b3f2c123300","infoHashBuffer":{"type":"Buffer","data":[180,250,227,240,222,234,237,173,244,3,245,101,156,209,91,63,44,18,51,0]},"announce":[],"urlList":[]}}