{"title":"Adguard for Mac (v1.1.0) [Mac OS X] [Multi] (2015)","uid":12294405,"size":45103953,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:b524d0207c940aebe13dec1c791f4f909fed5f94&amp;dn=Adguard+for+Mac+%28v1.1.0%29+%5BMac+OS+X%5D+%5BMulti%5D+%282015%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Woitler","files":1,"time":1440602860,"description":"Program name: Adguard\nProgram Type: Anti-Banner, Web Filter, Anti-Phishing and etc.\nVersion: 1.1.0\nRelease date: August 26, 2015\nLanguage: English, Chinese, Korean, Russian, Portuguese and etc.\nOperating system: OS X\nFile size: 43 Mb\n----------------------------------------------------\nDescription:\nAdguard - is one of a kind of full ad blocker for Mac OS X. It is a universal program that contains all the necessary options for the most comfortable using the Internet. Ad Blockers, warning or blocking phishing and other online threats and protection of your personal data on the Internet.\n\nAdguard able to block advertising absolutely in any application. In contradistinction to other existing solutions for Internet filtering, Adguard was created specifically for the Mac, which allows you to block advertising are not only in browsers, but also in the applications installed on your device.\n----------------------------------------------------\nAdvantages of the program:\n1. Works in all popular browsers;\n2. Designed to block all types of advertising;\n3. Easy to use, blocks ads insensibly in the background mode;\n4. Warns about the danger during the transition to suspicious websites;\n5. Has the module (Assistant Adguard) to manage the program directly from your browser;\n6. Prevents from counters and systems analysts, prohibits tracking user activity online.\n----------------------------------------------------\nSystem requirements:\nOperating System: OS X 10.7 and beyond\nBrowsers: Any (Safari, Google Chrome, Opera &amp; Opera Next etc.)\nDisk: 100 Mb free hard disk space.\n----------------------------------------------------\nWhat's new in version 1.1.0?\n1. Added function to send a report in case of an unexpected Adguard shutdown.\n2. Added tutorial screen at Adguard first launch.\n3. Added OCSP Stapling support.\n4. Added localizations: Chinese (Simplified), Polish, Portuguese (Brazil), Slovak, Korean.\n5. Changed SSL connections encrypting mode to a more modern one.\n6. Improved root certificate and private key generation for SSL connections.\n7. Fixed Logjam vulnerability (now Adguard doesn't filter connections with weak keys).\n8. Improved mechanism of SSL connections processing.\n9. Significantly extended list of browsers filtered by default.\n10. Now, in case of its absence, Adguard automatically suggests to install root certificate into Firefox to filter HTTPS-websites.\n11. Improved way of root certificate installation into Mozilla-based browsers.\n12. Improved security of installing Adguard Assistant to web pages.\n13. Improved Adguard API extensions security.\n14. Confined access to userscripts API functions.\n15. Reworked installation process, now Adguard will work correctly after restoring Mac from Time Machine.\n16. Improved filtering rules correctness verification.\n17. Now Adguard system components are stored in the folder shared for all users.\n18. Now upon switching Mac to sleep mode, Adguard closes current network connections.\n19. Fixed situation when Adguard won't respond to users actions while watching a video on YouTube.\n20. Fixed error previously led to Adguard crash while surfing a website with incorrect HTML.\n21. Fixed an error previously led to rules with specific symbols being excluded from filtering process.\n22. Fixed an error previously led to shutdown when exiting Adguard","torrent":{"xt":"urn:btih:b524d0207c940aebe13dec1c791f4f909fed5f94","amp;dn":"Adguard+for+Mac+%28v1.1.0%29+%5BMac+OS+X%5D+%5BMulti%5D+%282015%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b524d0207c940aebe13dec1c791f4f909fed5f94","infoHashBuffer":{"type":"Buffer","data":[181,36,208,32,124,148,10,235,225,61,236,28,121,31,79,144,159,237,95,148]},"announce":[],"urlList":[]}}