{"title":"Wolf Hall S01E05 - Crows HDTV x264 - GHOST DOG","uid":12139946,"size":348916051,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:b61634189144e38cb1ebcc4f1d5a2377cf3eaf41&amp;dn=Wolf+Hall+S01E05+-+Crows+HDTV+x264+-+GHOST+DOG&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"marxph","files":2,"time":1437325638,"description":"Historical drama chronicling the rise of Thomas Cromwell, the son of a humble blacksmith who became King Henry VIII's chief minister, as he navigated the corridors of power in the Tudor court.\n\nEpisode 5 of 6: Crows\n\nThe Act of Supremacy has declared Henry supreme head of the church in England. But the Holy Roman Emperor, and his ambassador, Eustache Chapuys, have refused to recognise either his new title or his marriage to Anne Boleyn.\n\nCromwell visits Katherine. She is growing frail and tired and she longs to see her daughter Mary. Cromwell pities Katherine and tries to persuade the King to allow Chapuys to visit her, but Henry refuses - until the Emperor acknowledges Anne as his lawful wife, Henry will not make any allowances on diplomacy.\n\nWith Anne pregnant again and away from court, Henry begins to take notice of Jane Seymour. The Seymours enlist Cromwell's help in their dealings with the King.\n\nAnne is aware that Cromwell is conspiring with the Seymours and reminds him that she made Cromwell who he is today. When Katherine dies, Anne celebrates - Katherine had always been blamed for Anne's failure to produce a male heir and Anne is now certain her pregnancy will deliver a boy.\n\nThe King takes part in a jousting tournament and is nearly killed. Cromwell becomes acutely aware that he owes his position solely to Henry and that without the King's support his enemies would destroy him. Mercifully Henry makes a full recovery but, in the shock at the news of his fall, Anne miscarries.\n\nHenry fears that he will never have a son with Anne, convinced that she is cursed and that he was tricked into marriage by her. He wants a new wife and, as ever, Cromwell is tasked with delivering this.\n\n===================================================================================\nSource.......: HDTV\nSize.........: 332MB\nFormat.......: mp4\nResolution...: 640x360\nVideo........: h.264, 703Kbps @ 25 fps\nAudio........: aac, 93Kbps, 48 KHz, 2 channels\n===================================================================================\n\nghost dog","torrent":{"xt":"urn:btih:b61634189144e38cb1ebcc4f1d5a2377cf3eaf41","amp;dn":"Wolf+Hall+S01E05+-+Crows+HDTV+x264+-+GHOST+DOG","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b61634189144e38cb1ebcc4f1d5a2377cf3eaf41","infoHashBuffer":{"type":"Buffer","data":[182,22,52,24,145,68,227,140,177,235,204,79,29,90,35,119,207,62,175,65]},"announce":[],"urlList":[]}}