{"title":"Nelson DeMille - Radiant Angel","uid":12211533,"size":302817906,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:b6c4e2eac60a507d233a0b4cafcc4b487794bad1&amp;dn=Nelson+DeMille+-+Radiant+Angel&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":9,"time":1439100604,"description":"64k bps CBR\n\nAfter a showdown with the notorious Yemeni terrorist known as The Panther, John Corey has left the Anti-Terrorist Task Force and returned home to New York City, taking a job with the Diplomatic Surveillance Group. Although Corey's new assignment with the DSG-surveilling Russian diplomats working at the U.N. Mission-is thought to be &quot;a quiet end,&quot; he is more than happy to be out from under the thumb of the FBI and free from the bureaucracy of office life.\n\nBut Corey realizes something the U.S. government doesn't: The all-too-real threat of a newly resurgent Russia.\n\nWhen Vasily Petrov, a colonel in the Russian Foreign Intelligence Service posing as a diplomat with the Russian U.N. Mission, mysteriously disappears from a Russian oligarch's party in Southampton, it's up to Corey to track him down. What are the Russians up to and why? Is there a possible nuclear threat, a so-called radiant angel? Will Corey find Petrov and put a stop to whatever he has planned before it's too late? Or will Corey finally be outrun and outsmarted, with America facing the prospect of a crippling attack unlike anything it's ever seen before?\n\nPrescient and chilling. DeMille's new novel takes us into the heart of a new Cold War with a clock-ticking plot that has Manhattan in its crosshairs","torrent":{"xt":"urn:btih:b6c4e2eac60a507d233a0b4cafcc4b487794bad1","amp;dn":"Nelson+DeMille+-+Radiant+Angel","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b6c4e2eac60a507d233a0b4cafcc4b487794bad1","infoHashBuffer":{"type":"Buffer","data":[182,196,226,234,198,10,80,125,35,58,11,76,175,204,75,72,119,148,186,209]},"announce":[],"urlList":[]}}