{"title":"TS Cuckolds (Trans500 Studios - April 23rd, 2015).avi","uid":12252324,"size":1706214634,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:b70bf67bfc668e634e1805e3bc11e1226acadfdb&amp;dn=TS+Cuckolds+%28Trans500+Studios+-+April+23rd%2C+2015%29.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Lost213","files":1,"time":1440042998,"description":"TS Cuckolds a Trans500 film begins Mariana Pink with her man and his daughter Jenny out at the park. After a bit of a heartfelt moment, they go back home and send Jenny to bed because Mariana's man has a a present for her: big black cock. The scene switches to her in her pink lingerie and the man sitting to the side while Mark Anthony takes his girl. Jenny peeks in the room shocked and sits with her father and watches and then joins in blowing Mark with Mariana. Then Jenny blows Mariana while Mariana goes down on Mark. Then Mariana and the Mark spit roast Jenny. Mariana fucks her while Mark gets blown. Then they switch to Mark fucking Mariana doggy style, then reverse cowgirl, and then Mark fucks Jenny from behind while they lay side by side. Shortly after, Mariana subs in and then the guy pulls out and busts a small cumshot on Mariana's cock and belly. Next is Sunday Valentina with her older man. He has a gift for her and he quickly brings in Mark. After some foreplay, Sunday starts blowing Mark while her man sits on the couch watching. Then Mark takes her from behind doggy style, reverse cowgirl and then while she lays on her side while he stands. Mark fucks Sunday on her back while she strokes herself. After a bit, Mark gives her a cumshot that drips down her sexy neck. Finally the scene closes with Sunday stroking herself until she cums. The next scene opens with Mark showing a home to a man and his girl, Cindy Toomuch. He gives them the price of the home, but it's too expensive for him so he offers Cindy to him and he accepts the offer. Mark rims and fingers her a bit then she goes down on him. Then Mark fucks her doggy on the table and on her side. They switch to reverse cowgirl while her uncut cock flops up and down for the camera, then she switches to cowgirl and on her back while she strokes herself. Not too long after, she cums on her belly and then he pulls out and cums on her taint. Last but not least is Natalia Rico. After a bit of chat, Mark comes in and after a bit of foreplay, Natalia goes down on him. Mark then fucks her on her back, doggy style, reverse cowgirl and from behind, side by side while she strokes herself until she cums on her chest and belly. Mark doesn't waste time and cums on her cock soon thereafter. Fin!\n\nScreens:\n &lt;a href=&quot;\nhttp://mega-pix.eu/image/I&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://mega-pix.eu/image/I&lt;/a&gt;","torrent":{"xt":"urn:btih:b70bf67bfc668e634e1805e3bc11e1226acadfdb","amp;dn":"TS+Cuckolds+%28Trans500+Studios+-+April+23rd%2C+2015%29.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b70bf67bfc668e634e1805e3bc11e1226acadfdb","infoHashBuffer":{"type":"Buffer","data":[183,11,246,123,252,102,142,99,78,24,5,227,188,17,225,34,106,202,223,219]},"announce":[],"urlList":[]}}