{"title":"Britains.Spending.Secrets.s01e02.ENG.SUBS.WEBRIP.[MPup]","uid":12297837,"size":1049172880,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:b73de21e72d92a4caa8d4d8e76d1b84abf35b634&amp;dn=Britains.Spending.Secrets.s01e02.ENG.SUBS.WEBRIP.%5BMPup%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"makinapufterpup","files":2,"time":1440647650,"description":"Britains.Spending.Secrets.s01e02.ENG.SUBS.WEBRIP.[MPup]\n\nFormat: MPEG-4\nSize: 1280x720\nDisplayAspectRatio: 16:9\nFrameRate: 25.000 fps\nAudioCodec: AAC\nChannels: 2 channels\nSamplingRate: 48.0 KHz\n\n[b]2 of 2[/b]\n\nTV presenter and journalist Anne Robinson continues her road trip, meeting people from across the wealth spectrum to discover whether we can spend our way to happiness.\n\n[img]http://extraimago.com/images/2015/08/27/368a73cdd8995e316ac88b883f7a73cc.jpg[/img]\n\n\nAnne Robinson admits that she loves to spend her money on her homes, clothes, family and friends - but what about the rest of us? Anne leaves the comfort of the studio to meet people from across the wealth spectrum to find out about their spending habits - from millionaires who spend with abandon to those who spend as little as possible.\n\nIn this second episode, Anne wants to know whether we can spend our way to happiness. First Anne meets billionaire John Caudwell, one of the richest men in the UK, who gives her a grand tour of his Â£90 million home. Surely if being able to buy whatever you want makes you happy, he must be one of the happiest men alive?\n\nNot having money to spend can have a devastating effect on people, as Anne discovers when she helps out at one of the UK's 800 food banks and meets Brian, who's fallen on hard times and depends on the food bank to survive.\n\nAnne meets Rosie, whose husband is a city banker. She needn't be frugal, but Rosie is an ethical shopper, and every purchase has to conform to her ethical rules. Anne is introduced to the joys of fast fashion when she goes on a shopping spree with Amina, who is on benefits and gets such joy from buying clothes on the cheap that she would rather do that than eat.\n\nAnne asks two families to come clean to each other about their spending. They have very different spending philosophies - the James family are bargain-hunting savers, and the Saunders' are label lovers who are prepared to splash out on the right brands. Can they each persuade the other that their way of spending will make the other family happier?\n\nFinally, Anne meets a bunch of skydiving pensioners who believe the key to happiness is to have shared experiences. Can they persuade Anne to join them?","torrent":{"xt":"urn:btih:b73de21e72d92a4caa8d4d8e76d1b84abf35b634","amp;dn":"Britains.Spending.Secrets.s01e02.ENG.SUBS.WEBRIP.%5BMPup%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b73de21e72d92a4caa8d4d8e76d1b84abf35b634","infoHashBuffer":{"type":"Buffer","data":[183,61,226,30,114,217,42,76,170,141,77,142,118,209,184,74,191,53,182,52]},"announce":[],"urlList":[]}}