{"title":"Chemical Optimization Algorithm for Fuzzy Controller Design","uid":12153647,"size":3308525,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b8472cec3e853d06caece0c4ec7fb6e03b9c85a9&amp;dn=Chemical+Optimization+Algorithm+for+Fuzzy+Controller+Design&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"clouderone","files":1,"time":1437707813,"description":"Chemical Optimization Algorithm for Fuzzy Controller Design - Leslie Astudillo, Patricia Melin, Oscar Castillo (Springer, 2014).pdf\n\nISBN 9783319052441\n\nIn this book, a novel optimization method inspired by a paradigm from nature is introduced. The chemical reactions are used as a paradigm to propose an optimization method that simulates these natural processes. The proposed algorithm is described in detail and then a set of typical complex benchmark functions is used to evaluate the performance of the algorithm. Simulation results show that the proposed optimization algorithm can outperform other methods in a set of benchmark functions.\n\nThis chemical reaction optimization paradigm is also applied to solve the tracking problem for the dynamic model of a unicycle mobile robot by integrating a kinematic and a torque controller based on fuzzy logic theory. Computer simulations are presented confirming that this optimization paradigm is able to outperform other optimization techniques applied to this particular robot application","torrent":{"xt":"urn:btih:b8472cec3e853d06caece0c4ec7fb6e03b9c85a9","amp;dn":"Chemical+Optimization+Algorithm+for+Fuzzy+Controller+Design","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b8472cec3e853d06caece0c4ec7fb6e03b9c85a9","infoHashBuffer":{"type":"Buffer","data":[184,71,44,236,62,133,61,6,202,236,224,196,236,127,182,224,59,156,133,169]},"announce":[],"urlList":[]}}