{"title":"The Masterson Inheritance - S01 to 03 - Comedy - MP3 - Slimoo","uid":12139799,"size":604084027,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:b854a958d5854fadcc6c918bff8b16572de1a7eb&amp;dn=The+Masterson+Inheritance+-+S01+to+03+-+Comedy+-+MP3+-+Slimoo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"_Slimoo_","files":21,"time":1437324019,"description":"The Masterson Inheritance - Series 01 to 03 + 3 Specials - Audio Comedy - BBC\n20 x 30 Minute Episodes + 1 x 40 Minutes - 128Kbps - Mp3 - Slimoo\n\n\nThe Masterson Inheritance was an improvised comedy series broadcast on BBC Radio 4 from 1993 to 1995 billed as &quot;an improvised historical saga of a family at war with itself.&quot; \n\nThere were three series and two Christmas specials. \n\nIn each programme the cast members would be given a particular historical setting, and, incorporating suggestions from the audience, would improvise that episode in the saga of the Masterson family.\n\nBasically think &quot;Who's Line Is It Anyway&quot; only 30 minutes long per sketch.\n\nCast:\nJosie Lawrence, \nPaul Merton, \nPhelim McDermott, \nCaroline Quentin, \nLee Simpson and \nJim Sweeney \n\n\nThe Masterson Inheritance - S01 - E01 - The Curse Of The Mastersons\nThe Masterson Inheritance - S01 - E02 - The Mastersons And Johnson\nThe Masterson Inheritance - S01 - E03 - Scurvy!\nThe Masterson Inheritance - S01 - E04 - The Sweat Of The Mastersons\nThe Masterson Inheritance - S01 - E05 - The Tatting Of The Mastersons\nThe Masterson Inheritance - S01 - E06 - The Mastersons Lose Everything\nThe Masterson Inheritance - S01 - E07 - The Stuffing Of The Mastersons \n\nThe Masterson Inheritance - S02 - E01 - Beware The Ides Of Masterson\nThe Masterson Inheritance - S02 - E02 - The Quest For The Other Rabbit's Foot\nThe Masterson Inheritance - S02 - E03 - Last Word To The Mastersons\nThe Masterson Inheritance - S02 - E04 - The Jousting Mastertons\nThe Masterson Inheritance - S02 - E05 - The Gangrene Of The Mastersons\nThe Masterson Inheritance - S02 - E06 - The Mastersons Go Down\n\nThe Masterson Inheritance - S03 - E01 - The Masterson's Magical Marquee (Part 1)\nThe Masterson Inheritance - S03 - E02 - The Masterson's Magical Marquee (Part 2)\nThe Masterson Inheritance - S03 - E03 - Masterson Rides Again\nThe Masterson Inheritance - S03 - E04 - The Masterson Bunch\nThe Masterson Inheritance - S03 - E05 - The Pain Of The Mastersons\nThe Masterson Inheritance - S03 - E06 - The St Valentine's Day Massterson\nThe Masterson Inheritance - S03 - E07 - The Mastersons Christmas Cracker\nThe Masterson Inheritance - S03 - E08 - The Marooned Mastersons \n\n\n. \n\nAudio Format : MP3\nDuration : 28mn 1s\nBit rate mode : Constant\nBit rate : 128 Kbps\nChannel(s) : 2 channels\nSampling rate : 44.1 KHz\nResolution : 16 bits","torrent":{"xt":"urn:btih:b854a958d5854fadcc6c918bff8b16572de1a7eb","amp;dn":"The+Masterson+Inheritance+-+S01+to+03+-+Comedy+-+MP3+-+Slimoo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b854a958d5854fadcc6c918bff8b16572de1a7eb","infoHashBuffer":{"type":"Buffer","data":[184,84,169,88,213,133,79,173,204,108,145,139,255,139,22,87,45,225,167,235]},"announce":[],"urlList":[]}}