{"title":"'70's Marvel Kaiju Rampage (Godzilla + Shogun Warriors)","uid":12135974,"size":318257173,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:b8cc12e607eec016ab2094f7c593298271ff60cd&amp;dn=%2770%27s+Marvel+Kaiju+Rampage+%28Godzilla+%2B+Shogun+Warriors%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Archivist_of_the_Damned","files":55,"time":1437176353,"description":"Some early attempts at licensed properties by Marvel from the bizarre decade known as the 1970's.  Doug Moench and Herb Trimpe, writer and penciler, were two of the most dependable workhorses in the Marvel creative stable during the Zeppelin decade. Shogun Warriors was based solely on the toy line which itself was a hodgepodge of separate and completely unrelated Giant Mecha and Kaiju characters aimed at Western markets. The comic was therefore created from whole clotch, and is very much a product of its era. Evel Keneval and the men in black are just a few of the elements thrown together to make this weird soup. One of the most frequent criticisms of the book is that it did not feature Dragon as one of the main characters.  Almost every letter page has a reference to the lack of this character in the series.  \n\nGodzilla, King of the Monsters was much the same case as Marvel seemingly only had the rights to the titular title character.  However, Moench and Trimpe, decided to create to thoroughly integrate the biz lizard into the Marvel Universe to amp up the storylines.  Dum Dum Duggan and Gabe Jones of SHIELD are prominent supporting charcters along with Big G interacting with Hank Pym, the Fantastic Four, Devil Dinosaur and Moon-Boy, Spider-Man, and the Avengers. Of course, there also includes a young male character of indeterminate age, Rob Takiguchi, and his giant robot Red Ronin.  No real dynamic female characters to be found in this series.  The closest the series comes to capturing the feel and flavor of the Toho movies is the &quot;Mega-Monsters&quot; story arc. That being said, I loved this book and all things Godzilla as a child.  \n\nThe lasting impact of these comics on modern day Marvel?  The incredibly thorny issue of Marvel continuity and Licensed characters.  Prime exampe, Red Ronin would continue to  be used sparingly in later Avengers comics without any reference to the robot's true origin or purpose. Fred Van Lente resurrected the Behemoth ship designed to hunt Gozilla, in the Incredible Hercules. Yuriko Takaguchi has become a supporting member of the mutant community in X-Men. \n\nIt's all big, goofy fun with no reason for deep thought in full color for a perfect summer read","torrent":{"xt":"urn:btih:b8cc12e607eec016ab2094f7c593298271ff60cd","amp;dn":"%2770%27s+Marvel+Kaiju+Rampage+%28Godzilla+%2B+Shogun+Warriors%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b8cc12e607eec016ab2094f7c593298271ff60cd","infoHashBuffer":{"type":"Buffer","data":[184,204,18,230,7,238,192,22,171,32,148,247,197,147,41,130,113,255,96,205]},"announce":[],"urlList":[]}}