{"title":"Spirit - The Original Potato Land (2006) [FLAC]","uid":11112674,"size":483913082,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:ba962cc758de3fa8e2e31bfc0e780bb74b139dae&amp;dn=Spirit+-+The+Original+Potato+Land+%282006%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"bluesmax","files":-1,"time":1411778878,"description":"\n\nSpirit - The Original Potato Land\nLabel: Acadia - ACA 8095\nFormat: CD, Album\nCountry: UK\nReleased: 2006\nGenre: Rock\nStyle: Psychedelic Rock\n\n\n\nTracklist:\n\n1 \tIntroduction \t0:43\n2 \t1984 \t3:49\n3 \tExit 27 (Dialogue) \t1:24\n4 \tTurn To The Right \t3:44\n5 \tEverything Talks To Me (Donut House) \t3:43\n6 \tFish Fry Road \t3:24\n7 \tNature's Theme \t0:45\n8 \tInformation \t3:11\n9 \tMy Friend \t2:49\n10 \tWalkin' The Dog \t3:01\n11 \tGiant Potatoes (Dialogue) \t0:31\n12 \tLonely In Potatoland (Mashed Potatoes) \t3:04\n13 \tNature's Way \t2:37\n14 \tSalvation: Matter Of Time: Suite \t5:29\n15 \t1984 (Reprise) \t0:44\n16 \tOil Slick-Million Years Suite \t4:32\n17 \tInformation Reprise \t1:46\n18 \tIt's Time Now \t4:53\n\nBonus Tracks\n19 \tYou Know \t1:29\n20 \tDonut House (Alternate Version) \t3:40\n21 \tAin't That Too Bad \t3:17\n22 \tDevil (Live 9/13/72) \t4:48\n23 \tShotgun (Live 9/13/72) \t4:35\n24 \tGet Out My Life Woman (Live 9/6/72) \t5:54\n25 \tMiss This Train (Live 9/6/72) \t3:12\n26 \tInterview Clip With Randy California, Ed Cassidy And Bob Harris, April 1973 \t2:25\n\n\n\nPersonnel:\n\nRandy California - vocals, guitars, bass, keyboards\nEd Cassidy - drums, percussion, vocals\n\nLarry Knight - bass, backing vocals on tracks 21-25\n\n\n\n\nReview by William Ruhlmann, allmusic.com\n\nLike other &quot;lost&quot; rock albums such as the Beach Boys' SMiLE, Spirit's Potatoland has been &quot;found&quot; periodically, notably in 1981, when a version of it was released, eight years after it had been rejected by Epic Records and shelved. According to Spirit scholar Mick Skidmore, however, that version &quot;was to all intents and purposes a bastardized version of the original concept&quot; for which Spirit leader Randy California recorded numerous overdubs in an attempt to update its sound. Skidmore prefers the acetate he heard -- and taped -- on a BBC radio show in 1973, and now that he is in charge of the Spirit archives, he has attempted to reconstruct the album as it was originally intended for this reissue. In his annotations, he explains that Potatoland was not actually begun as a Spirit album per se, for the simple reason that, at the time, California and drummer Ed Cassidy, the only other original member of the band involved, had lost the rights to the name Spirit. California had recently released his debut solo album, Kapt. Kopter &amp; the (Fabulous) Twirly Birds, and having reconnected with Cassidy, began the project as a duo album. (The full title is sometimes rendered as The Adventures of Kaptain Kopter &amp; Commander Cassidy in Potato Land, and a revised, still unissued version was called Randy California and Ed Cassidy -- Back Together Again.) The concept, as delineated in spoken word interludes between the songs, had the two veering off the highway to a mysterious place called Potato Land, where they encounter, among other things, a giant chocolate eclair. These bits of dialogue, reminiscent of the stoned interplay of Cheech &amp; Chong, served as introductions to the songs, a typical collection of catchy, guitar-driven pop/rock, including, in this version, reprises of such old Spirit songs as &quot;1984&quot; and &quot;Nature's Way.&quot;\n\nSkidmore has refurbished the sound, at least to the extent of removing pops and clicks, but much of the disc still sounds like a demo. Still, that helps it retain its period charm. It is hardly a masterpiece, but it certainly is entertaining and lighthearted. Whether it would have been &quot;a huge hit&quot; and reshaped Spirit's career if it had been released in 1973, as Skidmore asserts, is impossible to say, though the band clearly was poised for a commercial breakthrough that never happened. Recognizing that this release will appeal mainly to &quot;die-hard Spirit fans,&quot; Skidmore has stretched the disc out to nearly 80 minutes by including alternate takes, live material recorded at the time, and even a bit of the conversation from that radio show he heard in 1973. Some of the live tracks, notably the covers of Junior Walker's &quot;Shotgun,&quot; Allen Toussaint's &quot;Get Out My Life Woman,&quot; and Mance Lipscomb's &quot;Miss This Train,&quot; all from September 1972 Kapt. Kopter shows, provide proof of Skidmore's statement that &quot;Randy was THE natural successor to [Jimi] Hendrix&quot;; on these occasions, he definitely played a lot like his old boss.\n","torrent":{"xt":"urn:btih:ba962cc758de3fa8e2e31bfc0e780bb74b139dae","amp;dn":"Spirit+-+The+Original+Potato+Land+%282006%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ba962cc758de3fa8e2e31bfc0e780bb74b139dae","infoHashBuffer":{"type":"Buffer","data":[186,150,44,199,88,222,63,168,226,227,27,252,14,120,11,183,75,19,157,174]},"announce":[],"urlList":[]}}