{"title":"James K. Bracken, Reference Works in British and American Litera","uid":12188877,"size":1850188,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:bc5c4fab6d80f35b3ffc314c2e2edcc5ade81ebd&amp;dn=James+K.+Bracken%2C+Reference+Works+in+British+and+American+Litera&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Hand_of_Doom","files":3,"time":1438616903,"description":"This work identifies, describes, and evaluates the most important and useful reference materials based on British and North American authors and their writings. Designed to serve the needs of literary researchers of all degrees of sophistication, this book offers modern researchers and students of English literature a thorough review of reference resources available through 1996 and part of 1997. Updating and expanding on its previous edition, the book covers a substantial portion of the currently available reference sources--with entries for more than 1,500 resources on individual writers, including dictionaries, encyclopedias, indexes, handbooks, and electronic resources. Entries are arranged alphabetically by author name (or by title if author is unknown) and works are classified and grouped according to type. Descriptive annotations offer detailed assessments of the works, noting special features and often comparing them to similar titles. Numerous cross-references are given. A chronological appendix lists authors consecutively with dates of birth and death, and a nationality appendix groups them according to their country of primary residence. An author/title and a detailed subject index conclude the work","torrent":{"xt":"urn:btih:bc5c4fab6d80f35b3ffc314c2e2edcc5ade81ebd","amp;dn":"James+K.+Bracken%2C+Reference+Works+in+British+and+American+Litera","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bc5c4fab6d80f35b3ffc314c2e2edcc5ade81ebd","infoHashBuffer":{"type":"Buffer","data":[188,92,79,171,109,128,243,91,63,252,49,76,46,46,220,197,173,232,30,189]},"announce":[],"urlList":[]}}