{"title":"FSX - Aerosoft Mega Airport London-Heathrow Xtended","uid":11114766,"size":4357546801,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:bca750b06ceb6b4897a355a06a41ec2f15ad6816&amp;dn=FSX+-+Aerosoft+Mega+Airport+London-Heathrow+Xtended&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Flightplayer","files":-1,"time":1411848643,"description":"Line up on the &quot;String of Pearls&quot; and land on Europe`s busiest airport London Heathrow. The prize winning SimWings Team has once again pushed the limits of modeling a perfect mega hub with London Heathrow Xtended representing the actual and up to date stage of its real world counterpart.\n\nFind out what commercial aviation is all about by joining the traffic of the worldÂ´s third busiest airport. The scenery covers around 42 square kilometers in total with fully detailed buildings at the airport, including the new T2 and T2B terminals. Fully customized high resolution aerial ground textures, detailed ground markings and the actual taxiway layout with new rapid runway exits and taxiway links make it a perfect rendition while use of LOD technique will give you the best possible performance. ThereÂ´s even an option to use the still existing old Europier which will be demolished soon.\n\nMega Airport London Heathrow with near airport surrounding (about 42 square kilometers in total)\nFully detailed buildings at the airport\nSafegate and other dockings at all gates\nIncludes new T2 and T2B terminals\nPre-rendered self shadowing and raytraced night lighting\nFully customized high resolution aerial ground textures (about 30cm/pix) with custom detail textures for taxiways etc.\nDetailed ground markings\nActual taxiway layout with new rapid runway exits and taxiway links\nHand placed autogen\nSeamless integration of the ground to the Flight Simulator\nScenery and aerial ground are geographically referenced to provide the best possible compatibility to other aerial or landclass ground add-ons\nSeasonal ground textures (Spring, Summer, Fall and &quot;warm&quot; Winter to match to FSXÂ´s default seasons)\nAnimated custom utility vehicles by AES Lite\nUse of LOD technique for best possible performance\nCustom made AFCAD file with airline parking codes\nRemaining Europier terminal can be selected as an option (will soon be demolished)\nHassle free installation: No switching or change of default configs\nDX10 preview compatible","torrent":{"xt":"urn:btih:bca750b06ceb6b4897a355a06a41ec2f15ad6816","amp;dn":"FSX+-+Aerosoft+Mega+Airport+London-Heathrow+Xtended","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bca750b06ceb6b4897a355a06a41ec2f15ad6816","infoHashBuffer":{"type":"Buffer","data":[188,167,80,176,108,235,107,72,151,163,85,160,106,65,236,47,21,173,104,22]},"announce":[],"urlList":[]}}