{"title":"Materials Selection Deskbook - Nicholas P. Cheremisinoff","uid":12129302,"size":1660925,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:be068abbd5c731674222a9302efc638f4564e4fd&amp;dn=Materials+Selection+Deskbook+-+Nicholas+P.+Cheremisinoff&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"clouderone","files":1,"time":1436996321,"description":"Materials Selection Deskbook - Nicholas P. Cheremisinoff, Ph.D. (Noyes, 1996).djvu\n\nISBN 081551400X\n\nThe chemical and allied industries employ a multitude of unit operations in product manufacturing. Both chemicals and physical mechanisms are employed in these operations, ranging from simple bulk handling and preparation of chemical feedstocks to complex chemical reactions in the presence of heat and or mass transfer. These operations require application of scientific and engineering principles to ensure efficient, safe and economical process operations. To meet these objectives, process equipment must perform intended functions under actual operating conditions and do so in a continuous and reliable manner. Equipment must have the characteristics of mechanical reliability, which includes strength, rigidity, durability and tightness. In addition, it must be designed at an optimized ratio of capital investment to service life. This book is designed as a handy desk reference covering fundamental engineering principles of project planning schemes and layout, corrosion principles and materials properties of engineering importance. It is intended as a general source of typical materials property data, useful for first pass materials selection in process design problems","torrent":{"xt":"urn:btih:be068abbd5c731674222a9302efc638f4564e4fd","amp;dn":"Materials+Selection+Deskbook+-+Nicholas+P.+Cheremisinoff","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"be068abbd5c731674222a9302efc638f4564e4fd","infoHashBuffer":{"type":"Buffer","data":[190,6,138,187,213,199,49,103,66,34,169,48,46,252,99,143,69,100,228,253]},"announce":[],"urlList":[]}}