{"title":"Comprehensive Hard Materials (3 Volume Set)(Elsevier, 2014)","uid":12126588,"size":198857430,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:be91cb1066e7768594c6a9a84258a07a6165ca73&amp;dn=Comprehensive+Hard+Materials+%283+Volume+Set%29%28Elsevier%2C+2014%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"clouderone","files":1,"time":1436934557,"description":"Comprehensive Hard Materials (3 Volume Set)(Elsevier, 2014).pdf\n\nVolume 1 ISBN: 978-0-444-63385-9\nVolume 2 ISBN: 978-0-444-63384-2\nVolume 3 ISBN: 978-0-444-63383-5\nSET ISBN: 978-0-08-096527-7\n\nComprehensive Hard Materials deals with the production, uses and properties of the carbides, nitrides and borides of these metals and those of titanium, as well as tools of ceramics, the superhard boron nitrides and diamond and related compounds. Articles include the technologies of powder production (including their precursor materials), milling, granulation, cold and hot compaction, sintering, hot isostatic pressing, hot-pressing, injection moulding, as well as on the coating technologies for refractory metals, hard metals and hard materials. The characterization, testing, quality assurance and applications are also covered. Comprehensive Hard Materials provides meaningful insights on materials at the leading edge of technology. It aids continued research and development of these materials and as such it is a critical information resource to academics and industry professionals facing the technological challenges of the future.\n\nHard materials operate at the leading edge of technology, and continued research and development of such materials is critical to meet the technological challenges of the future. Users of this work can improve their knowledge of basic principles and gain a better understanding of process/structure/property relationships.\nWith the convergence of nanotechnology, coating techniques, and functionally graded materials to the cognitive science of cemented carbides, cermets, advanced ceramics, super-hard materials and composites, it is evident that the full potential of this class of materials is far from exhausted. This work unites these important areas of research and will provide useful insights to users through its extensive cross-referencing and thematic presentation.\nTo link academic to industrial usage of hard materials and vice versa, this work deals with the production, uses and properties of the carbides, nitrides and borides of these metals and those of titanium, as well as tools of ceramics, the superhard boron nitrides and diamond and related compounds","torrent":{"xt":"urn:btih:be91cb1066e7768594c6a9a84258a07a6165ca73","amp;dn":"Comprehensive+Hard+Materials+%283+Volume+Set%29%28Elsevier%2C+2014%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"be91cb1066e7768594c6a9a84258a07a6165ca73","infoHashBuffer":{"type":"Buffer","data":[190,145,203,16,102,231,118,133,148,198,169,168,66,88,160,122,97,101,202,115]},"announce":[],"urlList":[]}}