{"title":"Ocean Worlds: The story of seas on Earth and other planets [2015","uid":12140103,"size":5521181,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:bee7885234f219de3a78ad9119db967b0f0b5c1e&amp;dn=Ocean+Worlds%3A+The+story+of+seas+on+Earth+and+other+planets+%5B2015&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"NoctDeath","files":3,"time":1437329394,"description":"Title: Ocean Worlds: The story of seas on Earth and other planets \nAuthor: Jan Zalasiewicz, Mark Williams \nFormat: PDF \nHardcover: 336 pages \nPublisher: Oxford University Press; 1 edition (January 1, 2015) \nLanguage: English \nISBN: 978-0199672882 \n\n\nOceans make up most of the surface of our blue planet. They may form just a sliver on the outside of the Earth, but they are very important, not only in hosting life, including the fish and other animals on which many humans depend, but in terms of their role in the Earth system, in regulating climate, and cycling nutrients. As climate change, pollution, and over-exploitation by humans puts this precious resource at risk, it is more important than ever that we understand and appreciate the nature and history of oceans. There is much we still do not know about the story of the Earth's oceans, and we are only just beginning to find indications of oceans on other planets.\n\nIn this book, geologists Jan Zalasiewicz and Mark Williams consider the deep history of oceans, how and when they may have formed on the young Earth - topics of intense current research - how they became salty, and how they evolved through Earth history. We learn how oceans have formed and disappeared over millions of years, how the sea nurtured life, and what may become of our oceans in the future. We encounter some of the scientists and adventurers whose efforts led to our present understanding of oceans. And we look at clues to possible seas that may once have covered parts of Mars and Venus, that may still exist, below the surface, on moons such as Europa and Callisto, and the possibility of watery planets in other star systems","torrent":{"xt":"urn:btih:bee7885234f219de3a78ad9119db967b0f0b5c1e","amp;dn":"Ocean+Worlds%3A+The+story+of+seas+on+Earth+and+other+planets+%5B2015","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bee7885234f219de3a78ad9119db967b0f0b5c1e","infoHashBuffer":{"type":"Buffer","data":[190,231,136,82,52,242,25,222,58,120,173,145,25,219,150,123,15,11,92,30]},"announce":[],"urlList":[]}}