{"title":"Jimmy McDonough, Shakey, Neil Young's Biography [Epub]","uid":12208245,"size":5731716,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:bf145f508b05a101bc3a7b9a69fe48e56de0f1b1&amp;dn=Jimmy+McDonough%2C+Shakey%2C+Neil+Young%27s+Biography+%5BEpub%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Hand_of_Doom","files":3,"time":1438994344,"description":"Neil Young is one of rock and roll's most important, influential and enigmatic figures, an intensely reticent artist who has granted no writer access to his inner sanctum - until now. Shakey is the whole story of Young's incredible life and career: from his childhood in Canada to the founding of folk-rock pioneers Buffalo Springfield; the bleary conglomeration of Crazy Horse and the monstrous success of Crosby, Stills, Nash and Young; to the depths of the Tonight's the Night depravity and the Geffen years; and Young's unprecedented nineties 'comeback'.\n\nShakey (the title refers to one of Young's many aliases) is also the compelling human story of a lonely kid for whom music was the only outlet, a driven yet tortured figure who controlled his epilepsy via 'mind over matter', an oddly passionate model train mogul who, inspired by his own son's struggle with cerebral palsy, became a major activist in the quest to help those with the condition.\n\nThis long-awaited, unprecedented story of a rock 'n' roll legend is uniquely told through the interwoven voices of McDonough - biographer, critic, historian, obsessive fan - and the ever-cantankerous (but slyly funny) Young himself","torrent":{"xt":"urn:btih:bf145f508b05a101bc3a7b9a69fe48e56de0f1b1","amp;dn":"Jimmy+McDonough%2C+Shakey%2C+Neil+Young%27s+Biography+%5BEpub%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bf145f508b05a101bc3a7b9a69fe48e56de0f1b1","infoHashBuffer":{"type":"Buffer","data":[191,20,95,80,139,5,161,1,188,58,123,154,105,254,72,229,109,224,241,177]},"announce":[],"urlList":[]}}