{"title":"HISTORY OF POP AND ROCK MUSIC - part 586","uid":12129812,"size":671877798,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:bfb23b3efbcf0a35394e3fe63b64aef492680b81&amp;dn=HISTORY+OF+POP+AND+ROCK+MUSIC+-+part+586&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"pupovaczlatko","files":11,"time":1437007708,"description":"                             \n\n                      GRAND FUNK RAILROAD  -  Mr Limousines Driver   (1970)  \n                      BAD COMPANY  -   Bad Company  (1974)\n                      BAD COMPANY  -   Rock Steady (1974)\n                      QUEEN  - Keep Yourself Alive   (1973)\n\n\n\n              &quot;Mr Limousines Driver&quot; is a  song performed by  Grang Funk Railroad , released as a single in May 1970 and included in the album &quot;Grand Funk&quot;  released in December 1969 .This release (aka &quot;The Red Album&quot;) was certified by RIAA with a gold record award, the first for the group. It includes a cover of The Animals' &quot;Inside Looking Out&quot; which is still a cornerstone of the band's live concerts today. Other key tracks include &quot;Got This Thing On The Move&quot;, &quot;In Need&quot;, and &quot;Paranoid&quot;. The inside spread photograph of the trio, for the original album release, was used for the now infamous, $100,000, block-long and several stories high, New York City's Times Square billboard ad for the album Closer To Home (1970). The producers sought to achieve a concentration on Mark Farner's guitar, in response to the imbalance the band achieved in On Time with the prominence of Mel Schacher's bass. This led to the unofficial name of &quot;The Red Album&quot;, as the guitar track, red in the studio, was turned up. This was reflected on the red cover art .\n\n           &quot;Bad Company&quot; is a song by the hard rock band Bad Company. It was released as the third single from their debut album Bad Company in 1974, although it did not chart (in America). Co-written by the group's lead singer Paul Rodgers and drummer Simon Kirke, the song's meaning comes from a book on Victorian morals. The song uses the same chords and piano figure as Joni Mitchell's song &quot;Woodstock&quot; from 1970.  The album reached the top of the US Billboard 200. Since then, the album has been certified five times platinum by the RIAA, and became the 46th best selling album of the 1970s. The album spent 25 weeks in the UK Albums Chart, entering at No. 10 and reaching its highest position of No. 3 in the second week. Kerrang! magazine listed the album at No. 40 among the &quot;100 Greatest Heavy Metal Albums of All Time&quot;.\n\n            &quot;Keep Yourself Alive&quot; is a song by British rock band Queen. Written by guitarist Brian May, it is the opening track on the band's debut album Queen (1973). It was released as Queen's first single along with &quot;Son and Daughter&quot; as the B-side. &quot;Keep Yourself Alive&quot; was largely ignored upon its release and failed to chart on either side of the Atlantic.   In 2008, Rolling Stone rated the song thirty-first on its list of &quot;The 100 Greatest Guitar Songs of All Time&quot;","torrent":{"xt":"urn:btih:bfb23b3efbcf0a35394e3fe63b64aef492680b81","amp;dn":"HISTORY+OF+POP+AND+ROCK+MUSIC+-+part+586","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bfb23b3efbcf0a35394e3fe63b64aef492680b81","infoHashBuffer":{"type":"Buffer","data":[191,178,59,62,251,207,10,53,57,78,63,230,59,100,174,244,146,104,11,129]},"announce":[],"urlList":[]}}