{"title":"The High - Somewhere soon  (1990) (320 mp3 cbr)  [nodeJunKii42]","uid":12147835,"size":110564251,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:c03315603d746c9afce57cd5503ee1f23553e9d0&amp;dn=The+High+-+Somewhere+soon++%281990%29+%28320+mp3+cbr%29++%5BnodeJunKii42%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"nodeJunKii42","files":10,"time":1437516536,"description":"\nTHE HIGH - SOMEWHERE SOON  (1990)  MP3 320, CBR.  (sorry, no FLAC cos no CD)\n\n\n01. Box Set Go\n02. Take Your Time\n03. This is My World\n04. Rather Be Marsanne\n05. So I Can See\n06. A Minor Turn\n07. Dreams of Dinesh\n08. Up and Down\n09. PWA\n10. Somewhere Soon\n\n\nGUYS, the F**king hassle if had compling a decent quality version of this album \na. for free\nb. without access to a CD\n\n\nThe High were an English rock group from Manchester, who were generally regarded as part of the Madchester scene.\nThe band was formed in 1989 by former Turning Blue singer John Matthews, along with former Buzzcocks F.O.C. members Andy Couzens (guitar, also formerly of The Stone Roses and pre-Roses bands The Patrol and Waterfront), Simon Davies (bass), and drummer Chris Goodwin (also formerly of Inspiral Carpets), when Steve Diggle left Buzzcocks F.O.C. to reform the Buzzcocks.\n\nThey were signed by London Records and had three minor UK Singles Chart hits in 1990 before breaking into the top 30 in 1991 with a revamped version of their debut single, the Martin Hannett-produced &quot;Box Set Go&quot;. The band's debut album, Somewhere Soon, peaked at number 59 in the UK Album Chart.\n\nWith the Madchester scene losing favour with the critics, the band's later releases failed to chart, the band splitting up in 1993.[1] John Matthews and Chris Goodwin went on to form the Manchester group 'One Summer' with local musicians Stephen Fitzpatrick (guitar) and Carl Wolstenholme (bass). One Summer worked with Factory Records group A Certain Ratio and recorded a demo for the label before it went into administration.\n\nThe High have recently appeared on Jon Savages compilation, Perfect Motion - Jon Savage's Secret History Of Second-Wave Psychedelia 1988-93\n\nThe High reformed in early 2015, with John Matthews and Andy Couzens the only original members; they are joined by Tony Meehan (bass), Jack Couzens (drums), and Richard Thomas on keyboards.\n\nalthough, in the opinion of this uploader(and fan), nothing they have done since has come ANYWHERE near close to this album - SOMEWHERE SOON.\n\n\n\nalthough this record is labelled &quot;london records&quot; (who took over factory after their collapse, due to the bottomless money pit that was the hacienda)\nbe under no illusion - this record exists due to the work of factory records, and the legendary martin hannet - and of course the band themselves\n\nENJOY,REMINISCE,SHARE, \n\nREGARDS,nodeJunKii42","torrent":{"xt":"urn:btih:c03315603d746c9afce57cd5503ee1f23553e9d0","amp;dn":"The+High+-+Somewhere+soon++%281990%29+%28320+mp3+cbr%29++%5BnodeJunKii42%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c03315603d746c9afce57cd5503ee1f23553e9d0","infoHashBuffer":{"type":"Buffer","data":[192,51,21,96,61,116,108,154,252,229,124,213,80,62,225,242,53,83,233,208]},"announce":[],"urlList":[]}}