{"title":"Nieuw Right Said Fred - I`m Too Sexy-Orginal by Destiny.NL","uid":11074518,"size":92498658,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:c0b758aa92ac4c7af32d3319483c05d6cf3a97f5&amp;dn=Nieuw+Right+Said+Fred+-+I%60m+Too+Sexy-Orginal+by+Destiny.NL&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"DestinyWRLD","files":-1,"time":1411318714,"description":"Nieuw Right Said Fred - I`m Too Sexy-Orginal by Destiny.NL\n\nI remember the first time I heard this song in the early 1990s \nI thought it must be a Dr. Demento production,\nor PDQ Bach was really going off on a tangent.\nBut no, there they were, larger than life and singing about being models, being hunks,\nbeing shirtless, and being everything that I not only wasn't,\nbut didn't really aspire to be (well,\nI could stand to have a better physique, but I digress).\n\nOf course, I seemed to have forgotten about the song; flashy though it was,\nand memorable though it was, it just didn't come to the top of my mind on a regular basis.\nI was reminded of it by C.J.\nsinging it in an episode of 'West Wing',\nand the next day a dress-for-success modeling event being planned for my college campus -\nI looked, and indeed I discovered that I had a copy of this among my CDs\n(not quite in the same section as the Gregorian chants and Palestrina, but again, I digress).\n\nThe CD has several versions of this song: a radio edit, and extended club mix,\nthe 'catwalk mis', a instrumental mix, and even a Spanish version.\nThese are all very fun songs.\nThey are high energy, disco-beat kinds of tracks,\nideal for dancing and moving, with or without a shirt,\neven in Milan, New York or Japan.\n\nOne commentator at the time of the video release dubbed the group\n'the beginning of the muscle pop phenomenon'.\nOf course, such as movement did not take place in pop music.\n\nRight Said Fred has produced several albums and singles since this song,\nbut nothing has produced the kind of hit, or the kind of staying power, that this one has.\nThe image of them walking down the street, a very overpowering image,\nremains with me from their early days.\n\nI'm too sexy for this review,\nso I'll keep it short!\n\nVeel kijkplezier gewenst door:\nMuch fun by:\nErikB.NL\n\nFor the best movies!","torrent":{"xt":"urn:btih:c0b758aa92ac4c7af32d3319483c05d6cf3a97f5","amp;dn":"Nieuw+Right+Said+Fred+-+I%60m+Too+Sexy-Orginal+by+Destiny.NL","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c0b758aa92ac4c7af32d3319483c05d6cf3a97f5","infoHashBuffer":{"type":"Buffer","data":[192,183,88,170,146,172,76,122,243,45,51,25,72,60,5,214,207,58,151,245]},"announce":[],"urlList":[]}}