{"title":"Essentials - Swamp Thing v1 (1971-1974)","uid":12141820,"size":122401267,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:c1a6d06fdbcb17d3876fee4e66f3c4f21bccc525&amp;dn=Essentials+-+Swamp+Thing+v1+%281971-1974%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Archivist_of_the_Damned","files":14,"time":1437358806,"description":"Swamp Thing v1 (1-13, House of Secrets #92) (1971-1974)\n\nOne of DC Comics' most enduring characters which eventually launched the Vertigo line and changed the nature of modern comics.  This collections has the first threteen issues of the series produced by Len Wein and Berni Wrightson along with the canonical first Swamp Thing introduced in House of Secrets #92. Wein and Wrightson took advantage of the loosening of Comics Code Authority regulations on horror elements in comics to create modern horror comics.  The initial run is so powerful that Alan Moore would revisit and expand upon the seeds and inferences of this first series.  Anton Arcane, the Un-Men, the Patchwork Man, and werewolves are all beautifully illustrated in Wrightson's lavish art. Len Wein's considerable talents created a series steeped in the traditional tropes of horror via Universal Studios that was so far ahead of its time that is failed by 1975 only to grow more lasting roots(sorry)in the eighties.  \n\nThis collection has everything you could want in a horror comic - pathos, diabolical mad scientists, werewolves, man-made monsters, aliens, secret government agencies, Cthulu-esque entities, and even Batman!  Beware the Swamp Thing!","torrent":{"xt":"urn:btih:c1a6d06fdbcb17d3876fee4e66f3c4f21bccc525","amp;dn":"Essentials+-+Swamp+Thing+v1+%281971-1974%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c1a6d06fdbcb17d3876fee4e66f3c4f21bccc525","infoHashBuffer":{"type":"Buffer","data":[193,166,208,111,219,203,23,211,135,111,238,78,102,243,196,242,27,204,197,37]},"announce":[],"urlList":[]}}