{"title":"Fundamentals of Patenting and Licensing","uid":12176152,"size":7494436,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c1b64940dde5ae0a82fcd92a9ec80a7589088591&amp;dn=Fundamentals+of+Patenting+and+Licensing&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"mdusanjay","files":1,"time":1438315903,"description":"Fundamentals of Patenting and Licensing for Scientists and Engineers (2nd Edition) by Matthew Y Ma\n\nEnglish | 2015 | ISBN: 981445253X | 300 pages | PDF | 7 MB\n\nThis comprehensive book is the first of its kind to take scientists and engineers beyond simply getting a patent granted. Through the author's extensive technical background and experience in intellectual property licensing, it ties the many technical, legal and business aspects of patent enforcement to the innovation and patenting stage in the patent value chain, with the objective of helping inventors to create valuable patents that can be capitalized.\n\nIn easy-to-understand language, this book covers various aspects, including basic concepts of patent laws and rules, innovation protection, patenting, patents post-granting and patent licensing. With over 40 tables, 70 figures, nearly 100 cases and examples, and a comprehensive index table, it serves as a practical handbook for inventors and patent practitioners.\n\nThis second edition incorporates the latest changes in the America Invents Act (AIA), with additional case studies and illustrations throughout the book. For inventors who want to file patents by themselves, this new edition provides guidelines and step-by-step instructions on preparing and filing a US provisional patent application, while avoiding the pitfalls that commonly occur in do-it-yourself patenting","torrent":{"xt":"urn:btih:c1b64940dde5ae0a82fcd92a9ec80a7589088591","amp;dn":"Fundamentals+of+Patenting+and+Licensing","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c1b64940dde5ae0a82fcd92a9ec80a7589088591","infoHashBuffer":{"type":"Buffer","data":[193,182,73,64,221,229,174,10,130,252,217,42,158,200,10,117,137,8,133,145]},"announce":[],"urlList":[]}}