{"title":"[-FakeHospital-] Inga Devil [-Sexy sales lady makes doctor cum t","uid":12168530,"size":786379575,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:c39345cb642577461726dfaa02d05eb9abf1f0c8&amp;dn=%5B-FakeHospital-%5D+Inga+Devil+%5B-Sexy+sales+lady+makes+doctor+cum+t&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Upl0ad3rR","files":1,"time":1438094483,"description":"[-FakeHospital-] Inga Devil [-Sexy sales lady makes doctor cum twice as they strike a deal-] --NEW-- 28-July-2015\n\n---:More From My Torrent's Here:---   &lt;a href=&quot;\nhttps://thepiratebay.se/user/Upl0ad3rR&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://thepiratebay.se/user/Upl0ad3rR&lt;/a&gt;\n\n---:ScreeNshotS:---  &lt;a href=&quot;\nhttp://imgfresh.com/image/14504.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgfresh.com/image/14504.html&lt;/a&gt;\n &lt;a href=&quot;\nhttp://imgfresh.com/image/14505.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgfresh.com/image/14505.html&lt;/a&gt;\n\nI often get sales people coming into the clinic to sell products from various distributors and I noticed I had an appointment this morning with one. In walked an absolutely drop dead gorgeous woman that got my pulse immediately racing. However she has no products I needed and I was committed with contracts to other suppliers. She thanked me for my time and took her leave and I thought that was the end of that. A few minutes later I'm startled as she comes crashing back into my office clutching a bottle of gel. She tells me that this gel will make a mans penis erections bigger and could make him stiff in under two minutes. I thought I could see where this was heading, she needed sales badly so was going to use her smoking hot body to get them. I played along for a bit, telling her that I couldn't sell anything that hadn't been tested and she offered that we should test the product right there and then in my office. I'm not going to turn that down and she was soon sat in front of me rubbing this gel and massaging it into my cock. I'm not sure if the gel worked or it was just the sight of this sexy woman wanking my member that got me rock hard in record time. Needless to say we were soon fucking in all manner of positions all over my office and she turned me on so much that I shot my first load quickly. She was a very strong willed woman and she turned me on so much that I got straight back on the sexual wagon and fucked her again until finally I unloaded my second load of the day all over her skirt and top. If she keeps using that sales technique that woman is going to sell a lot of products and go far","torrent":{"xt":"urn:btih:c39345cb642577461726dfaa02d05eb9abf1f0c8","amp;dn":"%5B-FakeHospital-%5D+Inga+Devil+%5B-Sexy+sales+lady+makes+doctor+cum+t","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c39345cb642577461726dfaa02d05eb9abf1f0c8","infoHashBuffer":{"type":"Buffer","data":[195,147,69,203,100,37,119,70,23,38,223,170,2,208,94,185,171,241,240,200]},"announce":[],"urlList":[]}}