{"title":"Harvey Andrews - Writer of Songs (1972) (320 mp3 )[nodeJunKii42]","uid":12148551,"size":104907561,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:c5eb9575d9c9c82760b03f90a5bb6d500ad5d4e5&amp;dn=Harvey+Andrews+-+Writer+of+Songs+%281972%29+%28320+mp3+%29%5BnodeJunKii42%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"nodeJunKii42","files":12,"time":1437535433,"description":"AGAIN, from your tenacious friend nodeJunKii42, a very obscure/hard to obtain  item for the enjoyment of my fellow torrent fans\n\n\nHARVEY ANDREWS-WRITER OF SONGS  (1972)  MP3 320 CBR (except track 4,160 CBR)    \n\n01. Hey! Sandy\n02. In The Darkness\n03. Boothferry Bridge\n04. Unaccompanied\n05. Gift Of A Brand New Day\n06. Soldier\n07. Anna (My Love)\n08. Born On The Breeze\n09. Martha\n10. When I Am Old One Day\n11. Soap Opera\n12. Writer Of Songs\n\n \n  NOT a hugely famous british artist, and certainly not so OUTSIDE of Britain.\n- if any of you guys recognise songs - they will be \n  &quot;THE SOLDIER&quot; or \n  &quot;HEY SANDY&quot;.\n  both &quot;protest&quot; type songs based on true events...\n\n&quot;The soldier&quot; -\n on the actions of a lone british soldier, who sacrifices his young life to save others during &quot;the troubles&quot; in Northern Ireland,\n \n&quot;Hey Sandy&quot; -\n a kind of &quot;ode&quot;,...or perhaps the questioning/imagining of the feelings of a girl called &quot;SANDRA SCHEUER&quot;  \nwho was a student at Kent State University in Kent, Ohio, when she was killed by Ohio National Guardsmen in the Kent State shootings :-   \n  \n &lt;a href=&quot; https://en.wikipedia.org/wiki/Kent_State_shootings&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; https://en.wikipedia.org/wiki/Kent_State_shootings&lt;/a&gt;\n \nALTHOUGHT POOR Sandra did not take part in the Vietnam War protests, that preceded the shootings... She was shot through the throat with an M-1 rifle from a distance of 130 yards (119 m) while walking between classes, and died within five or six minutes from loss of blood....\n\n\n** HARVEY ANDREWS:-\n  \nHarvey John Andrews (born 7 May 1943 in Stechford, Birmingham) is an English singer-songwriter and poet.From 1964, Andrews supported his nascent career as a singer/songwriter by working as a schoolteacher, before becoming a full-time professional musician in 1966. Harvey Andrews has produced 16 albums singing his own songs, many of which have also been recorded by other artists.\n\nHe collaborated on a successful musical depicting life growing up in Birmingham in the forties and fifties. &quot;Go Play Up Your Own End&quot; has been well received across the Midlands, especially in its production in 2006 featuring Jasper Carrot in a major role,but has yet to make the transfer to London. The musical has played at the Birmingham Repertory Theatre, the Birmingham Hippodrome and the Alexandra Theatre, thus setting a record of having been staged at every one of the \nsecond city's major theatres.\n\nIn 2007 he published a musical memoir &quot;Gold star to the Ozarks&quot;. Harvey retired from full-time concert performances in October 2012 with a series of concerts at The Guild Hall, Lichfield.\n\nHe has appeared at many festivals around the world.\n\nTelevision appearances include The Old Grey Whistle Test, Rhythm on Two and over 50 other shows. He has made two television specials featuring his songs, The Camera and The Song, and The Same Old Smile. Two further specials were produced in the Netherlands and Ireland. \n\nHe sang &quot;Riding Free&quot;, the theme song from the cult British horror movie Psychomania in 1973, and wrote and sang the theme songs for two Australian TV series, Golden Pennies (1985) and The Haunted School (1986). He has hosted BBC Radio Two's Folk on Two,and a Radio Four Kaleidoscope special was devoted to his work. \n\n**(Thanks wikipedia)\n\n\n~~~  THE WORK of Andrews can be VERY accurately described as English Folk,the    songs are of the type that DEFINITELY TELL A STORY,paint a picture, celebrate a life, or &quot;proclaim alliance&quot; with a protest group and/or its cause.\n\nThe revelation that he was also a poet (from the wiki page, quoted above) comes as NO surprise when you listen to his songs.\n             \nIt is Amazing to me how artists of this level of talent, can use nothing more than their voices and a guitar to &quot;take you there&quot;,..... to build up the suspense of a story - and to almost have the listener &quot;feel the feelings&quot;, the agony , joy, terror, despair, scenery, or indeed the love - that is being experienced by the characters in their songs.\n\nAnd indeed, this is  the case with Harvey Andrews - and certainly with this album &quot;writer of songs&quot;\n\nI have heard the (visual) work of Film/program producers such as Ken Loach, Shane Meadows and Barry Hinds, described as portraying a &quot;kitchen sink&quot; type of &quot;grit&quot;.\n\nI,personally,would say this also would be and excellent phrase to describe the audio work of Harvey Andrews.... \nListen (for instance)to the acapello track &quot;unaccompanied&quot;, and (especially in these present finacially tough times) it will certainly strike a cord with most of us?\n\nAND AT THE OTHER END OF THE SCALE,  the nostalgic, uplifting ballads of love and hope for both people and places that are &quot;boothferry bridge&quot; and &quot;borne on the breeze&quot;   \n\nAlways timeless, sometimes militant and angry, sometimes with a kind of &quot;hopeful&quot; melancholy, and sometimes with nothing other than the glorious celebration of love, life, and our beautiful world ...... \n                        \n                      WRITER OF SONGS, HARVEY ANDREWS   \nIt is CERTAINLY worth a download and listen, by Folk fans for sure and by music fans of all ages and tastes ~~~\n\n              \nPS - my apologies for the 160 quality of &quot;unaccompanied&quot; - as i said, this album was hard to compile in any kind of decent quality, as no CD, and dispite years of trying (i shit you NOT) i managed to get all the other tracks in 320 mp3, except this one- which i had to DL from YT .   \nBeing acapello, and just one GUYS voice - i assure you that it will not destroy your appreciation of the song.\n                        \nSORRY!!!!\n\n\nENJOY,REMINISCE,SHARE, \n\nREGARDS,nodeJunKii42","torrent":{"xt":"urn:btih:c5eb9575d9c9c82760b03f90a5bb6d500ad5d4e5","amp;dn":"Harvey+Andrews+-+Writer+of+Songs+%281972%29+%28320+mp3+%29%5BnodeJunKii42%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c5eb9575d9c9c82760b03f90a5bb6d500ad5d4e5","infoHashBuffer":{"type":"Buffer","data":[197,235,149,117,217,201,200,39,96,176,63,144,165,187,109,80,10,213,212,229]},"announce":[],"urlList":[]}}