{"title":"pfSense® VMware® Ready Virtual Firewall Appliance","uid":12145356,"size":222756352,"categoryP":"applications","categoryS":"unix","magnet":"?xt=urn:btih:c64696c77b8f27c417aa290a34fd5188831815f3&amp;dn=pfSense%26reg%3B+VMware%26reg%3B+Ready+Virtual+Firewall+Appliance&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"elboogero","files":1,"time":1437459853,"description":"This VMware ready image is a state of the art pfSenseÂ® Security Gateway virtual machine image. This pfSense appliance can be configured as a firewall, LAN or WAN router, VPN appliance, DHCP Server, DNS Server, and IDS/IPS with optional packages to deliver a very low cost, high performance, high throughput front-line virtual security architecture.\n\nBuilt with performance, versatility, and low total cost of ownership in mind, pfSense systems meet the growing needs of organizations of all sizes. \n \nLOW TOTAL COST OF OWNERSHIP\n\n    No artifical limits or add-ons required to make your system fully functional.\n    No additional usage or feature based pricing. Enjoy unlimited users, unlimited firewall rules, unlimited IPsec tunnels, dual WAN, etc.\n    This system is designed for a long deployment lifetime.\n\n \nGROWS WITH YOU\n\n    From firewall to Unified Threat Management, get all the security features you need to protect your home or business.\n    Flexible configuration and support for multi-WAN, high availability, VPN, load balancing, reporting and monitoring, etc.\n    Add optional packages such as Snort or Suricata for IDS/IPS and network security monitoring, Squid for optimized content delivery and SquidGuard for anti-spam/anti-phishing and URL filtering.1\n    Maximum Active Connections: dependent on RAM assigned to VM.\n\n \nEASY GUI MANAGEMENT\n\n    Manage pfSense settings through our web-based GUI.\n    No fumbling with a command line interface or typing arcane commands.\n\n \nSECURE REMOTE ACCESS\n\n    Connect via encrypted Virtual Private Networks (VPN) between your offices, let mobile workers connect security, or connect to the Cloud!\n    Use the built-in Amazon VPC Wizard to easily establish VPN connections with your Amazon EC2 cloud.\n\n \nBest For:\n\n    Everyone utilizing a virtual machine infrastructure  \n    Anyone with High-Speed Gigabit Connections\n    Many VPN Connections\n\n \nSoftware Features:\n\npfSense is a free, open source firewall and router platform based on FreeBSD that is functionally competitive with expensive, proprietary commercial firewalls. pfSense can be configured as a stateful packet filtering firewall, a LAN or WAN router, VPN Appliance, DHCP Server, DNS Server, or can be configured for other applications and special purpose Appliances. This next generation pfSense security appliance features include:\n\n    Stateful packet filtering firewall or pure router\n    Routing policy per gateway and per-rule for multiple WAN, failover, load balancing\n    Transparent layer 2 firewall\n    Support for IPv6, NAT, BGP\n    Captive portal with MAC filtering, RADIUS support, etc.\n    VPN: IPsec, OpenVPN, PPTP\n    Dynamic DNS client\n    DHCP Server and Relay functions\n    PPPoE Server\n    Reporting and monitoring features with real time information\n    Learn more about the features of pfSense\n\nProduct Details:\n\n    pfSense version 2.2.2\n    VMware Ready\n    OVA Format Virtual Machine for VMware ESX\n    Immediate download upon purchase\n    Does not include support","torrent":{"xt":"urn:btih:c64696c77b8f27c417aa290a34fd5188831815f3","amp;dn":"pfSense%26reg%3B+VMware%26reg%3B+Ready+Virtual+Firewall+Appliance","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c64696c77b8f27c417aa290a34fd5188831815f3","infoHashBuffer":{"type":"Buffer","data":[198,70,150,199,123,143,39,196,23,170,41,10,52,253,81,136,131,24,21,243]},"announce":[],"urlList":[]}}