{"title":"Touching from a Distance Ian Curtis and Joy Division (Epub)","uid":12163565,"size":1509438,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c679a866908ce8f10bbb5b0d683f3db8a1a638ee&amp;dn=Touching+from+a+Distance+Ian+Curtis+and+Joy+Division+%28Epub%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Hand_of_Doom","files":3,"time":1437977369,"description":"The only in-depth biographical account of the lead singer of Joy Division, written by his widow.\n\nRevered by his peers -- Bono described his voice as &quot;holy&quot; -- and idolized by his fans, Ian Curtis left behind a legacy rich in artistic genius. He was a mesmerizing performer on stage, yet also introverted and prone to mood swings. Enigmatic to the last, Ian Curtis died by his own hand on 18 May 1980.\n\nTouching from a Distance describes Curtis's life from his early teenage years to his premature death on the eve of Joy Division's first American tour. It tells how, with a wife, child and impending international fame, he was seduced by the glory of an early grave. What were the reasons for his fascination with death? Were his dark, brooding lyrics an artistic exorcism? In Touching from a Distance Curtis's widow, Deborah, explains the drama of his life and the tragedy of his death.\n\nThis edition includes discography, gig list and a full set of Curtis's lyrics, some of which appear in print for the first time","torrent":{"xt":"urn:btih:c679a866908ce8f10bbb5b0d683f3db8a1a638ee","amp;dn":"Touching+from+a+Distance+Ian+Curtis+and+Joy+Division+%28Epub%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c679a866908ce8f10bbb5b0d683f3db8a1a638ee","infoHashBuffer":{"type":"Buffer","data":[198,121,168,102,144,140,232,241,11,187,91,13,104,63,61,184,161,166,56,238]},"announce":[],"urlList":[]}}