{"title":"75 Classic Rides Oregon - The Best Road Biking Routes -Gooner","uid":12259770,"size":37786182,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c72ef269260dd62d38d6005b1fee46778b658ddc&amp;dn=75+Classic+Rides+Oregon+-+The+Best+Road+Biking+Routes+-Gooner&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"GoonerTPB","files":1,"time":1440154051,"description":"Publisher: Mountaineers Books (June 1, 2015)\nLanguage: English\nISBN-10: 1594856508\nISBN-13: 978-1594856501\n\nFrom an after-work ride through Portland's neighborhood streets or a family cycle along the flat Willamette Valley Scenic Bikeway, to a multi-day tour in the salty breezes of the Oregon coast if you re seeking the best road biking the state has to offer, you ll find plenty of blacktop bliss in 75 CLASSIC RIDES OREGON\n75 Classic Rides is a new Mountaineers Books series authored by passionate local cyclists who've put thousands of miles on their bikes to bring you the very best road cycling routes across their given state. The focus is on one-day rides (a mix of loops and one-way courses), but you ll also find suggestions for link-ups and some inspiring, longer routes for touring, including at least one cross-state route. Terrain varies from flat paved trails to epic mountain challenges.\nEach route description starts with the basic essentials to get you going: a brief overview, full-color map, elevation profile, difficulty level, round-trip distance, road conditions, and advice on the best season to ride. Full narrative descriptions tell what sights to expect, best towns for food or a cup of coffee, safety info on road shoulders and bike lanes, as well as turn-by-turn descriptions and mileage logs","torrent":{"xt":"urn:btih:c72ef269260dd62d38d6005b1fee46778b658ddc","amp;dn":"75+Classic+Rides+Oregon+-+The+Best+Road+Biking+Routes+-Gooner","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c72ef269260dd62d38d6005b1fee46778b658ddc","infoHashBuffer":{"type":"Buffer","data":[199,46,242,105,38,13,214,45,56,214,0,91,31,238,70,119,139,101,141,220]},"announce":[],"urlList":[]}}