{"title":"Einstein Relatively Simple [Ira Mark Edgall 2015]{Charm-Quark}","uid":12163198,"size":16774161,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c7a0975d668c627abccdec6ee54622fde3c3a1b5&amp;dn=Einstein+Relatively+Simple+%5BIra+Mark+Edgall+2015%5D%7BCharm-Quark%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Cquark","files":1,"time":1437965785,"description":"Book Description:\nEinstein Relatively Simple brings together for the first time an exceptionally clear explanation of both special and general relativity. It is for people who always wanted to understand Einstein's ideas but never thought they could.\nTold with humor, enthusiasm, and rare clarity, this entertaining book reveals how a former high school drop-out revolutionized our understanding of space and time. From E=mc2 and everyday time travel to black holes and the big bang, Einstein Relatively Simple takes us all, regardless of our scientific backgrounds, on a mind-boggling journey through the depths of Einstein's universe. Along the way, we track Einstein through the perils and triumphs of his life follow his thinking, his logic, and his insights and chronicle the audacity, imagination, and sheer genius of the man recognized as the greatest scientist of the modern era.\nIn Part I on special relativity we learn how time slows and space shrinks with motion, and how mass and energy are equivalent. Part II on general relativity reveals a cosmos where black holes trap light and stop time, where wormholes form gravitational time machines, where space itself is continually expanding, and where some 13.7 billion years ago our universe was born in the ultimate cosmic event the Big Bang","torrent":{"xt":"urn:btih:c7a0975d668c627abccdec6ee54622fde3c3a1b5","amp;dn":"Einstein+Relatively+Simple+%5BIra+Mark+Edgall+2015%5D%7BCharm-Quark%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c7a0975d668c627abccdec6ee54622fde3c3a1b5","infoHashBuffer":{"type":"Buffer","data":[199,160,151,93,102,140,98,122,188,205,236,110,229,70,34,253,227,195,161,181]},"announce":[],"urlList":[]}}