{"title":"Production of Biofuels and Chemicals with Ionic Liquids","uid":12150105,"size":4988794,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c7cfd3f4ed5f0978c4eae12acae501ba7ec93e58&amp;dn=Production+of+Biofuels+and+Chemicals+with+Ionic+Liquids&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"clouderone","files":1,"time":1437600757,"description":"Production of Biofuels and Chemicals with Ionic Liquids (Biofuels and Biorefineries Volume 1)(Springer, 2014).pdf\n\nISBN 9789400777101\n\nThe application of ionic liquids to biomass for producing biofuels and chemicals will be one of the hot research areas during the next decade due to the fascinating properties of these versatile group of solvents that allow them to dissolve lignocellulosic materials. The present text provides up-to-date fundamentals, state-of-the-art reviews, current assessments and prospects in this area, including aspects of pretreatment, fermentation, biomass dissolution, cellulose transformation, reaction kinetics and physical properties, as well as the subsequent production of biofuels and platform chemicals such as sugars, aldehydes and acids. Auxiliary methods such as catalysis, microwave and enzymatic techniques used in the transformations are covered. Both researchers and practitioners are certain to find a wealth of information in the individual chapters, which were written by experts in the field to provide an essential basis for assessing possible pretreatment and transformation routes of biomass using ionic liquids, and for developing new methods and chemical processes","torrent":{"xt":"urn:btih:c7cfd3f4ed5f0978c4eae12acae501ba7ec93e58","amp;dn":"Production+of+Biofuels+and+Chemicals+with+Ionic+Liquids","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c7cfd3f4ed5f0978c4eae12acae501ba7ec93e58","infoHashBuffer":{"type":"Buffer","data":[199,207,211,244,237,95,9,120,196,234,225,42,202,229,1,186,126,201,62,88]},"announce":[],"urlList":[]}}