{"title":"A. C. Grayling The Good Book A Humanist Bible (books)","uid":12128955,"size":1081192528,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:c92bd72a7f4042c842197cc1475a04827f71bf7a&amp;dn=A.+C.+Grayling+The+Good+Book+A+Humanist+Bible+%28books%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"twp6045","files":18,"time":1436989554,"description":"This torrent contains files for every complete book in The Good Book: A Humanist Bible, so there are only 17 audio files and 1 cover file. The CD uploaded version has 484 files each about 3 minutes long. Enjoy!\n\n\nHere is Amazon's summary:\n\nFew, if any, thinkers and writers today would have the imagination, the\nbreadth of knowledge, the literary skill, and-yes-the audacity to\nconceive of a powerful, secular alternative to the Bible. But that is\nexactly what A.C. Grayling has done by creating a non-religious Bible,\ndrawn from the wealth of secular literature and philosophy in both\nWestern and Eastern traditions, using the same techniques of editing,\nredaction, and adaptation that produced the holy books of the\nJudaeo-Christian and Islamic religions. The Good Book consciously\ntakes its design and presentation from the Bible, in its beauty of\nlanguage and arrangement into short chapters and verses for ease of\nreading and quotability, offering to the non-religious seeker all the\nwisdom, insight, solace, inspiration, and perspective of secular\nhumanist traditions that are older, far richer and more various than\nChristianity. Organized in 12 main sections----Genesis, Histories,\nWidsom, The Sages, Parables, Consolations, Lamentations, Proverbs,\nSongs, Epistles, Acts, and the Good----The Good Book opens with\nmeditations on the origin and progress of the world and human life in\nit, then devotes attention to the question of how life should be lived,\nhow we relate to one another, and how vicissitudes are to be faced and\njoys appreciated. Incorporating the writing of Herodotus and Lucretius,\nConfucius and Mencius, Seneca and Cicero, Montaigne, Bacon, and so many\nothers, The Good Book will fulfill its audacious purpose in every way","torrent":{"xt":"urn:btih:c92bd72a7f4042c842197cc1475a04827f71bf7a","amp;dn":"A.+C.+Grayling+The+Good+Book+A+Humanist+Bible+%28books%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c92bd72a7f4042c842197cc1475a04827f71bf7a","infoHashBuffer":{"type":"Buffer","data":[201,43,215,42,127,64,66,200,66,25,124,193,71,90,4,130,127,113,191,122]},"announce":[],"urlList":[]}}