{"title":"MKVToolNix 8.2.0 Final + Portable Multilanguage  - AppzDam","uid":12138913,"size":242037590,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:ca6f62ba165284c38436033c2778414468437a93&amp;dn=MKVToolNix+8.2.0+Final+%2B+Portable+Multilanguage++-+AppzDam&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"AppzDam","files":482,"time":1437301829,"description":"\nFor more info visit : appzdam.net\n\nMKVToolNix is a small collection of tools (mkvmerge, mkvinfo, mkvextract, mkvpropedit and mmg) that allows you to manipulate Matroska (MKV) files in several ways. You can use MKVToolNix to create, split, edit, mux, demux, merge, extract or inspect Matroska files. The program will also work with other video formats (AVI, MPEG, MP4, MPEG, Ogg/OGM, RealVideo, MPEG1/2, h264/AVC, Dirac, VC1) including some video codecs (such as VP9 video codec support - reading from IVF/Matroska/WebM files, extract to IVF files), audio (AAC, FLAC, MP2, MP3, (E)AC3, DTS/DTS-HD, Vorbis, RealAudio) and also most subtitle formats (SRT, PGS/SUP, VobSub, ASS, SSA etc.). This is a cross platform application that will work on Windows (both 32 and 64 bit versions), Mac OS X and Linux. Please note that from this page you can download the Windows (installer and portable) and Mac OS X versions.\n\nFeatures :\n\nThe multimedia container Matryoshka (Matroska) contains a video track (MKV), track (MKA) and subtitle track (MKS), as well as numerous service information, allowing you to create menus like DVD-movies to control timing and others. The number of tracks is not limited.\nSupports multiple subtitle formats: SRT, SSA, ASS, VobSub, and others. The resulting files from Mkvtoolnix play various media players, Linux / Unix and Matroska Direct Show for Windows.\n\n- Portable version (x32 / x64) program from the developer does not require installation\n\nWhat's New :\n\n* mkvmerge, MKVToolNix GUI: bug fix: fixed the container type not\nbeing recognized properly by the GUI. Now the numerical container\ntype ID is output in verbose identification mode by mkvmerge.\n\n* MKVToolNix GUI: chapter editor enhancement: the template for\nchapter names can now contain a number of places for the chapter\nnumber, e.g. ''. The number will be zero-padded if there\nare less places than specified.\n\n* MKVToolNix GUI: new chapter editor feature: implemented a\nfunction for renumbering chapters. This allows the user to\nautomatically assign new chapter names to one level of\nsub-chapters with ascending numbers. Implements #1355.\n\nSystem Requirements :\n\nWindows XP, Vista, 7, 8 / 8.1\n\nFAQ :\n\n1. It will work in 32 &amp; 64 bit systems ?\n\n- Yes,work for both 32 &amp; 64 bit\n\n2. Is this multilanguage?\n\n- Yes\n\n3. Is this Activated?\n\n- Activation not required.\n\n4. My antivirus detect as virus?\n\n- Just disable it until process not complete because some of antivirus count keygen,crack,patch as false +ve.\nDon't worry all files safely checked by us","torrent":{"xt":"urn:btih:ca6f62ba165284c38436033c2778414468437a93","amp;dn":"MKVToolNix+8.2.0+Final+%2B+Portable+Multilanguage++-+AppzDam","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ca6f62ba165284c38436033c2778414468437a93","infoHashBuffer":{"type":"Buffer","data":[202,111,98,186,22,82,132,195,132,54,3,60,39,120,65,68,104,67,122,147]},"announce":[],"urlList":[]}}