{"title":"Nature's Boldest Thieves HDTV x264 - GHOST DOG","uid":12139624,"size":292618748,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:ca8933e10598fdc13def71e8239186746cdbfcad&amp;dn=Nature%27s+Boldest+Thieves+HDTV+x264+-+GHOST+DOG&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"marxph","files":2,"time":1437321586,"description":"Presenter Lucy Cooke sets out to explore the phenomenon of seagulls, foxes, squirrels and badgers which are now living in our towns and stealing our food.\n\nStarting in the seaside resort of St Ives in Cornwall, Lucy witnesses for herself the seagulls that will swoop from 50 metres and steal a sandwich out of your hand. At the height of the summer season there are as many as 15 snatches a day from tourists. With the help of bird experts Professor Graham Martin and Steven Portugal, Lucy sets up a range of tests and GPS tagging to discover exactly what makes the seagulls such good thieves.\n\nLucy also goes to Rustington in Sussex, where she discovers that the fox population is increasing dramatically. She sets up a test to discover whether - given the choice - foxes would choose jam sandwiches and sausage rolls or the more natural diet of worms and fruit.\n\nLucy goes to Hertfordshire to encounter the black squirrel - a variety of the grey squirrel - which is now spreading through Hertfordshire and southern England. She observes it tackling a challenging homemade assault course built in a suburban garden in order to steal nuts from a bird feeder. And she explores how the unusual 180-degree ankle joint of a squirrel makes it such a good thief.\n\nBack in St Ives, Lucy discovers that badgers outnumber foxes in the town and they are regularly eating food from gardens. One family of badgers has developed a liking for peanut butter sandwiches!\n\nWith numbers of urban gulls up to around 250,000 in the UK and urban foxes and badgers on the increase, Lucy concludes that the phenomenon of seagulls, badgers, foxes and squirrels living in our towns and stealing our food is here to stay and we humans must learn to live alongside them.\n\n===================================================================================\nSource.......: HDTV\nSize.........: 279MB\nDuration.....: 00:49:05\nFormat.......: mp4\nResolution...: 640x360\nVideo........: h.264, 703Kbps @ 25 fps\nAudio........: aac, 93Kbps, 48 KHz, 2 channels\n===================================================================================\n\nghost dog","torrent":{"xt":"urn:btih:ca8933e10598fdc13def71e8239186746cdbfcad","amp;dn":"Nature%27s+Boldest+Thieves+HDTV+x264+-+GHOST+DOG","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ca8933e10598fdc13def71e8239186746cdbfcad","infoHashBuffer":{"type":"Buffer","data":[202,137,51,225,5,152,253,193,61,239,113,232,35,145,134,116,108,219,252,173]},"announce":[],"urlList":[]}}