{"title":"Introduction to Rocket Science and Engineering","uid":12161510,"size":6989363,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:cb9761ace27596ee1f628de3d6d948b7e25aec20&amp;dn=Introduction+to+Rocket+Science+and+Engineering&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"mdusanjay","files":1,"time":1437922873,"description":" Travis S. Taylor, &quot;Introduction to Rocket Science and Engineering&quot;.\n\n2009 | ISBN-10: 1420075284 | 324 pages | PDF | 7 MB\n\nAn overall view of the vast spectrum of knowledge needed by practicing rocket scientists and engineers, Introduction to Rocket Science and Engineering presents the history and basics of rocket theory, design, experimentation, testing, and applications. It covers an array of fields, from advanced mathematics, chemistry, and physics to logistics, systems engineering, and politics.\n\nThe text begins with a discussion on the discovery and development of rockets as well as the basic principles governing rockets and rocket science. It explains why rockets are needed from economic, philosophical, and strategic standpoints and looks at why the physics of the universe forces us to use rockets to complete certain activities. Exploring how rockets work, the author covers the concepts of thrust, momentum, impulse, and the rocket equation, along with the rocket engine, its components, and the physics involved in the generation of the propulsive force. He also presents several different types of rocket engines and discusses the testing of rocket components, subsystems, systems, and complete products. The final chapter stresses the importance of rocket scientists and engineers to think of the unusual, unlikely, and unthinkable when dealing with the complexities of rocketry","torrent":{"xt":"urn:btih:cb9761ace27596ee1f628de3d6d948b7e25aec20","amp;dn":"Introduction+to+Rocket+Science+and+Engineering","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cb9761ace27596ee1f628de3d6d948b7e25aec20","infoHashBuffer":{"type":"Buffer","data":[203,151,97,172,226,117,150,238,31,98,141,227,214,217,72,183,226,90,236,32]},"announce":[],"urlList":[]}}