{"title":"Britains Forgotten Slave Owners Complete Series 1 ENGSUBS [MPup]","uid":12151048,"size":1336281086,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:cc718253a1e525c8f796e7e2f1a1ca4d973017c8&amp;dn=Britains+Forgotten+Slave+Owners+Complete+Series+1+ENGSUBS+%5BMPup%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"makinapufterpup","files":7,"time":1437635480,"description":"Britains.Forgotten.Slave.Owners.Complete.Series.1.[request].ENG.SUBS.WEBRIP.[MPup]\n\nDocumentary looking at the abolition of slavery in Britain and the extraordinary choice by the government of the day to compensate slave owners for their loss of 'property'\n\n[img]http://extraimago.com/images/2015/07/23/fc4a57d6b0fa6105f193bbf2251319de.jpg[/img]\n\nFormat: MPEG-4\nSize: 832x468\nDisplayAspectRatio: 16:9\nFrameRate: 25.000 fps\nAudioCodec: AAC\nChannels: 2 channels\nSamplingRate: 48.0 KHz\n\n[b]Britains.Forgotten.Slave.Owners.s01e01.Profit.and.Loss.ENG.SUBS.WEBRIP.[MPup][/b]\n\nDavid Olusoga discovers the price of the abolition of slavery. Huge sums of money were paid out in compensation, not to slaves, but to the slave owners.\n\n[img]http://extraimago.com/images/2015/07/23/6e83cc6d1716d5e96c6d56a1a6ebcb85.jpg[/img]\n\nIn 1834 Britain abolished slavery, a defining and celebrated moment in our national history. What has been largely forgotten is that abolition came at a price. The government of the day took the extraordinary step of compensating the slave owners for loss of their 'property', as Britain's slave owners were paid Â£17bn in today's money, whilst the slaves received nothing.\n\nFor nearly 200 years, the meticulous records that detail this story have lain in the archives virtually unexamined - until now. In an exclusive partnership with University College London, historian David Olusoga uncovers Britain's forgotten slave owners. Forensically examining the compensation records, he discovers the range of people who owned slaves and the scale of the slavery business.\n\nWhat the records reveal is that the slave owners were not just the super-rich. They were widows, clergymen and shopkeepers - ordinary members of the middle-classes who exploited slave labour in distant lands. Yet many of them never looked a slave in the eye or experienced the brutal realities of plantation life.\n\nIn Barbados, David traces how Britain's slave economy emerged in the 17th century from just a few pioneering plantation owners. As David explores the systemic violence of slavery, in Jamaica he is introduced to some of the brutal tools used to terrorise the slaves and reads from the sadistic diaries of a notorious British slave owner. Elsewhere, on a visit to the spectacularly opulent Harewood House in Yorkshire, he glimpses how the slave owners' wealth seeped into every corner of Britain.\n\nFinally, amongst the vast slave registers that record all 800,000 men, women and children in British hands at the point of abolition, David counts the tragic human cost of this chapter in our nation's history.\n\n[b]Britains.Forgotten.Slave.Owners.s01e02.The.Price.of.Freedom.ENG.SUBS.WEBRIP.[MPup][/b]\n\nDavid Olusoga traces the bitter propaganda war waged between the pro-slavery lobby and the abolitionists.\n\n[img]http://extraimago.com/images/2015/07/23/c78095fe66fcc0729371f644c5cd1850.jpg[/img]\n\nHistorian David Olusoga continues his examination of Britain's forgotten slave owners. In this episode, David explores how in 1834 the government arrived at the extraordinary decision to compensate the slave owners with the equivalent of Â£17 billion in today's money. Tracing the bitter propaganda war waged between the pro-slavery lobby and the abolitionists, he reveals that paying off the slave owners for the loss of their human property was, ultimately, the only way to bring the system to an end.\n\nMeticulously kept records held at the National Archives detail the names of the 46,000 slave owners from across the British empire who had a slice of this vast hand-out. Combined with new research, shared exclusively with the BBC by University College London, it reveals more about Britain's slave owners than we've ever known before.\n\nOf the 46,000 names in the 1834 compensation records, 3,000 lived in Britain, yet they owned half of the slaves across the empire and pocketed half of the compensation money. These include members of the clergy and of the House of Lords. The records also show that at the point of abolition, more than 40 per cent of all the slave owners were women.\n\nDavid goes on to investigate what happened to the wealth generated by the slave system and compensation pay out. He reveals aspects of Britain's spectacular industrialisation in the 19th century, the consolidation of the City of London as a world centre of finance, and a number of the country's most well-known institutions that all have links to slave-derived wealth.\n\nUltimately, David discovers that the country's debt to slavery is far greater than previously thought, shaping everything from the nation's property landscape to its ideas about race. A legacy that can still be felt today","torrent":{"xt":"urn:btih:cc718253a1e525c8f796e7e2f1a1ca4d973017c8","amp;dn":"Britains+Forgotten+Slave+Owners+Complete+Series+1+ENGSUBS+%5BMPup%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cc718253a1e525c8f796e7e2f1a1ca4d973017c8","infoHashBuffer":{"type":"Buffer","data":[204,113,130,83,161,229,37,200,247,150,231,226,241,161,202,77,151,48,23,200]},"announce":[],"urlList":[]}}