{"title":"Arnhem 1944: The Airborne Battle, 17-26 September","uid":11119851,"size":11820969,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:cc73b8480a775204f07079dcfbaf8eabb90737aa&amp;dn=Arnhem+1944%3A+The+Airborne+Battle%2C+17-26+September&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"JinRohEX","files":-1,"time":1411901041,"description":"Arnhem 1944: The Airborne Battle, 17-26 September\nby Martin Middlebrook\n\nDESCRIPTION:\n\nThe battle of Arnhem was meant to end the war in Europe. The Germans were in retreat from Normmandy, apparently beaten. Montgomery decided on a bold gamble - three airborne divisions were to drop behind enemy lines, seize the bridges across the great rivers of Holland and open the heart of Germany to the advancing Allied armies. Unfortunately it all went wrong. The initial operation was successful and the areas taken by the American paratroopers were secured by ground troops. However, these troops could not reach Arnhem quickly enough. Meanwhile in the centre of the town of Arnhem, only a small part of the British First Airborne Division had reached - but not taken - the main bridge across the Rhine. Most of the British force was held up on the outskirts of the town by German units that had turned out to be far stronger than expected - a major intelligence failure. After nine davs of fighting, the survivors of the division managed to retreat to Allied lines. It was not until many months later that the Allies were able to finally cross the Rhine in strength and enter Germany. Blending research based on original documents with interviews with over 500 participants, this book tells the story of the battle for Arnhem.","torrent":{"xt":"urn:btih:cc73b8480a775204f07079dcfbaf8eabb90737aa","amp;dn":"Arnhem+1944%3A+The+Airborne+Battle%2C+17-26+September","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cc73b8480a775204f07079dcfbaf8eabb90737aa","infoHashBuffer":{"type":"Buffer","data":[204,115,184,72,10,119,82,4,240,112,121,220,251,175,142,171,185,7,55,170]},"announce":[],"urlList":[]}}