{"title":"Dead Man Cycling ENG SUBS WEBRIP [MPup]","uid":12207179,"size":665317232,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:cc8a1cf7e8a4602a38461754078f5191f98c1673&amp;dn=Dead+Man+Cycling+ENG+SUBS+WEBRIP+%5BMPup%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"makinapufterpup","files":4,"time":1438997027,"description":"BBC.Documentaries.2015.08.04.Dead.Man.Cycling.ENG.SUBS.WEBRIP.[MPup]\n\nFormat: MPEG-4\nSize: 832x468\nDisplayAspectRatio: 16:9\nFrameRate: 25.000 fps\nAudioCodec: AAC\nChannels: 2 channels\nSamplingRate: 48.0 KHz\n\nDocumentary exploring the life and career struggles faced by gold medal-winning Paralympian David Smith.\n\n[img]http://extraimago.com/images/2015/08/06/569f2e79c76b7f19c2f8fed137bd8ad2.jpg[/img]\n\nGold medal-winning Paralympian David Smith has faced many struggles in his life and career. The professional karate champion, athlete, bobsleigh brakeman, rower and now cyclist faces the biggest battle - for his life.\n\nDavid Smith was born with clubfoot and came close to having his feet amputated at birth. After spending his first three years learning to walk in special boots and plaster casts, a career in Olympic sport seemed doubtful. However, that was just a hurdle he needed to get over and it was not going to hold him back.\n\nDavid from Aviemore in the Scottish Highlands, is nothing if not determined. Despite his disability, he has succeeded in following his sporting dream first representing the UK at karate, Scotland at athletics and the UK at bobsleigh before deciding that rowing offered him the best possible chance of living his dream of Paralympic stardom.\n\nHowever, nine months before London, David was diagnosed with a rare tumour on his spinal column and battled to regain fitness after life threatening surgery. Determined to win gold again, this time in cycling in Rio, David received devastating news that the tumour had returned and another battle against the potentially lethal illness started.\n\nDead Man Cycling follows David over the 18 months before, during and after his second spinal surgery. It is an emotional story of David's sheer inner strength and utter determination as he fights to live and ultimately regain fitness.\n\nNever known to do anything by halves, David sets himself the seemingly impossible goal of attempting to cycle one of the world's most notorious cycling climbs - Mont Ventoux. Not once, but three times in a day - all just six months post-surgery. But, will the Dead Man Cycling make it?","torrent":{"xt":"urn:btih:cc8a1cf7e8a4602a38461754078f5191f98c1673","amp;dn":"Dead+Man+Cycling+ENG+SUBS+WEBRIP+%5BMPup%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cc8a1cf7e8a4602a38461754078f5191f98c1673","infoHashBuffer":{"type":"Buffer","data":[204,138,28,247,232,164,96,42,56,70,23,84,7,143,81,145,249,140,22,115]},"announce":[],"urlList":[]}}