{"title":"Olympia Rising (x64)","uid":12160084,"size":108126845,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:cd128e66d42c7ad7a5a2e9620b0b029ad8a8c07c&amp;dn=Olympia+Rising+%28x64%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"mercs215","files":1,"time":1437870511,"description":"Install instructions:\nNote: this version requires a 64-bit OS\n1. Extract and run &quot;olympia_rising.exe&quot;\n2. Play\nPLEASE REMEMBER TO SEED, MANY OTHERS WANT THIS GAME! :)\nIf you like this game, support the developers and BUY IT!\n\nTitle: Olympia Rising\nGenre: Action, Adventure\nDeveloper: Paleozoic \nPublisher: Paleozoic\t\nRelease Date: Jul 23, 2015\nStore page: http://store.steampowered.com/app/295910/\n\nAbout:\nOlympia Rising is a 2-D action platformer starring Iola - a young warrior who has been cast into the Underworld after meeting an untimely end. She must navigate through the various twisted regions of Hades' domain, fighting through hoards of deadly creatures as she attempts her escape, making her way to Mount Olympus. Lush pixel graphics and fluid animation bring this stylized world to life as you jump, climb, slash, and incinerate your way through each stage.Taking inspiration from beloved titles such as Castlevania, Sonic the Hedgehog, and Kid Icarus, Olympia Rising delivers an exciting, action-filled experience. \n- Fight your way through the Underworld, battling creatures of all shapes and sizes. Fast-paced aerial combat propels you upward as you slash enemies to bits with your blade or incinerate them with powerful magic. \n- Navigate through deadly environments with fluid maneuverability. Make your own paths as you traverse through each stage looking for the most efficient way to climb to the top. \n- Fierce boss encounters await Iola at the end of each Underworldy region - from gargantuan crabs to bone-crunching cyclops'. \n-Chain enemy kills as you jump through the air - build up a big combo to earn even more coins to pay Charon the Ferryman and pass through the many gates of the Underworld. \n- Simple to pick-up but difficult to master, Olympia Rising awards those willing to challenge themselves as they climb through the Underworld. Collect coins and other treasures scattered throughout the levels as you race through each stage. \n- Explore 6 unique, twisted environments of the Underworld - each offering different challenges and creatures to overcome.\n\nSystem Requirements\nMINIMUM: \nOS: Windows XP or later \nProcessor: IntelÂ® Pentium 4 / 2.0GHz \nMemory: 4 GB RAM \nGraphics: DirectX 9.0c compatible card, 128MB of VRAM \nHard Drive: 200 MB available space","torrent":{"xt":"urn:btih:cd128e66d42c7ad7a5a2e9620b0b029ad8a8c07c","amp;dn":"Olympia+Rising+%28x64%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cd128e66d42c7ad7a5a2e9620b0b029ad8a8c07c","infoHashBuffer":{"type":"Buffer","data":[205,18,142,102,212,44,122,215,165,162,233,98,11,11,2,154,216,168,192,124]},"announce":[],"urlList":[]}}