{"title":"Booster Gold v2 (001 - 047 + 1000000) (2007 - 2011) (Digital) (J","uid":11113415,"size":1692439966,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:cd8553f4c2d021f96c9ada2ffdf51771b7c0ec9f&amp;dn=Booster+Gold+v2+%28001+-+047+%2B+1000000%29+%282007+-+2011%29+%28Digital%29+%28J&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"nemesis43","files":49,"time":1411833687,"description":"Booster Gold v2 (001 - 047 + 1000000) (2007 - 2011) (Digital) (JK+Monafekk+Booster-Empire)\n\n\nBooster Gold (Volume 2)\n\nStarring: Booster Gold, Skeets, and Rip Hunter.\n\nSecond Feature: Blue Beetle (#21-25, 28-29).\n\nSpinning off of 52, Booster Gold's second series opens with Booster trying to join the Justice League of America. Most of the members mock him as he makes his pleas. Batman cites Booster's help with Brother Eye as a reason he should be given a chance and says if he can go a week without publicity stunts, grandstanding, or press conferences that Booster would be inducted as a member. Rip Hunter shows up at Booster's ancestor Daniel Carter's house and tries to recruit Booster and task him with &quot;fixing time&quot; by closing temporal anomalies. But Booster's accomplishments must remain a secret to everyone for if anyone knew they could easily kill him in his crib. So Booster Gold must become The Greatest Hero The World Has Never Known! Rip upgrades Booster's and Skeets' tech and then takes them on a jaunt through time. Once they complete the mission, Booster asks Rip to just drop him off where he picked them up and goes to the Hall of Justice. Superman and the rest of the League hand him a certificate that soon becomes a death certificate for Green Lantern. He lies to the League saying he just wanted an opportunity to turn them down. Booster finds Rip at his time lab and tells him that he's in under one condition: They have to save his best friend, Ted Kord.\n\nAfter that Rip takes Booster on a series of anomaly fixing, but when he won't help him save Ted a future Blue Beetle shows up along with Dan Garret and Jaime Reyes whom he had recruited. Booster and the Beetles leave to save Ted while Rip and a wounded Skeets stay behind. Once Ted is rescued he talks with Dan and Jaime. Jaime is thrilled to meet him and has so many questions, but the future Blue Beetle says that for Ted to live no one must know that he is alive and that he would have to erase Dan and Jaime's memory of the past 48 hours. With everyone back in their respective time, Ted and Booster head off for more exciting adventures.","torrent":{"xt":"urn:btih:cd8553f4c2d021f96c9ada2ffdf51771b7c0ec9f","amp;dn":"Booster+Gold+v2+%28001+-+047+%2B+1000000%29+%282007+-+2011%29+%28Digital%29+%28J","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cd8553f4c2d021f96c9ada2ffdf51771b7c0ec9f","infoHashBuffer":{"type":"Buffer","data":[205,133,83,244,194,208,33,249,108,154,218,47,253,245,23,113,183,192,236,159]},"announce":[],"urlList":[]}}