{"title":"Hubble's Universe: Greatest Discoveries and Latest Images [C-Q]","uid":12181260,"size":14651131,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:cd97dd67e48a6ca6806ca302a0f65bec7ed95ec8&amp;dn=Hubble%27s+Universe%3A+Greatest+Discoveries+and+Latest+Images+%5BC-Q%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Cquark","files":1,"time":1438449492,"description":"Book Description :\nThe Hubble Space Telescope. No other telescope combines instant name recognition with the production of consistently spectacular images. Yet few people outside of the astronomy community realize that Hubble is now at the apex of its imaging capabilities. A collection of stunningly detailed pictures, made possible by the new Wide Field Camera 3, has yet to be incorporated into a popular-level book. Until now.\n\nHubble's Universe will be the premier venue for the Hubble Telescope's most recent visual splendors. Bestselling astronomy writer Terence Dickinson showcases extraordinary late-breaking pictures, many of which have yet to receive wide distribution as news stories or in publications outside scientific papers, and presents a breathtaking portfolio drawn from an archive of over 500,000 existing Hubble images.\n\nThe accompanying text balances accuracy with accessibility, Dickinson's hallmark. And thanks to the author's familiarity with Hubble's history and discoveries and his access to top Hubble scientists for insight and accuracy, the text includes facts and tidbits not found in any other book. Combined with hundreds of brilliant images, the clear, succinct and illuminating narrative brings to life the fascinating forces at work in the universe","torrent":{"xt":"urn:btih:cd97dd67e48a6ca6806ca302a0f65bec7ed95ec8","amp;dn":"Hubble%27s+Universe%3A+Greatest+Discoveries+and+Latest+Images+%5BC-Q%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cd97dd67e48a6ca6806ca302a0f65bec7ed95ec8","infoHashBuffer":{"type":"Buffer","data":[205,151,221,103,228,138,108,166,128,108,163,2,160,246,91,236,126,217,94,200]},"announce":[],"urlList":[]}}