{"title":"Differential Ion Mobility Spectrometry","uid":12208560,"size":9435257,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ceb1c3f0aa8631c24dd2eaabd1ca34e716767842&amp;dn=Differential+Ion+Mobility+Spectrometry&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"clouderone","files":1,"time":1439043392,"description":"Differential Ion Mobility Spectrometry - Nonlinear Ion Transport and Fundamentals of FAIMS - Alexandre A. Shvartsburg (CRC, 2009).pdf\n\nISBN 978-1-4200-5106-3\n\nOver the last decade, scientific and engineering interests have been shifting from conventional ion mobility spectrometry (IMS) to field asymmetric waveform ion mobility spectrometry (FAIMS). Differential Ion Mobility Spectrometry: Nonlinear Ion Transport and Fundamentals of FAIMS explores this new analytical technology that separates and characterizes ions by the difference between their mobility in gases at high and low electric fields. It also covers the novel topics of higher-order differential IMS and IMS with alignment of dipole direction.\n\nThe book relates the fundamentals of FAIMS and other nonlinear IMS methods to the physics of gas-phase ion transport. It begins with the basics of ion diffusion and mobility in gases, covering the main attributes of conventional IMS that are relevant to all IMS approaches. Building on this foundation, the author reviews diverse high-field transport phenomena that underlie differential IMS. He discusses the conceptual implementation and first-principles optimization of FAIMS as a filtering technique, emphasizing the dependence of FAIMS performance metrics on instrumental parameters and properties of ion species. He also explores ion reactions in FAIMS caused by field heating and the effects of inhomogeneous electric field in curved FAIMS gaps.\n\nWritten by an accomplished scientist in the field, this state-of-the-art book supplies the foundation to understand the new technology of nonlinear IMS methods","torrent":{"xt":"urn:btih:ceb1c3f0aa8631c24dd2eaabd1ca34e716767842","amp;dn":"Differential+Ion+Mobility+Spectrometry","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ceb1c3f0aa8631c24dd2eaabd1ca34e716767842","infoHashBuffer":{"type":"Buffer","data":[206,177,195,240,170,134,49,194,77,210,234,171,209,202,52,231,22,118,120,66]},"announce":[],"urlList":[]}}