{"title":"James E. Perone, Elvis Costello: A Bio-Bibliography [PDF]","uid":12279777,"size":11870624,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d03606fa61d73c745dfaabc06dcf15cdaaa8a402&amp;dn=James+E.+Perone%2C+Elvis+Costello%3A+A+Bio-Bibliography+%5BPDF%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Hand_of_Doom","files":3,"time":1440398291,"description":" James E. Perone, Elvis Costello: A Bio-Bibliography (Bio-Bibliographies in Music) [PDF]\n\n\nThe influential rock musician Elvis Costello is recognized for the impressive breadth and scope of his music. His collaborations with such musicians as Tony Bennett and the Count Basie orchestra, however, attest to the many contradictions that define Elvis Costello, the punk rocker. This important guide to his music and career contains over 800 bibliographic citations and a complete discography of Costello's commercially released recordings. The discography, divided into two sections, separately details Costello's career as performer and composer. A brief biography traces his critically acclaimed career and highlights both the influences on his music and the myriad ways in which his music has influenced others.\n\nThe vast information compiled in this guide to further research is as interesting and diverse as Costello's career. Rock music scholars, musicologists, and Costello enthusiasts will appreciate the videography/filmography, bibliography of musical scores, and list of electronic resources that supplement the extensive discography and annotated bibliography. A works index and a general index make it easy to cross-reference and locate specific information","torrent":{"xt":"urn:btih:d03606fa61d73c745dfaabc06dcf15cdaaa8a402","amp;dn":"James+E.+Perone%2C+Elvis+Costello%3A+A+Bio-Bibliography+%5BPDF%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d03606fa61d73c745dfaabc06dcf15cdaaa8a402","infoHashBuffer":{"type":"Buffer","data":[208,54,6,250,97,215,60,116,93,250,171,192,109,207,21,205,170,168,164,2]},"announce":[],"urlList":[]}}