{"title":"Thieves of Fortune [VHSRip]","uid":12135636,"size":1259172856,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:d0a5d0a9c40ce3fa6e9cfb8def54daea92c93643&amp;dn=Thieves+of+Fortune+%5BVHSRip%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"lettucebe","files":1,"time":1437170401,"description":"In this action-packed romantic adventure story, a beautiful woman must perform feats of bravery in order to inherit a $28 million fortune and win the man she loves. Lots of stunts featuring planes, motorcycles, cliff diving, alligator wrestling and gun battles.\n\n\nTop User Review on IMDb:\n\n&quot;It shouldn't have worked. A very Ameirican actor playing a robust Spaniard. A low budget. Small amount of screen time for a legendary actor prominently displayed as one of the stars. Russel Savadier, an actor notorious for mugging and over acting in low budget b flicks. The combo seemed destined to failure. But it works! There are issues with broad stereotypes and budget restrictions, but the film ends up being very entertaining. Even Savadier is pretty amusing. Shawn Weathely is very likable and obviously very pretty. Nouri pulls off the super macho Spaniard (for the most part) and makes up for any slips into cartoonish caricature with good comedic timing and a lot of charisma. Craig Gardener could have been completely unlikable in his role, but manages some smarmy charm and decent comedic timing. He's not perfect but services the part way better than you'd expect. There's humor, adventure, action and a good amount of nudity that manages to be a combination of titillating and funny while also servicing the plot (and yes, a bit exploitive still). It plays a lot like a mix of Romancing the Stone and Victor/Victoria but with a solid R rating. Good natured and fun.&quot;\n\n\n-----------------------------------------------------------------------------------\n\nFile Format: .mp4\nFile Size: 1.1 GB","torrent":{"xt":"urn:btih:d0a5d0a9c40ce3fa6e9cfb8def54daea92c93643","amp;dn":"Thieves+of+Fortune+%5BVHSRip%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d0a5d0a9c40ce3fa6e9cfb8def54daea92c93643","infoHashBuffer":{"type":"Buffer","data":[208,165,208,169,196,12,227,250,110,156,251,141,239,84,218,234,146,201,54,67]},"announce":[],"urlList":[]}}