{"title":"Graphene-based Energy Devices","uid":12129871,"size":12267538,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d0b5decd0885ac78a7ee1a6910e44384f2132c92&amp;dn=Graphene-based+Energy+Devices&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"clouderone","files":1,"time":1437009283,"description":"Graphene-based Energy Devices (Wiley-VCH, 2015).pdf\n\nISBN 9783527338061\n\nThis first book dedicated to the topic provides an up-to-date account of the many opportunities graphene offers for robust, workable energy generation and storage devices.\nFollowing a brief overview of the fundamentals of graphene, including the main synthesis techniques, characterization methods and properties, the first part goes on to deal with graphene for energy storage applications, such as lithium-ion batteries, supercapacitors and hydrogen storage. The second part is concerned with graphene-based energy-generation devices, in particular conventional as well as microbial and enzymatic fuel cells, with chapters on graphene photovoltaics rounding off the book. Throughout, device architectures are not only discussed on a laboratory scale, but also ways for upscaling to an industrial level, including manufacturing processes and quality control. \nBy bridging academic research and industrial development this is invaluable reading for materials scientists, physical chemists, electrochemists, solid state physicists, and those working in the electrotechnical industry","torrent":{"xt":"urn:btih:d0b5decd0885ac78a7ee1a6910e44384f2132c92","amp;dn":"Graphene-based+Energy+Devices","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d0b5decd0885ac78a7ee1a6910e44384f2132c92","infoHashBuffer":{"type":"Buffer","data":[208,181,222,205,8,133,172,120,167,238,26,105,16,228,67,132,242,19,44,146]},"announce":[],"urlList":[]}}