{"title":"Lake.Mungo.2008.1080p.BluRay.x264-BRMP","uid":11125609,"size":8517826879,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:d0c69100c3a1adf06f28b4b1e87cdad97e21e69a&amp;dn=Lake.Mungo.2008.1080p.BluRay.x264-BRMP&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"GugaLanik","files":-1,"time":1411963687,"description":"A supernatural drama about grief.\n\nLake Mungo has been spoken of in terms of Blair Witch and Paranormal Activity but it's really a bird of a different feather. \n\nNot simply a &quot;found footage&quot; film, it's more like a segment you would see on NBC's Dateline rather than a first person camcorder account of escalating terror. \n\nPresented as a factual documentary, the film chronicles the mysterious events that occurred following the accidental drowning of 16 year old Alice Palmer. \n\nIn the weeks and months after her body was discovered, the grieving Palmer family began to experience paranormal experiences in and around their home and learned that their daughter had many more secrets than they could imagine. \n\nFar better made than the rudimentary Paranormal Activity, the film achieves its effects much more subtly. Dime-store demons aren't challenged to show themselves, nor are human footprints found on the Palmer's floor. \n\nParanormal Activity was a film that I forgot about the moment the lights came up in the theater. Its horrors were those of campfire tales and Halloween hayrides. Lake Mungo's horrors are far more disturbing as they center on very real fears of both the living and the dead. \n\nEven more impressively, it does a superb job of conveying the pain and turmoil a family experiences following the sudden, premature death of a loved one. \n\nThis is a film that stayed with me for days afterward. \n\n\n\nLake.Mungo.2008.1080p.BluRay.x264-BRMP\n\nBitrate: 11515 Kbps\n\nVideo resolution: 1920 x 1080\n\nAspect: 1.777:1\n\nFormat: DTS 5.1\n\nAudio bitrate: 1509 kbps\n\nLanguage: English\n\nSubtitles: English\n\nLength: 87 min\n\nGenre: Drama/Horror/Mystery\n\nIMDB Rating: 6.1/10 (6.843 votes)\n\n\n\nPlease keep sharing it for as long as you can.\n\nFeel free to leave a comment anytime.\n\nIf you enjoyed the movie, buy the Blu-ray. It costs only $9.74 at Amazon and the quality is obviously way much better than this compressed file.","torrent":{"xt":"urn:btih:d0c69100c3a1adf06f28b4b1e87cdad97e21e69a","amp;dn":"Lake.Mungo.2008.1080p.BluRay.x264-BRMP","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d0c69100c3a1adf06f28b4b1e87cdad97e21e69a","infoHashBuffer":{"type":"Buffer","data":[208,198,145,0,195,161,173,240,111,40,180,177,232,124,218,217,126,33,230,154]},"announce":[],"urlList":[]}}