{"title":"Actual File Folders 1.5 Multilingual","uid":12182792,"size":10288771,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:d0e00064b0b87444d617396506a9db75d7770587&amp;dn=Actual+File+Folders+1.5+Multilingual&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"mdusanjay","files":1,"time":1438486211,"description":"Actual File Folders 1.5 Multilingual | 10 MB\n\nAre you tired of constantly looking for your desired folder to open or save a file? Does a common dialog box annoy you? With Actual File Folders, you can switch between desired folders many times faster without long mouse manipulations. It will greatly increase your work productivity. In addition, Actual File Folders allows you to return to folders where you performed any actions. Just two additional title buttons for the Explorer dialog box will facilitate your work with PC at times. Actual File Folders is compatible with any software and Windows operating systems.\n\nThe Favorite Folders file folders extension lets you create a list of shortcuts to the folders you use most often. Then, you can invoke this list in any file-related window of any program to access any of your favorite folders instantly with a single click. This resembles the list of bookmarks for your favorite websites in your web browser. This is a good alternative to the tedious clicking for navigation to the required folder through the folders hierarchy.\n\nThe Recent Folders file folders extension automatically tracks which folders you have visited recently and keeps a list of shortcuts to those folders so you can return to them instantly with a single click. This resembles the browsing history in your web browser, where you can quickly return to a web page visited some time ago if circumstances require","torrent":{"xt":"urn:btih:d0e00064b0b87444d617396506a9db75d7770587","amp;dn":"Actual+File+Folders+1.5+Multilingual","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d0e00064b0b87444d617396506a9db75d7770587","infoHashBuffer":{"type":"Buffer","data":[208,224,0,100,176,184,116,68,214,23,57,101,6,169,219,117,215,119,5,135]},"announce":[],"urlList":[]}}