{"title":"The Animal In Me (Classic)","uid":12226337,"size":1384819199,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:d17d5d7addbf105f215db5782f816ee62ec04c55&amp;dn=The+Animal+In+Me+%28Classic%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"irealu69","files":1,"time":1439482195,"description":"The Animal In Me (Classic)\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\n\nCast: Colleen Brennan [Facial Swallow], Gina Valentino (as Gina Valentina) [Anal Facial], Heather Wayne [Creampie], Karen Summer\n\nDescription: Kirdy Stevens, AVN &amp; XRCO Hall of Fame director of the &quot;Taboo&quot; series, the most successful XXX rated series in history, brings another powerful story of lust and sensuality to the screen.\nMaggie Halliday (Colleen Brennan), romance novel writer par excellence, has a very perverse and kinky mind. She also has an all-consuming need to play sex games... to the limit! Successful, beautiful, and passionate, Maggie competes with her daughter Pepper (Karen Summer) for Pepper's young and virile boyfriends... especially when the handsome young Doctor Morgan (Jerry Butler) enters Pepper's life.\nThis is a story of raging passions, as mother and daughter vie for the men in their lives. Maggie's sex partner Travis (Greg Ruffner) is crude, but he fulfills the wanton and lascivious desires of the &quot;animal in her&quot;. Maggie's prim and proper secretary Glenda (Heather Wayne) is gradually seduced into interludes of depravity, as are all who enter Maggie's world. Also featured in this soaring extravaganza of sensuality are Gina Valentino, Tom Byron, Peter North, and Eugene Scott.\nKirdy Stevens, renown for his Taboo trilogy, has turned to the video camera for his latest exercise in sensuality. He proves, to me at least, that he is as proficient with this new art form as he is as the old game.\nSince Kirdy's obsession is familial, he turns this time from incest to mother-daughter rivalry. Mom has the hots for everyone, while daughter is saving herself for Mr. Right. However, once the kid hits the withdrawal window the first time, it leads to a run on the bank. Who gets whom in the end, I will let you find out for yourselves. Please do.\nThere is a footnote here. There may still be a few of us left who cling to the romantic, if antiquated, notion that man's spermatozoa was intended to be deposited, as it were, in the bank. In this film, thanks to Mr. Stevens, most of it is. I'm glad. It keeps the mess down and it'll keep you up.\n\nScreenshots:\n~~~~~~~~~~~~ &lt;a href=&quot;\nhttp://www.picturevip.com/x/clean/eOJ&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.picturevip.com/x/clean/eOJ&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.picturevip.com/x/clean/eOM&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.picturevip.com/x/clean/eOM&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.picturevip.com/x/clean/eON&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.picturevip.com/x/clean/eON&lt;/a&gt;\n\nVideos Info:\n~~~~~~~~~~~~\nSize: 1.290 GB\nDuration: 01:28:00 \t\nResolution: 720x576","torrent":{"xt":"urn:btih:d17d5d7addbf105f215db5782f816ee62ec04c55","amp;dn":"The+Animal+In+Me+%28Classic%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d17d5d7addbf105f215db5782f816ee62ec04c55","infoHashBuffer":{"type":"Buffer","data":[209,125,93,122,221,191,16,95,33,93,181,120,47,129,110,230,46,192,76,85]},"announce":[],"urlList":[]}}