{"title":"Day in the Life of Andy Warhol EN SUB x265 BBCrip [MPup]","uid":12299742,"size":243703891,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:d1ee90648e11d00b25a2162aabc6155e1cfdaefb&amp;dn=Day+in+the+Life+of+Andy+Warhol+EN+SUB+x265+BBCrip+%5BMPup%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"makinapufterpup","files":2,"time":1440683850,"description":"BBC.Documentaries.2015.08.25.A.Day.in.the.Life.of.Andy.Warhol.EN.SUB.x265.720p.WEBRIP.[MPup]\n\n[b]This is an [i]x265 MKV[/i] file. You may need to update your video codecs to play this file.[/b]\n\nFormat: HVEC\nSize: 1280x720\nDisplayAspectRatio: 16:9\nFrameRate: 25.000 fps\nAudioCodec: AAC\nChannels: 2 channels\nSamplingRate: 48.0 KHz\n\nStephen Smith meets Andy Warhol's friends and confidantes to get closer to the man behind the enigmatic public image, experiencing a day in the life of the pop art superstar.\n\n[img]http://extraimago.com/images/2015/08/27/28dcaffbb2e9a819ecb03175868551c1.png[/img]\n\nAndy Warhol created some of the most instantly recognisable art of the 20th century. But perhaps his greatest work of art was himself - the cool, enigmatic pop art superstar.\n\nIn this film, Stephen Smith sets out to discover the real Andy Warhol - in the hour-by-hour detail of his daily life.\n\nTaking a playful approach, mixing archive and entertaining encounters with Warhol's closest friends and confidantes, Stephen pieces together a typical day in the mid 1960s.\n\nBy 1964, Warhol had established himself as a famous pop artist and his creative ambitions were exploding in new directions in a creative frenzy of art, films - and even music.\n\nFrom an early-hours chat with John Giorno, Warhol's lover and star of his notorious film Sleep, to recreating Warhol's intimate telephone conversations with Factory superstar Brigid Berlin, Stephen immerses himself in the round-the-clock whirl of Warhol's daily life.\n\nVisiting the church where Warhol worshipped with his mother, discussing the day-to-day running of the Factory with Warhol's assistant Gerard Malanga, talking to Bibbe Hansen and Jane Holzer, stars of his famous Screen Tests, the film offers a fresh and illuminating new portrait of Warhol.\n\nAnd from the obsessive desire to document his everyday life to the endless fascination with fame and his own celebrity image, a day with Andy Warhol appears surprisingly familiar to 21st century eyes.\n\n&quot;In his lifetime&quot;, concludes Stephen, &quot;some people thought Warhol came from another planet. But in fact he hailed from somewhere equally exotic - the future.&quot;","torrent":{"xt":"urn:btih:d1ee90648e11d00b25a2162aabc6155e1cfdaefb","amp;dn":"Day+in+the+Life+of+Andy+Warhol+EN+SUB+x265+BBCrip+%5BMPup%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d1ee90648e11d00b25a2162aabc6155e1cfdaefb","infoHashBuffer":{"type":"Buffer","data":[209,238,144,100,142,17,208,11,37,162,22,42,171,198,21,94,28,253,174,251]},"announce":[],"urlList":[]}}