{"title":"Thin Lizzy Whiskey In The Jar  by Destiny.NL","uid":11096134,"size":162672779,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:d1fccc789bab20323612affd3a8d6350353d6c88&amp;dn=Thin+Lizzy+Whiskey+In+The+Jar++by+Destiny.NL&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"DestinyWRLD","files":-1,"time":1411598350,"description":"Thin Lizzy- Whiskey in the Jar. Avi by ErikB.NL\n\n\nBand consists of singer/guitarist James Hetfield, drummer Lars Ulrich, guitarist Kirk Hammett, and bass player Robert Trujillo.\n\n\nHere are the complete lineups of Metallica: Mark I - Lars Ulrich (Drums), James Hetfield (Vocals; Rhythm and Bass Guitars), Lloyd Grant (Lead Guitar). Mark II - Ulrich (Drums), Hetfield (Vocals; Rhythm Guitars), Dave Mustaine (Lead Guitar), Ron McGovney (Bass Guitar). Mark III - Ulrich (Drums), Hetfield (Rhythm Guitars), Mustaine (Lead Guitar), McGovney (Bass Guitar), Jef Warner (Vocals). Mark IV - Same as Mark II. Mark V - Ulrich (Drums), Hetfield (Vocals; Rhythm Guitars), Mustaine (Lead Guitar), Cliff Burton (Bass Guitar). Mark VI - Ulrich (Drums), Hetfield (Vocals; Rhythm Guitars), Kirk Hammett (Lead Guitar), Burton (Bass Guitar). Mark VII - Ulrich (Drums), Hetfield (Vocals; Rhythm Guitars), Hammett (Lead Guitar), 'Jason Newsted' (Bass Guitar). Mark IX- Ulrich (Drums), Hetfield (Vocals), Hammett (Lead Guitar), Newsted (Bass Guitar), Marshall (Rhythm Guitars - Stood in for James' guitar while his burned arm healed). Mark X - Ulrich (Drums), Hetfield (Vocals; Rhythm Guitars), Hammett (Lead Guitar), Robert Trujillo (Bass Guitar).\n\n\nThe group has sold 57 million albums in the US alone and 35 million albums sold outside the US. It has sold just over 90 million albums, making them one of the most commercially successful heavy metal acts in history.\n\n\nThe band is credited, along with the other &quot;big four&quot; thrash metal bands--Megadeth, Slayer and Anthrax--with bringing the genre to mainstream America.\n\n\nIn 1998 the band compiled a double CD called &quot;Garage Inc.&quot; The first CD contained newly recorded covers ranging from The Misfits, Thin Lizzy, 'Mercyful Fate' and Black Sabbath to more unexpected choices like 'Nick Cave' and Bob Seger (the band's cover of Seger's &quot;Turn the Page&quot; garnered extensive radio airplay). The second CD gathered together previously released covers, including the original &quot;The $5.98 E.P.: Garage Days Re-Revisited&quot;, which had become a scarce collector's item. The CD also included B-side covers going as far back as 1984.\n\n\nOn September 27, 1986, during a European leg of shows, bassist 'Cliff Burton' was killed near Ljungby, Sweden, when the band's tour bus skidded off an icy road and flipped over.\n\n\nOn March 7, 1999, the band was inducted into the San Francisco Walk of Fame. The mayor of San Francisco, Willie Brown, proclaimed the day &quot;Official Metallica Day&quot; in San Francisco.\n\n\nIn July, 2001, James Hetfield entered rehab due to &quot;alcoholism and other addictions&quot;.\n\n\nMetallica has won seven Grammy Awards: 1990: Best Metal Performance - &quot;One&quot; 1991: Best Metal Performance - &quot;Stone Cold Crazy&quot; 1992: Best Metal Performance With Vocal - Metallica 1999: Best Metal Performance - &quot;Better than You&quot; 2000: Best Hard Rock Performance - &quot;Whiskey in the Jar&quot; 2001: Best Rock Instrumental Performance - &quot;The Call of Ktulu&quot; with Michael Kamen and the San Francisco Symphony 2004: Best Metal Performance - &quot;St. Anger&quot;.\n\n\nMTV Video Music Awards: 1992: Best Metal Video - &quot;Enter Sandman&quot; 1996: Best Metal Video - &quot;Until it Sleeps&quot;.\n\n\nAmerican Music Awards: 1996: Favorite Artist: Heavy Metal/Hard Rock: Metallica - Re-Load 1996: Favorite Metal/Hard Rock Song - &quot;Until it Sleeps&quot;.\n\n\nBammies: 1997: Outstanding Drummer: Lars Ulrich; 1997: Outstanding Hard Rock Album: &quot;Re-Load&quot;.\n\n\nBillboard Music Awards: 1997: Billboard Rock and Roll Artist of the Year: Metallica (RIAA Diamond Award) 1999: Catalog Artist of the Year: Metallica 1999: Catalog Album of the Year: Metallica (&quot;The Black Album&quot;).\n\n\nGovernor's Award: 2004: Governor's Award - Metallica.\n\n\nKerrang! awards: 2003: Hall of Fame.\n\n\nMetallica were ranked by MTV the 3rd &quot;Greatest Heavy Metal Band in History&quot;, and is listed at #5 on VH1's &quot;100 Greatest Artists of Hard Rock&quot;.\n\n\nThey will first be eligible for the Rock and Roll Hall of Fame in 2007.\n\n\nEnnio Morricone is the composer of the piece &quot;The Ecstasy of Gold&quot; which Metallica used as an intro to all its live shows from late 1983 to 1995, and again from mid-1998 to the present day. The song is from the Sergio Leone movie, The Good, the Bad and the Ugly (1966).\n\n\nOn YouTube, a video can be seen of a concert in the early 1990s with a switched line-up, with Lars Ulrich on vocals, James Hetfield on drums, Jason Newsted on guitar and Kirk Hammett on bass.\n\n\nBay Area Metallibangers are Metallica fans from the Bay Area of California. The term was originated by the band, and the Bay Area Metallibangers were thanked in the liner notes in the albums &quot;Kill 'Em All&quot;, &quot;Ride the Lightning&quot; and &quot;Master of Puppets&quot;.\n\n\n&quot;Metallicats&quot; is another name given to fans of the band. It has also been used to refer to members of the band (for example, on the inside cover of the &quot;Garage, Inc.&quot; album.).\n\n\nAs of July 2007, the current band members are: James Hetfield [Vocals &amp; Guitar], Lars Ulrich [Drums], Kirk Hammett [Guitar &amp; Backup Vocals], and Robert Trujillo [Bass &amp; Backup Vocals].\n\n\nThe band's 2008 album, Death Magnetic, has the distinction of being one of very few albums released in the United States, by any artist, released on a day of the week other than Tuesday (in this case, Friday September 12.).\n\n\nAlthough Dave Mustaine left the band prior to the recording of Kill 'Em All, he is credited with co-writing songs on the band's first two albums.\n\n\nThe bass players of Metallica: Ron McGovney (only appears on pre-album recordings and demos 81-82), Cliff Burton (appears on first 3 studio albums 83-86), Jason Newsted (plays on all recordings 1987-2001), Bob Rock (producer, &quot;filled in&quot; the bass player slot during St. Anger sessions), and most recently, Robert Trujillo (appears on post-St. Anger Recordings.).\n\n\nDuring an early tour, the band was Ozzy Osbourne's opening act. Robert Trujillo, the band's current bassist, was formerly in Ozzy's band.\n\n\nInducted Black Sabbath into the Rock and Roll Hall of Fame, playing the song Hole in the Sky.\n\n\nDespite the band's immense popularity and nearly 30 years together, they have never released a Greatest Hits/Best Of compilation.\n\n\nReleased their highly anticipated ninth studio album &quot;Death Magnetic&quot;, produced by legendary producer Rick Rubin. [September 2008]\n\n\nMetallica announced that they will release a DVD containing all their videos from 1989 to 2004. The DVD will be called The Videos 1989-2004 and it will be released on December 4, 2006 worldwide and on December 5 in North America. [October 2006]\n\nVeel kijkplezier gewenst door:\nMuch fun by:\nErikB.NL\n\nFor the best movies!\n","torrent":{"xt":"urn:btih:d1fccc789bab20323612affd3a8d6350353d6c88","amp;dn":"Thin+Lizzy+Whiskey+In+The+Jar++by+Destiny.NL","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d1fccc789bab20323612affd3a8d6350353d6c88","infoHashBuffer":{"type":"Buffer","data":[209,252,204,120,155,171,32,50,54,18,175,253,58,141,99,80,53,61,108,136]},"announce":[],"urlList":[]}}