{"title":"Gate of the Sun pdf Elias Khoury - Bab al-Shams","uid":11116915,"size":11114139,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d315629aa1776f8f33d27299ba9cf71955eef729&amp;dn=Gate+of+the+Sun+pdf+Elias+Khoury+-+Bab+al-Shams&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"UnviolentPeacemaker","files":2,"time":1411863301,"description":"&quot;Few have held to the light the myths, tales, and rumors of both Israel and the Arabs with such discerning compassion . . . Gate of the Sun is an imposingly rich and realistic novel, a genuine masterwork.&quot;--The New York Times Book Review\n\nGate of the Sun, 2000. An epic re-telling of the life of Palestinian refugees in Lebanon since the 1948 Palestinian exodus, Gate of the Sun also addresses the ideas of memory, truth and story-telling. [2] It was made into a film by Egyptian director Yousry Nasrallah.\n\nAbout the Author\nElias Khoury is the author of eleven novels including The Journey of Little Gandhi, The Kingdom of Strangers, and Yalo. He is a professor of Middle Eastern and Islamic studies at New York University, and editor in chief of the literary supplement of Beirut's daily newspaper, An-Nahar.\n\nEditorial Reviews\n\nFrom Publishers Weekly\n\nFirst published in 1998 in Arabic by a Beirut publisher, and then translated into Hebrew and French, this book was Le Monde Diplomatique's Book of the Year in 2002; Khoury's ambitious, provocative, and insightful novel now arrives in the U.S. Well researched, deeply imagined, expressively written and overtly nostalgic, the book uses the lyrical flashback style of 1001 Arabian Nights to tell stories of Palestine. At a makeshift hospital in the Shatila refugee camp on the outskirts of Beirut, Dr. Khalil sits by the bed of his gravely ill, unconscious friend and patient, Yunes, a Palestinian fighter, and reminisces about their lives in an attempt to bring him back to consciousness. The collage of stories that emerges, ranging from the war of 1948 to the present, doesn't have a clear beginning or end, but narrows the dizzying scope of the Israeli-Palestinian conflict to comprehensible names and faces, including sympathetically tough and pragmatic women. Davies has translated Naguib Mahfouz and does a nice job with the lyrical, outsized text. Khoury, born in 1948 in Beirut, has authored 11 other novels (The Little Mountain and The Kingdom of Strangers are available in translation) and published numerous essays; he now teaches at NYU each spring. A film version of the book was shown in New York in 2004.\nCopyright Â© Reed Business Information, a division of Reed Elsevier Inc. All rights reserved. --This text refers to the Hardcover edition.\n\nReview\n&quot;Few have held to the light the myths, tales, and rumors of both Israel and the Arabs with such discerning compassion . . . Gate of the Sun is an imposingly rich and realistic novel, a genuine masterwork.&quot;--The New York Times Book Review\n \n&quot;Brilliant.&quot;--Edward Said, author of Orientalism\n \n&quot;Humanity and compassion are what give this rich and teeming narrative its shape, creating a work that in its essence is a heartfelt plea for sanity and peace.&quot;--The Christian Science Monitor\n \n&quot;[A] stunning novel . . . A literary masterpiece on par with the work of Palestinian poet Mahmoud Darwish and Egyptian novelist Naguib Mahfouz.&quot;--Tikkun\n \n&quot;After Elias Khoury's Gate of the Sun, readers can no longer pretend that Palestine is merely a fugitive state of mind, a convenient Arab myth, a traumatic tribal memory, and somebody else's problem. This remarkable novel out of Lebanon, a skillful reshuffling of the 1001 Nights with a doctor in a refugee camp playing the part of Scheherazade, fills in the blank spaces on the Middle Eastern map in our Western heads.&quot;--John Leonard, Harper's\n \n&quot;The Stories are not propaganda--they are the all too real lives of people yearning for justice or escape; whose plight lies at the heart of so much conflict in the Middle East and beyond. Perhaps only a novelist could tell it this way.&quot;--The Times (London)\n \n&quot;In Gate of the Sun a character dreams of writing a 'book without a beginning or end . . . an epic of the Palestinian people,' based on the stories of every village, and starting from the 'great expulsion of 1948.' Elias Khoury's monumental novel is in a sense that groundbreaking book.&quot;--The Guardian (U.K.)\n\n\nExcerpt. Â© Reprinted by permission. All rights reserved.\nChapter One\n \nUmm Hassan is dead.\n \nI saw everyone racing through the alleys of the camp and heard the sound of weeping. Everyone was spilling out of their houses, bent over to catch their tears, running.\n \nNabilah, Mahmoud al-Qasemi's wife, our mother, was dead. We called her mother because everyone born in the Shatila camp fell from their mother's guts into her hands.\n \nI too had fallen into her hands, and I too ran the day she died.\n \nUmm Hassan came from al-Kweikat, her village in Galilee, to become the only midwife in Shatila - a woman of uncertain age and without children. I only knew her when she was old, with stooped shoulders, a face full of creases, large eyes shining in a white square, and a white cloth covering her white hair.\n \nOur neighbor, Sana', the wife of Karim al-Jashi the kunafa* seller, said Umm Hassan dropped in on her the night before last and told her her death was coming.\n \n&quot;I heard its voice, daughter. Death whispers, and its voice is soft.&quot;\n \nSpeaking in her half-Bedouin accent she told Sana' about the messenger of death.\n \n&quot;The messenger came in the morning and told me to get ready.&quot;\n \nAnd she told Sana' how she wanted to be prepared for burial.\n \n&quot;She took me by the hand,&quot; said Sana', &quot;led me to her house, opened her wooden trunk, and showed me the white silk shroud. She told me she would bathe before she went to sleep: 'I'll die pure, and I want only you to wash me.' &quot;\n \nUmm Hassan is dead.\n \nEveryone knew that this Monday morning, November 20th, 1995, was the time set for Nabilah, Fatimah's daughter, to meet death.\n \nEveryone awoke and waited, but no one was brave enough to go to her house to discover she was dead. Umm Hassan had told everyone, and everyone believed her.\n \nOnly I was taken by surprise.\n \nI stayed with you until eleven at night, and then, exhausted, I went to my room and slept. It was night, the camp was asleep, and no one told me.\n \nBut everyone else knew.\n \nNo one would question Umm Hassan because she always told the truth. Hadn't she been the only one to weep on the morning of June 5, 1967? Everyone was dancing in the streets, anticipating going home to Palestine, but she wept. She told everyone she'd decided to wear mourning. Everyone laughed and said Umm Hassan had gone mad. Throughout the six long days of the war she never opened the windows of her house; on the seventh, out she came to wipe away everyone's tears. She said she knew Palestine would not come back until all of us had died.\n \nOver the course of her long life, Umm Hassan had buried her four children one after the other. They would come to her borne on planks, their clothes covered in blood. All she had left was a son called Naji, who lived in America. Though Naji wasn't her real son, he was: She had picked him up from beneath an olive tree on the Kabri-Tarshiha road and had fed him from her dry breasts, then returned him to his mother when they reached the village of Qana, in Lebanon.\n \nUmm Hassan died today.\n \nNo one dared go into her house. About twenty women gathered to wait, then Sana' came and knocked on the door, but no one opened it. She pushed it, it opened, she went in and ran to the bedroom. Umm Hassan was sleeping, her head covered with her white headscarf. Sana' went over and took her by the shoulders, and the chill of death flowed into the hands of the kunafa-seller's wife, who screamed. The women entered, the weeping began, and everyone raced to the house.\n \nI, too, would like to run with the others, go in with them, see Umm Hassan sleeping her eternal sleep and breathe in the smell of olives that clung to her small home.\n \nBut I didn't weep.\n \nFor three months I've been incapable of reacting. Only this man floating above his bed makes me feel the throb of life. For three months he's been laid out on his bed in Galilee Hospital, where I work as a doctor, or where I pretend that I'm a doctor. I sit next to him, and I try. Is he dead or alive? I don't know - am I helping or tormenting him? Should I tell him stories or listen to him?\n \nFor three months I've been in this room.\n \nToday Umm Hassan died, and I want him to know, but he doesn't hear. I want him to come with me to her funeral, but he won't get up.\n \nThey said he fell into a coma.\n \nAn explosion in the brain causing permanent damage. A man lies in front of me, and I have no idea what to do. I'll just try not to let him rot while he's still alive, because I'm sure he's asleep, not dead.\n \nBut what difference does it make?\n \nIs it true what Umm Hassan said about a sleeper being like a dead man - that the sleeper's soul leaves his body only to return when he wakes, but that the dead man's soul leaves and doesn't come back? Where is the soul of Yunes, son of Ibrahim, son of Suleiman al-Asadi? Has it left him for a distant place, or is it hovering above us in the hospital room, asking me not to go because the man is immersed in distant darknesses, afraid of the silence?\n \nI swear I've no idea.\n \nOn her first visit Umm Hassan said that Yunes was in torment. She said he was in a different place from us.\n \n&quot;So what should I do?&quot; I asked her.\n \n&quot;Do what he tells you,&quot; she answered.\n \n&quot;But he doesn't speak,&quot; I said.\n \n&quot;Oh yes, he does,&quot; she said, &quot;and it's up to you to hear his voice.&quot;\n \nAnd I don't hear it, I swear I don't, but I'm stuck to this chair, and I talk and talk.\n \nTell me, I beg of you, what should I do?\n \nI sit by your side and listen to the sound of weeping coming through the window of your room. Can't you hear it?\n \nEveryone else is weeping, so why don't you?\n \nIt's become our habit to look out for occasions to weep, for tears are dammed up behind our eyes. Umm Hassan has burst open our reservoir of tears. Why won't you get up and weep?\n \nCopyright Â© 1998 by Elias Khoury. English translation. Copyright Â© 2006 by Humphrey Davies. All rights reserved.","torrent":{"xt":"urn:btih:d315629aa1776f8f33d27299ba9cf71955eef729","amp;dn":"Gate+of+the+Sun+pdf+Elias+Khoury+-+Bab+al-Shams","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d315629aa1776f8f33d27299ba9cf71955eef729","infoHashBuffer":{"type":"Buffer","data":[211,21,98,154,161,119,111,143,51,210,114,153,186,156,247,25,85,238,247,41]},"announce":[],"urlList":[]}}