{"title":"Pubic Hair Combed In Thai Beauty Parlour","uid":12156678,"size":937618719,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:d65559d89c6f23e86ac431d443f418edb3a4cab2&amp;dn=Pubic+Hair+Combed+In+Thai+Beauty+Parlour&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"sarah.jensen","files":1,"time":1437797878,"description":"Moy spend hours in the beauty parlour. Because she is beautiful. Fucking incredible. She makes the best of herself, her face must be made up carefully and subtly. Her hair has multiple coats of conditioner, is soft, silky, straight and long. It flows over her shoulders and delicious micro tits. It has life and buoyancy. It is most important that hair be perfect. Also eye lashes and eyebrows. Eyebrows must be soft, thick and full, slightly tapered to the outer edges and with a definite stop in the middle. Equally important, and often seen is Moy's pubic hair. She has gorgeous lithe hips and a small pert bottom. Her vagina is clean well defined and not overly large. A nice shade of pink. But her pubic hair is her show piece. Jet black, medium short, and not curly, but wavy. Soft, thick in the middle. It can be brushed forwards a few inches, but it is usually curled casually so it sits neatly in the front of her panties, when she wears them. All this is done in the beauty parlour. They are not going to let you in, it is a girls' place, but you can look through the window. There are all the girls getting their hair done, and nails painted, spending good money on raising their net worth. And there will be Moy, lying on the raised bed, with one assistant applying makeup to her face, and another assistant gently combing her pubes. It is a rare sight at a beauty parlour, but an essential process for Moy. She knows that passers by look in. She is not shy. You would not be if you had a body and face like that. She is designed for showing off. When she is lying on my coffee table with my penis in her sweet pink vagina, she looks perfect. When she kneels on the floor sucking my penis, she gazes at the camera, and shows off her perfect face, with my cock in her gob. High definition video of highly defined parlour girl","torrent":{"xt":"urn:btih:d65559d89c6f23e86ac431d443f418edb3a4cab2","amp;dn":"Pubic+Hair+Combed+In+Thai+Beauty+Parlour","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d65559d89c6f23e86ac431d443f418edb3a4cab2","infoHashBuffer":{"type":"Buffer","data":[214,85,89,216,156,111,35,232,106,196,49,212,67,244,24,237,179,164,202,178]},"announce":[],"urlList":[]}}