{"title":"HISTORY OF POP AND ROCK MUSIC - part 585","uid":12116546,"size":347342331,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:d69b8591370ccb8ef169fbe18b416509a7229e85&amp;dn=HISTORY+OF+POP+AND+ROCK+MUSIC+-+part+585&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"pupovaczlatko","files":5,"time":1436729535,"description":"\n\n            EAGLES  -  Doolin-Dalton / Desperado  (1974) \n\n\n\n                    This song tells the story of the infamous Wild West gang, The Dalton Gang. Formed in 1888, the gang consisted mainly of train robbers in what was the Oklahoma Territory and included the Dalton brothers, Bill Doolin, Bittercreek Newcomb and many other famous outlaws. In 1892, after many members of the gang had already been killed, 5 members including 3 of the Dalton brothers were ambushed and killed in Coffeyville. Bill Doolin, Bittercreek Newcomb and Charlie Pierce, the last surviving members, recruited 7 more outlaws and formed the Doolin-Dalton Gang to exact revenge on the deaths and continue on with their lives of crime. The song ends here, leaving what happens afterward unknown, but in real life, by 1898, every member had been killed. \n\n           Glenn Frey, J.D. Souther, Don Henley and Jackson Browne are the writers on this song. Frey, Souther and Browne lived in the same apartment complex in Los Angeles before the band formed, which is when they started writing this song. After they wrote the song &quot;Desperado,&quot; Henley and Frey decided to work on this one to go with their Old West theme, which also included the song &quot;Tequila Sunrise.&quot; It marked one of the first songwriting collaborations for Henley and Frey, who didn't write together on the Eagles first album. &quot;Doolin-Dalton&quot; was used as the first track on their second album","torrent":{"xt":"urn:btih:d69b8591370ccb8ef169fbe18b416509a7229e85","amp;dn":"HISTORY+OF+POP+AND+ROCK+MUSIC+-+part+585","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d69b8591370ccb8ef169fbe18b416509a7229e85","infoHashBuffer":{"type":"Buffer","data":[214,155,133,145,55,12,203,142,241,105,251,225,139,65,101,9,167,34,158,133]},"announce":[],"urlList":[]}}