{"title":"[MomsLickTeens] Pussy Preferred [07.08.2015] 1080p PLUS Full Pic","uid":12121683,"size":3328105178,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:d6cb7f1078c49b06784df031d6f6d257a463e4df&amp;dn=%5BMomsLickTeens%5D+Pussy+Preferred+%5B07.08.2015%5D+1080p+PLUS+Full+Pic&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"ingeniosi","files":8,"time":1436834351,"description":"Screens:\nPictures:\n\n\n\nDava reached her tipping point when her stepdaughter, Liza, nonchalantly said that she returned home around 3 am. It wasn't Liza's first time missing her curfew. Dava pleaded with her stepdaughter to do more with her life after graduating H.S. but Liza only wanted to hang with her friends or watch t.v. all day. Liza lacked ambition to hold down a job and contribute to the household so Dava offered her part time job with her private company. Liza was surprisingly interested in her stepmom's secret affairs. Dava explained to Liza that she needed to learn how to take care her high-end clients and that she was willing to teach her. Soon after, Dava had a taste of Liza's sweet lips and then eased her way down her sweet pussy. Initially Liza was in shock but she calmed her nerves and enjoyed the wet tongue licking her clam. Dava relentlessly tongue fucked and licked her tight little asshole. After having multiple orgasms for the first time, Liza found her self sucking on her stepmom's clit. She loved every minute of her experience and learned everything she needed to start her new job.\n\nCast: Dava Foxx Liza Rowe\n\nTags: 1on1 asslick bigtits blonde chic glasses hairy lesbian lingerie masturbation mature piercings pussy-licking stockings tanlines tattoo teen trimmed white","torrent":{"xt":"urn:btih:d6cb7f1078c49b06784df031d6f6d257a463e4df","amp;dn":"%5BMomsLickTeens%5D+Pussy+Preferred+%5B07.08.2015%5D+1080p+PLUS+Full+Pic","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d6cb7f1078c49b06784df031d6f6d257a463e4df","infoHashBuffer":{"type":"Buffer","data":[214,203,127,16,120,196,155,6,120,77,240,49,214,246,210,87,164,99,228,223]},"announce":[],"urlList":[]}}