{"title":"Oriland Balloon Ride(PDF,Retail){32Skulls}","uid":11115802,"size":38055319,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d73e914dd812b21e8b279cf976a0c91674ec09ce&amp;dn=Oriland+Balloon+Ride%28PDF%2CRetail%29%7B32Skulls%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"32Skulls","files":-1,"time":1411854694,"description":"                     â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ \n\nORILAND BALLOON RIDE is a book from Origami Sky Series by Oriland authors that will teach you how to create fabulous origami hot air balloons of various shapes from the classic &quot;inverted tear drop&quot; balloons to the sophisticated round balloons a la Montgolfier!\nBegin your origami balloon adventure! Do-It-Yourself - fold these fantastic Oriland designs, originally created by Yuri and Katrin Shumakov - Hot Air Balloon (Outside Top Lock), Square Basket, 1-Piece Hot Air Balloon (Outside Top Lock), 1-Piece Tubby Balloon (Outside Top Lock), Hot Air Balloon (Inside Top Lock), 1-Piece Hot Air Balloon (Inside Top Lock), 1-Piece Tubby Balloon (Inside Top Lock), Montgolfier Balloon (8-Module Envelope), Round Basket, Montgolfier Balloon (4-Module Envelope), Montgolfier Balloon (1-Piece Envelope). The components of balloons are folded and connected together without any glue, just using paper locks. Among these designs, there are balloon envelopes on all tastes - multi-piece and one-piece.\nAs a bonus this book offers an original printable colour pattern, especially designed for the Montgolfier Balloon (8-Module Envelope) to get a marvelous balloon colouring that resembles the Montgolfier brothers' historic balloon!\nAs a preamble to the theme this book offers authors' article 'Origami Balloon Intro', which sheds light on Oriland balloon designs and its different variations and gives practical advises. There are 760 detailed step-by-step colorful diagrams with extensive comments, placed on 164 pages that will guide you through folding the 11 original origami designs of the Oriland style. The 'Photo Gallery' section shows you pictures of all the designs presented in the book. The 'Origami Symbols' section is explaining international origami symbols to help you to read diagrams for folding. In each article, there are recommendations on paper size and indication to the model size resulting from the size of starting paper. The models are intermediate and complex level of folding as shown by stars in the book and are a good challenge for the novice folder and the expert alike.\n\nFor your convenience, each article in this eBook (PDF file) is bookmarked for quick and easy access! Hope you will enjoy the book with all the presented designs, shown in every detail through vector and photo-diagrams. With this book you can fold the whole fleet of origami balloons! Have a great Oriland Balloon Ride! Happy folding!\n\n\nBy Yuri Shumakov, Katrin Shumakov\nPublished by oriland.com in 2012\nPDF, Retail, 164 pages, English ","torrent":{"xt":"urn:btih:d73e914dd812b21e8b279cf976a0c91674ec09ce","amp;dn":"Oriland+Balloon+Ride%28PDF%2CRetail%29%7B32Skulls%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d73e914dd812b21e8b279cf976a0c91674ec09ce","infoHashBuffer":{"type":"Buffer","data":[215,62,145,77,216,18,178,30,139,39,156,249,118,160,201,22,116,236,9,206]},"announce":[],"urlList":[]}}