{"title":"Dead Can Dance - Toward The Within (1994) 2008 MFSL-SACD-DFF","uid":11134579,"size":2876123989,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:d8f43d5ec64fb88d7a55965fd14878048391340d&amp;dn=Dead+Can+Dance+-+Toward+The+Within+%281994%29+2008+MFSL-SACD-DFF&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":6,"uploader":"hal4000","files":-1,"time":1412094462,"description":"Dead Can Dance is an English-Australian musical project that formed in 1981 in Melbourne by Lisa Gerrard and Brendan Perry. The band relocated to London, England, in May 1982. Australian music historian Ian McFarlane described Dead Can Dance's style as &quot;constructed soundscapes of mesmerising grandeur and solemn beauty; African polyrhythms, Gaelic folk, Gregorian chant, Middle Eastern mantras and art rock.&quot;\n\nA large reason that Dead Can Dance tours and performances were so praised by hardcore fans lay in the band's welcome preference for unknown and otherwise unheard material, rather than simply rehashing expected numbers. Bootlegging of these tracks and performances was understandable and widespread, so involved and passionate was the band's following. Recorded at a Los Angeles performance from the Into the Labyrinth tour, the astounding Toward the Within shows that the band's magic was clearly not simply something created in studio. Both lead performers are simply in excelsis, their vocal abilities hardly diminished by the rigors of the road -- if anything, they sound even more inspired as a result. The range of instruments tackled is testimony to the group's breadth, from the yang ch'in, a Chinese equivalent to hammered dulcimer, to a wide range of drums. As for the songs, only four of the fifteen had been officially released before, including fine takes on &quot;Cantara,&quot; &quot;Song of the Sibyl&quot; and &quot;Yulunga (Spirit Dance).&quot; As for the numerous new delights, Perry has a number of solo or near-solo tracks he performs with acoustic guitar. These include the lovely &quot;American Dreaming&quot; and the mystical set-closing &quot;Don't Fade Away,&quot; calling to mind Tim Buckley's sense of scope and vision. Gerrard's unquestioned highlight is the combination of &quot;Tristan&quot; and &quot;Sanvean,&quot; the latter of which is an awesome, widescreen number that became an undisputed highlight on her solo debut The Mirror Pool. Perhaps the most astonishing numbers are &quot;Rakim,&quot; featuring a striking intertwining of Perry and Gerrard's singing, and a version of Sinead O'Connor's &quot;I Am Stretched on Your Grave&quot; that redefines passionate drama.\n\nDFF files extracted with Scarletbook\n    &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/10942620/Scarletbook-SACD-Extractor&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/10942620/Scarletbook-SACD-Extractor&lt;/a&gt;\n\nfrom the 2008 Mobile Fidelity Sound Lab SACD.\n\nSACD-ISO-DFF-1Bit-2.8Mhz.\n\n","torrent":{"xt":"urn:btih:d8f43d5ec64fb88d7a55965fd14878048391340d","amp;dn":"Dead+Can+Dance+-+Toward+The+Within+%281994%29+2008+MFSL-SACD-DFF","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d8f43d5ec64fb88d7a55965fd14878048391340d","infoHashBuffer":{"type":"Buffer","data":[216,244,61,94,198,79,184,141,122,85,150,95,209,72,120,4,131,145,52,13]},"announce":[],"urlList":[]}}