{"title":"The Unprecedented Garden of Life - Sudhir Mittal","uid":11093540,"size":1825643,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d9694bb7fb6feb89b3aa8b63e1885e33dbb38836&amp;dn=The+Unprecedented+Garden+of+Life+-+Sudhir+Mittal&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Mohammad_AT","files":3,"time":1411519558,"description":"'Garden of Life' is not an accident; it's destiny. No matter which way you walk your life, you're nevertheless destined to reach here. It is not about secrets; instead it's about unfolding them. Your journey of life doesn't ever complete unless you've been to it; even when you were to take incarnations after incarnations. It's an Opportunity, the biggest one that you've always subconsciously subscribe for.\n\nBelieve it or not! No book in the world can ever get you your 'constant' state of completeness with life, but certainly 'The Unprecedented Garden of Life' makes you have faith in that. Inside here is an outstanding beautiful story, which makes you meet, roam with and talk to a little angel girl. She is as innocent and cute as a 4 years' engaging child be. Being a stranger, she crosses your way in mysterious fooling circumstances. She can't stop chaffing with you. She even takes care as if a mother would. While irresistibly pulling you in countryside, through her innocent moves, she makes you learn how to be at real terms with life. Even though bedazzled, you never get to know her real being, for she never gives you a chance for that. She keeps your mind ever busy, just exact to her plans.\n\nAnd finally she leaves you alone in the 'Garden of Life', yes, the unprecedented one. You don't take long to understand that certainly it was Your Own garden of life. Though it turns difficult upon you to glance at or perceive the interiors of garden, but it's never deprived of meanings and purposes. Though it never typically looks like a garden, but soon you realize that it is much beyond.\n\nThis story is not about some protagonist, nor even myself for that matter; for it is invariably about you. In literary world, very few books have been written in such gripping manner. Here you will become the protagonist; because you will constantly relate yourself with the one in the story. Just when you will enter the garden, you will come to a realization that how closely the entire plot was knitted around you by the little girl. You already intuited it; she was never an ordinary girl.\n\nAnd just when you will start coming across each of the seven mysterious lampposts, the 'Garden of Life' will overwhelm you. These seven lampposts are million dollars worth in your life; or perhaps even more. Read here a gist of lampposts' titles:\n\nWhen will You Die?\nWorld is Not Bad; It is Mix\nRealize Happiness in The Proximity First\nCommand Your Daily Inspiration\nFind Your Subtlest World\nMaster Your Work and Live Fearlessly\nThe Supreme Knowledge\nYour entire experience in the 'Garden of Life' will be unprecedented, yet most enlightening; and therefore immensely fulfilling as well. When you come out of the Garden in almost ecstatic state and meet the little girl outside once again, you come across even newer dimensions of her plan. It's alone she who was behind those mysterious fooling circumstances since the very beginning.\n\nThis book, at some places, is also available in its original title as - See You God. But here, 'The Unprecedented Garden of Life' also uniquely contains the invaluable 365 after-thoughts. These after-thoughts can be said to be the contemplations into various nitty-gritties of life, especially after familiarizing with one's Garden of Life forever. There is also another reason behind this renamed publication. The other title name 'See You God' runs a chance of appearing to many people as a book which is written for those who believe in God in only contemporary ways. But the truth is that, this is a kind of book which has been exclusively written for those who take pride in not believing in God ever.\n\nNonetheless, whatever be the kinds of readers or the names given to the books, all we wish is your overwhelming experience with the seven lampposts to be searched by you in the 'Garden of Life'. We repeat; this garden is as unprecedented as enjoyably it is in the end. Have wonderful reading &amp; never-ending smiles.","torrent":{"xt":"urn:btih:d9694bb7fb6feb89b3aa8b63e1885e33dbb38836","amp;dn":"The+Unprecedented+Garden+of+Life+-+Sudhir+Mittal","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d9694bb7fb6feb89b3aa8b63e1885e33dbb38836","infoHashBuffer":{"type":"Buffer","data":[217,105,75,183,251,111,235,137,179,170,139,99,225,136,94,51,219,179,136,54]},"announce":[],"urlList":[]}}