{"title":"Transport Phenomena in Porous Media III - Derek B Ingham, Ioan P","uid":12117961,"size":29039910,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d992984c6cc42506d85a88ab6d5acf28d39c08d5&amp;dn=Transport+Phenomena+in+Porous+Media+III+-+Derek+B+Ingham%2C+Ioan+P&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"clouderone","files":1,"time":1436763223,"description":"Transport Phenomena in Porous Media III - Derek B Ingham, Ioan Pop (Elsevier, 2005).pdf\n\nISBN: 0-0804-4490-3\n\nFluid and flow problems in porous media have attracted the attention of industrialists, engineers and scientists from varying disciplines, such as chemical, environmental, and mechanical engineering, geothermal physics and food science. There has been a increasing interest in heat and fluid flows through porous media, making this book a timely and appropriate resource. \nEach chapter is systematically detailed to be easily grasped by a research worker with basic knowledge of fluid mechanics, heat transfer and computational and experimental methods. At the same time, the readers will be informed of the most recent research literature in the field, giving it dual usage as both a post-grad text book and professional reference. \nWritten by the recent directors of the NATO Advanced Study Institute session on 'Emerging Technologies and Techniques in Porous Media' (June 2003), this book is a timely and essential reference for scientists and engineers within a variety of fields","torrent":{"xt":"urn:btih:d992984c6cc42506d85a88ab6d5acf28d39c08d5","amp;dn":"Transport+Phenomena+in+Porous+Media+III+-+Derek+B+Ingham%2C+Ioan+P","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d992984c6cc42506d85a88ab6d5acf28d39c08d5","infoHashBuffer":{"type":"Buffer","data":[217,146,152,76,108,196,37,6,216,90,136,171,109,90,207,40,211,156,8,213]},"announce":[],"urlList":[]}}