{"title":"Susan Kay - Phantom (Epub, Mobi)","uid":11087443,"size":2163396,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:dbe3827afa4814e667a1e857de1f117b7b370108&amp;dn=Susan+Kay+-+Phantom+%28Epub%2C+Mobi%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"karaokeking123","files":-1,"time":1411433857,"description":"Susan Kay - Phantom (Epub, Mobi)\n\n\nRequirements: ePUB, MOBi Reader, Size: 1.94 Mb\nOverview: The story of Eric, the Phantom of the Opera\n\n.\n\nRetelling and expanding upon a well known and beloved classic is risky business, but Kay acquits herself with brio in this retelling of Gaston Leroux's 1911 tale, The Phantom of the Opera . In a powerful and moving tour de force, she adds a new depth and perspective, moving well beyond the familiar boundaries of the story. This version begins with the birth of the horribly disfigured Erik and continues into the years following his doomed romance with Christine, ending in an unexpected and triumphant redemption. The narrative encompasses Erik's disastrous formative years with his mother, his caged existence among a gypsy tribe and a period of relative happiness in Rome, where he perfects his skills as an architect and builder. He goes to Persia, where he masters his talent for torture and murder and, finally, he is involved in the construction of the Paris Opera House--and the creation of his labyrinthine world beneath that structure. Haunting and unforgettable, this is a book to be savoured, a sensual and often poetic exploration of a man's internal conflict between good and evil and of a search for love amidst darkness and despair.\n\nGenre: Romance\n","torrent":{"xt":"urn:btih:dbe3827afa4814e667a1e857de1f117b7b370108","amp;dn":"Susan+Kay+-+Phantom+%28Epub%2C+Mobi%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dbe3827afa4814e667a1e857de1f117b7b370108","infoHashBuffer":{"type":"Buffer","data":[219,227,130,122,250,72,20,230,103,161,232,87,222,31,17,123,123,55,1,8]},"announce":[],"urlList":[]}}