{"title":"Aaron Patterson &amp; Chris White - Uriel- The Inheritance (Book","uid":11108596,"size":781896,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:dc88d852f238e86466e6b599bb027aca980e3cc0&amp;dn=Aaron+Patterson+%26amp%3B+Chris+White+-+Uriel-+The+Inheritance+%28Book&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"krystine","files":-1,"time":1411762239,"description":"Uriel: The Inheritance (Book 5: Parts 9-10 in the Airel Saga (The Airel Saga) by Aaron M. Patterson &amp; Chris White\n\n\n\n\nUSA Today Bestselling thriller writer Aaron Patterson teams up with Chris White, in this exciting new young adult paranormal romance series!\n\n&quot;Move over Twilight! Here comes Aaron Patterson!&quot; \n--Joshua Graham, bestselling author of Beyond Justice and Darkroom \n\n&quot;I was surprised by how much I really, really liked this book. I have not jumped on the whole &quot;fallen angel&quot; bandwagon, just as I didn't jump on all of the vampire stories that came out after Twilight. This is not your typical fallen angel story. It is one that has left me breathlessly waiting for the next one in the series. Hurry up please!!!&quot; \n--Sandra Stiles \n\nBOOK DESCRIPTION: \nUriel is a young adult paranormal story about an angel who is running from her past and becomes entangled with the Brotherhood. She gives birth to a son in Arabia, 1250BC. He is the key to the survival of his kind but soon finds that sometimes good and evil are the same thing. \n\nIn present day, Boise, Idaho Airel is back home after losing her best friend. Things are supposed to go back to normal but noting is going according to plan. Michael and Airel's love is tested once again and must prove to be real and unbreakable, or destroy them both. \n\n* * * With only one more book (Uriel: The Price) in the Airel Saga, this is the beginning of the epic conclusion to a series that I have enjoyed writing and I hope you have fallen in love with Airel and her world as much as I have. \n\n--Aaron \n\n\n\nGenre: Young Adult | Fantasy\n\nimage\n","torrent":{"xt":"urn:btih:dc88d852f238e86466e6b599bb027aca980e3cc0","amp;dn":"Aaron+Patterson+%26amp%3B+Chris+White+-+Uriel-+The+Inheritance+%28Book","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dc88d852f238e86466e6b599bb027aca980e3cc0","infoHashBuffer":{"type":"Buffer","data":[220,136,216,82,242,56,232,100,102,230,181,153,187,2,122,202,152,14,60,192]},"announce":[],"urlList":[]}}