{"title":"Journey Into Space - Audio Sci-Fi - Drama - MP3 - Slimoo","uid":12124484,"size":1701070912,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:e0bde631c6470af57dd68be47b4c990732dcd836&amp;dn=Journey+Into+Space+-+Audio+Sci-Fi+-+Drama+-+MP3+-+Slimoo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"_Slimoo_","files":64,"time":1436901603,"description":"Charles Chilton - Journey Into Space - Series 01 to 06 - Radio Sci-fi Drama - BBC\n53 x 30 &amp; 2 x 60 &amp; 1 x 90 Minute Episodes + Extras - 128Kbps - Mp3 - Slimoo\n\n\n\nJourney Into Space was a 1950's to 2009 BBC Radio science fiction programme, written by BBC producer Charles Chilton.\n\n\n\n In the UK it was the last radio programme to attract a bigger evening audience than television.\n\n\n\n Originally, four series were produced (the fourth being a remake of the first), which went on to be translated into 17 languages\n\n (including Hindustani, Turkish and Dutch) and broadcast worldwide (including the United States, New Zealand, Australia and the Netherlands).\n\n\n\n Chilton went on to write three best-selling novels and several comic strip stories, based upon the radio series.\n\n\n\n\n\n The original magnetic recordings of the show were erased shortly after broadcast, and for several decades, it was believed that no recordings of the show still survived. However, in 1986, a set of mis-filed transcription discs were discovered, containing complete copies of the three original series. This discovery enabled the BBC to begin re-broadcasting the show in the late 1980s, \n\n\n\n\n\n More detail : Wiki &gt; http://en.wikipedia.org/wiki/Journey_into_Space\n /&gt;\n\n\n\n\n Journey Into Space - S01 - Operation Luna\n\n\n\n Journey Into Space - S02 - The Red Planet\n\n\n\n Journey Into Space - S03 - The World In Peril\n\n\n\n Journey Into Space - S04 - Return From Mars\n\n\n\n Journey Into Space - S05 - Frozen In Time\n\n\n\n Journey Into Space - S06 - The Host\n\n\n A Short Journey Into Space Force, With Charles Chilton - S01 - E01\n\n A Short Journey Into Space Force, With Charles Chilton - S01 - E02\n\n A Short Journey Into Space Force, With Charles Chilton - S01 - E03\n\n A Short Journey Into Space Force, With Charles Chilton - S01 - E04\n\n A Short Journey Into Space Force, With Charles Chilton - S01 - E05\n\n A Short Journey Into Space Force, With Charles Chilton - S01 - E06\n\n A Short Journey Into Space Force, With Charles Chilton - S01 - E07\n\n A Short Journey Into Space Force, With Charles Chilton - S01 - E08\n\n Audio Format : MP3\n\n Duration : 28 to 89mn 1s\n\n Bit rate mode : Constant\n\n Bit rate : 128 Kbps\n\n Channel(s) : 2 channels\n\n Sampling rate : 44.1 KHz\n\n Resolution : 16 bits","torrent":{"xt":"urn:btih:e0bde631c6470af57dd68be47b4c990732dcd836","amp;dn":"Journey+Into+Space+-+Audio+Sci-Fi+-+Drama+-+MP3+-+Slimoo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e0bde631c6470af57dd68be47b4c990732dcd836","infoHashBuffer":{"type":"Buffer","data":[224,189,230,49,198,71,10,245,125,214,139,228,123,76,153,7,50,220,216,54]},"announce":[],"urlList":[]}}