{"title":"Fake or Fortune S04E03","uid":12142330,"size":652805798,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:e0f3657918cd3694123c697b0360d275a319adde&amp;dn=Fake+or+Fortune+S04E03&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"xela_5","files":1,"time":1437369071,"description":"\nA Mystery Old Master\n\nSeries 4 - Episode 3 of 4\n \nA beautiful church in the heart of the Lancastrian countryside has for over 200 years been home to a possible 16th-century Italian Old Master. But it is also at the centre of an unusual mystery. The congregation have contacted Fake or Fortune? to help solve a riddle which has been puzzling everyone. Who painted this huge picture, and just how did it find its way into a church once patronised by the famous Bronte sisters?\n\nPhilip is immediately struck by the imposing painting, which depicts one of the most dramatic scenes from the New Testament, the aftermath of the crucifixion of Christ. He has a hunch it might date from the Italian Renaissance, which would make it the oldest picture ever investigated on Fake or Fortune?\n\nBut to prove his theory will require a series of scientific tests to look beneath the layers of dirt and grime to see if any clues to the artist's identity can be revealed.\n\nThe trail leads Fiona and Philip on a surprising and colourful journey to Italy, where Philip wants to inspect pictures by the great Old Masters Titian and Tintoretto. Fiona uncovers a secret history of stolen paintings and meets an Italian scholar who may have a significant lead in the case.\n\nBack in the UK, Bendor is looking into a local aristocrat who the congregation believe donated the painting and discovers some family secrets which may shed new light on how the painting arrived in the church over two centuries ago.\n\nBut the British art market will take some convincing that an artist can be officially attributed to the picture, and this will require a hugely ambitious restoration project. By fully cleaning the picture, can Fake or Fortune? prove beyond doubt the identity of the painter?","torrent":{"xt":"urn:btih:e0f3657918cd3694123c697b0360d275a319adde","amp;dn":"Fake+or+Fortune+S04E03","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e0f3657918cd3694123c697b0360d275a319adde","infoHashBuffer":{"type":"Buffer","data":[224,243,101,121,24,205,54,148,18,60,105,123,3,96,210,117,163,25,173,222]},"announce":[],"urlList":[]}}