{"title":"Frontiers of Graphene and Carbon Nanotubes - Devices and Applica","uid":12129821,"size":15308556,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e2d52c256cd6e5f04509be8c8ac9fd29e7582b6f&amp;dn=Frontiers+of+Graphene+and+Carbon+Nanotubes+-+Devices+and+Applica&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"clouderone","files":1,"time":1437008170,"description":"Frontiers of Graphene and Carbon Nanotubes - Devices and Applications (Springer, 2015).pdf\n\nISBN 9784431553717\n\nThis book focuses on carbon nanotubes and graphene as representatives of nano-carbon materials, and describes the growth of new technology and applications of new devices. As new devices and as new materials, nano-carbon materials are expected to be world pioneers that could not have been realized with conventional semiconductor materials, and as those that extend the limits of conventional semiconductor performance. This book introduces the latest achievements of nano-carbon devices, processes, and technology growth. It is anticipated that these studies will also be pioneers in the development of future research of nano-carbon devices and materials.\n\nThis book consists of 18 chapters. Chapters 1 to 8 describe new device applications and new growth methods of graphene, and Chapters 9 to 18, those of carbon nanotubes.\nIt is expected that by increasing the advantages and overcoming the weak points of nanocarbon materials, a new world that cannot be achieved with conventional materials will be greatly expanded. We strongly hope this book contributes to its development","torrent":{"xt":"urn:btih:e2d52c256cd6e5f04509be8c8ac9fd29e7582b6f","amp;dn":"Frontiers+of+Graphene+and+Carbon+Nanotubes+-+Devices+and+Applica","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e2d52c256cd6e5f04509be8c8ac9fd29e7582b6f","infoHashBuffer":{"type":"Buffer","data":[226,213,44,37,108,214,229,240,69,9,190,140,138,201,253,41,231,88,43,111]},"announce":[],"urlList":[]}}