{"title":"Night Ranger - (You Can Still) Rock in America [promo].VOB","uid":12171743,"size":272084992,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:e2e8996488c0c732bacfbeba7ff11544f2470b8a&amp;dn=Night+Ranger+-+%28You+Can+Still%29+Rock+in+America+%5Bpromo%5D.VOB&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"SgtRlee","files":1,"time":1438219885,"description":"Night Ranger - (You Can Still) Rock in America [promo].VOB\n\n\nHQ rare music video from a promo DVD with 24 bit LPCM Audio. &quot;(You Can Still) Rock in America&quot; is a rock anthem written by Jack Blades and Brad Gillis, and the first single released from Night Ranger's 1983 album Midnight Madness. Former Deep Purple and Black Sabbath singer Glenn Hughes contribute backing vocals on the song. \n\nMidnight Madness is the second studio album from rock band Night Ranger released in 1983. Their second album produced three charting singles and contains the band's best known hit, &quot;Sister Christian.&quot; It remains their highest selling album at over a million copies sold in the US. The first single/video, &quot;(You Can Still) Rock in America&quot; peaked at #51 in early 1984 on Billboard's Hot 100 chart and also reached #15 on Billboard's Mainstream Rock Tracks chart. &quot;Sister Christian&quot; peaked at #5 on Billboard's Hot 100 and was one of the most played videos of 1984. The song also has been featured in several films including &quot;Boogie Nights&quot; and &quot;Rock of Ages&quot; among others. &quot;When You Close Your Eyes&quot; was the third single/video and reached #14 on Billboard's Hot 100 chart and #7 on Billboard's Mainstream Rock Tracks Chart. &quot;Rumours In The Air&quot; also charted on the Billboard Mainstream Rock chart peaking at #26 in the spring of 1984.\n\n\nNight Ranger is an American rock band from San Francisco that gained popularity during the 1980s with a series of albums and singles. The band's first five albums sold more than 10 million copies worldwide. The quintet is perhaps best known for the power ballad &quot;Sister Christian&quot;, which peaked at No. 5 in June 1984.\n\nThe group's origin can be traced to Rubicon, a pop/funk group led by Jerry Martini, who gained fame as a member of Sly and the Family Stone. After Rubicon's demise in 1979, bassist Jack Blades formed a hard rock trio with two other Rubicon members, drummer Kelly Keagy and guitarist Brad Gillis. Performing under the name Stereo, the threesome added keyboardist Alan Fitzgerald, a former member of Montrose, in 1980. Fitzgerald soon recommended enlisting a second virtuoso guitarist, so Jeff Watson, who led his own band in Northern California, was added to the group. The seeds were sown for a new melodic hard rock band, initially called simply Ranger.\n\nIn 1982, the band changed its name to Night Ranger after a country band, The Rangers, claimed a trademark infringement. By this point, they had recorded Dawn Patrol for Boardwalk Records and done opening stints for ZZ Top and Ozzy Osbourne; the latter had employed Brad Gillis as a stand-in guitarist for the recently deceased Randy Rhoads in the spring and summer of 1982. After Boardwalk folded, producer Bruce Bird secured Night Ranger a deal with MCA on their Camel subsidiary in 1983.\n\nAfter their success waned in the late 1980s, the band split up in 1989 and its members pursued other musical endeavours including group and solo efforts.Brad Gillis and Kelly Keagy teamed up with bassist Gary Moon and released an album without the other original band members in 1995, but the band soon re-united to release two new albums in the latter half of the decade. Despite the departure of original keyboardist Alan Fitzgerald and guitarist Jeff Watson, the band has continued to tour and remains very popular in Asian countries, particularly Japan.\n(video does not have any logos)\n\n\n    &lt;a href=&quot;\nhttps://en.wikipedia.org/wiki/(You_Can_Still)_Rock_in_America&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://en.wikipedia.org/wiki/(You_Can_Still)_Rock_in_America&lt;/a&gt; \n      &lt;a href=&quot;\nhttp://postimg.org/image/3raua09mf/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://postimg.org/image/3raua09mf/&lt;/a&gt; \n   \n\n\nFile properties info using Media Player Classic:     \n   Video: MPEG2 Video 720x480 (4:3) 29.97fps 6000kbps\n   Audio: LPCM 48000Hz stereo 2304kbps [DVD, 24 bits]\n   Duration: 00:04:17\n\n\n\n\n*Install the &quot;Media Player Classic&quot; player if you can't play this file, \nor for better visual and audio quality playback of all your videos. \nIt's 100% free to download and use. Latest stable build is v1.7.9\n\n*Media Player Classic Home Cinema*         &lt;a href=&quot;\nhttp://mpc-hc.org/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://mpc-hc.org/&lt;/a&gt; \n\nSgtRlee (Sgt.R.Lee) \n\t\n*This is one of my first downloads when i got my first PC and got online soon after, downloaded through a site that allowed some free Usenet downloads at the time, and uploads of music videos. I have a few more from then i'm also posting today, they will also have this text","torrent":{"xt":"urn:btih:e2e8996488c0c732bacfbeba7ff11544f2470b8a","amp;dn":"Night+Ranger+-+%28You+Can+Still%29+Rock+in+America+%5Bpromo%5D.VOB","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e2e8996488c0c732bacfbeba7ff11544f2470b8a","infoHashBuffer":{"type":"Buffer","data":[226,232,153,100,136,192,199,50,186,207,190,186,127,241,21,68,242,71,11,138]},"announce":[],"urlList":[]}}