{"title":"UNREAL TOURNAMENT 2004 EDITORS CHOICE EDITION 2.0.0.6 GOG","uid":12242980,"size":2221746221,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:e395a647997c5f5f64b5d9bca54a7a8e35756ac0&amp;dn=UNREAL+TOURNAMENT+2004+EDITORS+CHOICE+EDITION+2.0.0.6+GOG&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"zerodayz","files":6,"time":1439828429,"description":"Description\n\nIncluded goodies: manual (33 pages)+ 12 HD wallpapers+ 8 avatars\nAbout: Unreal Tournament 2004 offers up the kill-or-be-killed experience of gladiatorial combat in 10 game modes - both team-based and &quot;every man for himself&quot; - which provide even the most hardcore gamer with palm-sweating challenges through unbelievably detailed indoor arenas and vast outdoor environments.\nFace off to defend and attack fortified bases in the fan-favorite Assault Mode, and take team combat to the next level in Onslaught Mode, which brings vehicular combat into its own with a variety of land-, air- and space-based vehicles. Over 95 maps are available, including more than 45 brand new maps for all existing gameplay modes.\nThe entire smorgasbord of frag-dealing weaponry from UT2003 returns in addition to three new implements of doom: the Mine layer, the anti vehicle rocket launcher (AVRiL), and the Grenade Launcher.\nUT2004 introduces 32 new characters on four new teams: The human Thunder Crash, lead by Tournament hero, Malcolm; the Robotic Corrupt, lead by an upgraded Xan Kriegor; the Iron Skull, a team of merciless Skaarj warriors; and the Hellions - reckless human mercenaries and pirates who delight in the thrill of the kill.\nAs the ultimate techno-gladiator of the future, take fate into your own hands in UT2004, and battle against up to 32 other players online in action-packed, frag-filled arenas.\nBe sure to check out our Mod Spotlight for Unreal Tournament 2004 ECE!\n\n    The most famous installment of the Unreal Tournament saga\n    Dominate the battlefield with perfectly balanced weapons and vehicles\n    Many gameplay modes including the famous Assault and Domination","torrent":{"xt":"urn:btih:e395a647997c5f5f64b5d9bca54a7a8e35756ac0","amp;dn":"UNREAL+TOURNAMENT+2004+EDITORS+CHOICE+EDITION+2.0.0.6+GOG","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e395a647997c5f5f64b5d9bca54a7a8e35756ac0","infoHashBuffer":{"type":"Buffer","data":[227,149,166,71,153,124,95,95,100,181,217,188,165,74,122,142,53,117,106,192]},"announce":[],"urlList":[]}}