{"title":"The Nature Of Things 2of9 How To Be A Wild Elephant x264 AAC HDT","uid":11073287,"size":1018518382,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:e3d15928ee529a3ec18793d16abfdefe5764cad2&amp;dn=The+Nature+Of+Things+2of9+How+To+Be+A+Wild+Elephant+x264+AAC+HDT&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"MVGroup","files":-1,"time":1411260145,"description":"The Nature of Things: (Collection Two)\n\nNature, Science Documentary hosted by David Suzuki, published by CBC in 2009-2014 - English narration\n\n\nInformation\n------------------------------\n\nThe Nature Of Things (Collection Two)\nThe Nature of Things: (Collection Two) The Nature of Things is one of the most successful series in the history of Canadian television. Hosted by the world-renowned geneticist and environmentalist, David Suzuki, the program is in its 53rd season, a landmark by any standard. Every week, the influential program presents stories that are driven by a scientific understanding of the world. Stories full of adventure, drama and insight. Our programs entertain and inspire audiences by engaging with the people and personalities behind the science. From the search for other life in the universe to the psychology of babies, from the furry animals that invade your backyard to the consequences of human progress, The Nature of Things throws open the door to the wonder and accomplishments of science.\n\n\n1)  Planet Hunters \nPlanet Hunters follows the astrophysicists - many of them Canadian - at the forefront of the search for Earth's twin, and tells the little-known story of the two Canadians who invented the technique that made modern planet-hunting possible. Gordon Walker and Bruce Campbell also detected the first exoplanet ever discovered. But that's not what the history books say.\n\n2)  How to be a Wild Elephant \nElephant poaching worldwide has reached epidemic proportions. In Kenya, the David Sheldrick Wildlife Trust provides a sanctuary for baby elephants who are its greatest victims, left to die without the nurture and protection of their matriarchal herds. In 2010 a baby elephant named Sities was rescued and brought to the Trust's Nairobi Nursery to begin her rehabilitation. Her remarkable story was followed by audiences worldwide who watched her progress from day one. Now three years later we catch up with Sities, who has reached the age where she can be integrated into the wild elephant herds of Tsavo East National Park. HOW TO BE A WILD ELEPHANT observes the challenges Sities will face as she leaves the safety of the Nursery and moves on to the next phase of her journey back to freedom.\n\n3)  Meet the Coywolf \nPart wolf, part coyote this new hybrid species is the subject of a startlingly beautiful new film called Meet the Coywolf. A documentary that will both shock and amaze you. Coywolves emerged from a thin strip of land at the southern end of Algonquin Park less than a hundred years ago. Their arrival on the scene marks a rare event, the creation of a brand new hybrid species. A formidable wild animal that has spread across North America at an unprecedented pace, returning a new top predator to territories once roamed by wolves. Zoologist Roland Kays of the New York State Museum has been tracking these new creatures and describes them as having &quot;a coyote like skull with wolf like teeth&quot;.\n\n4)  Shattered Ground \nAs Shattered Ground reveals, some see fracking as a great opportunity for money and jobs, and one that provides cheap, clean fuel. But, for others, the possible human health costs of this new drilling technology have motivated a large and vociferous anti-fracking movement. The debate over fracking has been echoed in the Oscar-nominated documentary Gasland and in Promised Land, the new Gus van Sant's feature film starring Matt Damon. Fracking's critics consider the industry a potential environmental disaster, citing chemical contamination of air and water. With pipelines proposed, terminals for liquefied natural gas (LNG) requiring billions of dollars of investment, and huge shale beds lying underneath highly-populated areas of the Canada and the US (including southern Ontario and the GTA), fracking is an issue that could affect every one of us.\n\n5)  A Dogs Life \nA Dog's Life reveals how our best friends perceive the world - from the moment they take their first morning walk to the time they curl up at our feet to go to sleep. We accompany Daisy, a Jack Russell Terrier, through an average day and on the way discover that, while dogs are not miniature humans, they are amazingly well adapted to life with us. But how well do we know them? A Dog's Life explores the widely assumed facts that may actually be based on faulty and out-dated research. Is your dog really like a wolf? Does she need you to be the &quot;alpha&quot; dog, so she knows where to fit into your pack? Do they really see in black and white? Is it true that dogs have an amazing sense of direction?\n\n6)  Suzuki Diaries Future City \n&quot;Eighty percent of us now live in an urban setting, and I think that the solution to our environmental problems is not to say 'we've got break down cities and get everybody back to the land' - that would be disastrous - but we have to make cities our major habitat...we have to make them more in balance, I think, with the rest of the things that keep us alive.&quot; David Suzuki\nCities are where most Canadians live. And, as we head into the future, how we adapt to the needs of expanding cities will have a huge impact on their livability. Food, land use, housing, energy, waste - how we tackle these issues will determine whether our cities evolve, or whether they decline. In a new instalment of Suzuki Diaries, David and his daughter, Sarika, set out to discover whether some of Canada's biggest cities are ready for the challenges of the future.\n\n7)  The Autism Enigma \nA fresh perspective on autism research with the developing &quot;Bacterial Theory&quot; of autism. The fastest-growing developmental disorder in the industrialized world, autism has increased an astounding 600 per cent over the last 20 years. Science cannot say why. Some say it's triggered by environmental factors and point to another intriguing statistic: 70 per cent of kids with autism also have severe gastrointestinal symptoms. Could autism actually begin in the gut? The Autism Enigma looks at the progress of an international group of scientists who are studying the gut's amazingly diverse and powerful microbial ecosystem for clues to the baffling disorder.\n\n8)  Trek of the Titans \nThe leatherback sea turtle is a magnificent creature that can be found in Atlantic, Pacific, and Indian Oceans. This ancient species swims faster, travels further, and dives deeper than any other reptile on the planet. In the Atlantic, they migrate every year from their nesting grounds in the Caribbean to the chilly waters off the east coast of Canada where they feast on jellyfish. This epic annual journey - at a staggering 12,000 km - is the longest for any reptile in the world.\n\n9)  Zapped the Buzz about Mosquitoes \nWe flail, we swat, we sweat. We spray, cover up, and hide. But still the tiny, fearsome mosquito penetrates our best defenses. ZAPPED: the buzz about mosquitoes is the story of our ongoing struggle to conquer a little insect that is both delicate and deadly. As the program reveals, this beautiful and versatile blood-sucker has always managed to stay one step ahead of us. As tortured as we are Zapped uncovers, in exquisite detail, how the mosquito goes about its handiwork. It's really only the females that are the problem - they need our blood to incubate their eggs. And, out of more than 3500 species, only 200 or so transmit disease.\n\nScreenshots\n------------------------------\nclick on the thumbnails below to get full-size images &lt;a href=&quot;\nhttp://image.bayimg.com/8b5ab0b28ba0cbfa468f7aad598eb8e05aca0bcc.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://image.bayimg.com/8b5ab0b28ba0cbfa468f7aad598eb8e05aca0bcc.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://image.bayimg.com/b086af33aece02666e223d45c26a52f59284bd1b.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://image.bayimg.com/b086af33aece02666e223d45c26a52f59284bd1b.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://image.bayimg.com/50cde4b85ed4d32350afb61a2c5f29938c570f88.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://image.bayimg.com/50cde4b85ed4d32350afb61a2c5f29938c570f88.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://image.bayimg.com/d29bdc6fd3247b3e4c4e9cd40934c6eef7322ac2.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://image.bayimg.com/d29bdc6fd3247b3e4c4e9cd40934c6eef7322ac2.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://image.bayimg.com/24810c9955e476b648d835e50a24cacda2e3523d.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://image.bayimg.com/24810c9955e476b648d835e50a24cacda2e3523d.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://image.bayimg.com/5800fe4cada6c893e38bd1f4594e75c955152b2a.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://image.bayimg.com/5800fe4cada6c893e38bd1f4594e75c955152b2a.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://image.bayimg.com/f72bc5494e090bd9c2ab612864597e0f13b1649e.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://image.bayimg.com/f72bc5494e090bd9c2ab612864597e0f13b1649e.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://image.bayimg.com/59cf09e904e76368e025e3f1c35d8a900e960816.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://image.bayimg.com/59cf09e904e76368e025e3f1c35d8a900e960816.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://image.bayimg.com/d5f19305975d7100295db01268407ac884afd920.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://image.bayimg.com/d5f19305975d7100295db01268407ac884afd920.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://image.bayimg.com/e5e53d281a6e8b9b5e3b972ad7338339bca9aa1a.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://image.bayimg.com/e5e53d281a6e8b9b5e3b972ad7338339bca9aa1a.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://image.bayimg.com/a9465912274decb80dfb5668bb9c791832344ca4.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://image.bayimg.com/a9465912274decb80dfb5668bb9c791832344ca4.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://image.bayimg.com/819f4d0d2cde6cce215f5b634ea4b95dc6cd8c4b.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://image.bayimg.com/819f4d0d2cde6cce215f5b634ea4b95dc6cd8c4b.jpg&lt;/a&gt; \n\nTechnical Specs\n------------------------------\n\n\n * Video Codec: x264 CABAC &lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;3d75545a557d7109130c&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script data-cfhash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;data-cfhash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}t.parentNode.removeChild(t);}}catch(u){}}()/* ]]&gt; */&lt;/script&gt;\n * Video Bitrate: 2962 Kbps\n * Video Aspect Ratio: 1.778 (16:9)\n * Video Resolution: 1280 x 720\n * Audio Codec: AAC LC\n * Audio English\n * Audio Bitrate: 160 Kbps VBR 48KHz\n * Audio Channels: Stereo 2\n * Run-Time: 45mins\n * Framerate: 29 FPS\n * Number of Parts: 9\n * Container Mp4\n * Part Size: average 940 MB\n * Source: HDTV\n * Encoded by: Harry65\n\n\n\nLinks\n------------------------------\n\n1)  Further Information &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/The_Nature_of_Things&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/The_Nature_of_Things&lt;/a&gt;\n\n2)  Related Documentaries &lt;a href=&quot;\nhttp://docuwiki.net/?title=The%20Nature%20of%20Things%3A%20%28Collection%20One%29&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://docuwiki.net/?title=The%20Nature%20of%20Things%3A%20%28Collection%20One%29&lt;/a&gt;\n\n\n","torrent":{"xt":"urn:btih:e3d15928ee529a3ec18793d16abfdefe5764cad2","amp;dn":"The+Nature+Of+Things+2of9+How+To+Be+A+Wild+Elephant+x264+AAC+HDT","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e3d15928ee529a3ec18793d16abfdefe5764cad2","infoHashBuffer":{"type":"Buffer","data":[227,209,89,40,238,82,154,62,193,135,147,209,106,191,222,254,87,100,202,210]},"announce":[],"urlList":[]}}