{"title":"Basic Guide to Anatomy and Physiology for Dental Care Profession","uid":11078216,"size":5762057,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e4818ab0b9a24daf6fe53546c9b8a05e215e9a82&amp;dn=Basic+Guide+to+Anatomy+and+Physiology+for+Dental+Care+Profession&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"0xmovva","files":2,"time":1411361696,"description":"Author: Carole Hollins \nPaperback: 192 pages\nPublisher: Wiley; 1st edition (September 17, 2012)\nLanguage: English\nISBN-10: 0470656115\nISBN-13: 978-0470656112\nFormat: Retail PDF\nReader Required: Adobe Reader, Foxit, Nitro, Adobe Digital Editions\n\nNote: This is the eBook of the printed book and may not include any media,website access codes, or print supplements that may come packaged with the bound book.\n\nTested on the above readers with no problems on laptop and Android tablet.Please allow a couple seconds for the seedboxes to kick in, then it should move pretty quick.\nHope it helps in your studies. Go for it! :D\n\n________________________________________________________________________________\n\n\nThe Basic Guide to Anatomy and Physiology for Dental Care Professionals introduces the fundamentals of human anatomy and physiology to the student Dental Care Professional.\nWritten in a clear, accessible style, it provides dental nurses, hygienists, therapists and clinical dental technicians with essential grounding in the head and neck area, as well as all the body systems that have implications for the DCP when things go wrong.\n\nBeginning with a definition of anatomy and physiology, and with all the basics of cell, tissue and organ biology, this Basic Guide covers:\n\nthe cardiovascular, respiratory and digestive systems, all of which are central to the DCP curriculum\ncore areas such as skull and oral anatomy, periodontal tissues, blood and nerve supply to the oral cavity, muscles of mastication, and major salivary glands\nareas such as jaw and tooth development, and the histology or oral and dental tissue\nEach area is covered separately and in depth, giving the reader an understanding of their structure and function in health as well as illnesses relevant to medical emergencies and dental-related disorders (such as acid reflux which causes tooth erosion).","torrent":{"xt":"urn:btih:e4818ab0b9a24daf6fe53546c9b8a05e215e9a82","amp;dn":"Basic+Guide+to+Anatomy+and+Physiology+for+Dental+Care+Profession","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e4818ab0b9a24daf6fe53546c9b8a05e215e9a82","infoHashBuffer":{"type":"Buffer","data":[228,129,138,176,185,162,77,175,111,229,53,70,201,184,160,94,33,94,154,130]},"announce":[],"urlList":[]}}