{"title":"Mick Farren - Jim Morrison's Adventures in the Afterlife [Epub]","uid":12174645,"size":565658,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e4a573ce8883e023f4ee668834dfae678df67a0f&amp;dn=Mick+Farren+-+Jim+Morrison%27s+Adventures+in+the+Afterlife+%5BEpub%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Hand_of_Doom","files":3,"time":1438289562,"description":"Possessed of an imagination that rivals that of any of our edgiest fantasists, steeped in the detritus and ephemera of three decades of pop culture, Mick Farren has crafted in this new novel a bizarre and compelling fantasia. Jim Morrison's Adventures in the Afterlife is just that: the story of Morrison, the dark yet naive Lizard King, as he hurtles through a purgatory-like afterlife in search of some way to bring his soul to peace. Along the way he finds Doc Holliday -- and together they find themselves chasing the restless fire-and-brimstone evangelist Aimee Semple McPherson, whose soul has broken after death into two warring halves. McPherson's sexier half becomes the object of Jim's obsession, and as the two struggle to find each other in this disordered land, their wild, careening chase through a dozen dystopiae recalls imagined worlds as diverse as Burgess' A Clockwork Orange or Terry Gilliam's Brazil. This is a daring, hilarious romp through the landfill of millennial society -- the Inferno we deserve","torrent":{"xt":"urn:btih:e4a573ce8883e023f4ee668834dfae678df67a0f","amp;dn":"Mick+Farren+-+Jim+Morrison%27s+Adventures+in+the+Afterlife+%5BEpub%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e4a573ce8883e023f4ee668834dfae678df67a0f","infoHashBuffer":{"type":"Buffer","data":[228,165,115,206,136,131,224,35,244,238,102,136,52,223,174,103,141,246,122,15]},"announce":[],"urlList":[]}}