{"title":"Brand New Girls 2014 XXX 720P INTERNAL WEBRIP MP4-GUSH","uid":11107567,"size":8604590729,"categoryP":"porn","categoryS":"other","magnet":"?xt=urn:btih:e58f1961bc21656da0849b691326bdc5aa58246b&amp;dn=Brand+New+Girls+2014+XXX+720P+INTERNAL+WEBRIP+MP4-GUSH&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"TKTh3K1ng","files":4,"time":1411746965,"description":"Brand New Girls\nEvil Angel / Year: 2014\n\nCast\nAugust Ames , Alina Li , Dillion Harper , Ava Taylor , Katerina Kay\n\nSynopsis\nOne thing director Kevin Moore has come to appreciate when casting his movies is a fresh outlook on sex. Rookie performers often haven't had time to develop the phony tics more jaded porn sluts can exhibit. Kevin's Brand New Girls offers just what the title promises five scenes of young, exciting talent in an epic POV-style adventure that spans four-and-a-half hours! Naturally busty 19-year-old brunette August Ames does a sexy dance; before long she's buzzing her pussy with a vibrating wand and orally servicing the directors stiff dick. August squeezes his shaft between her tits and gets royally fucked. Stunning, bespectacled 18-year-old Ava Taylor is extremely new to the adult business. Kevin eagerly pounds Ava's tender pussy, and she joins him in a lewd 69. Her glasses end up doused with creamy cum. In a glamorous miniskirt, Asian teen sweetheart Alina Li lets her natural curiosity run fucking wild. The sultry babe enjoys a fun ride on Kevin's prick. Katerina Kay is a sexy, young stripper in platform heels and booty shorts. Kevin fucks the horny tart in several positions before splattering Katerina's plump, round ass cheeks with a messy load of splooge. Curvy, young Dillion Harper loves everything about her job. The adorable slut makes herself climax with a vibrator as Kevin pumps her pussy, and he decorates Dillion's pretty face with spunk. The two-disc DVD release offers an additional bonus scene with August Ames. Brand New Girls the porn industries greatest resource!\n &lt;a href=&quot;\nhttp://imgking.org/?g=451145&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgking.org/?g=451145&lt;/a&gt;","torrent":{"xt":"urn:btih:e58f1961bc21656da0849b691326bdc5aa58246b","amp;dn":"Brand+New+Girls+2014+XXX+720P+INTERNAL+WEBRIP+MP4-GUSH","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e58f1961bc21656da0849b691326bdc5aa58246b","infoHashBuffer":{"type":"Buffer","data":[229,143,25,97,188,33,101,109,160,132,155,105,19,38,189,197,170,88,36,107]},"announce":[],"urlList":[]}}