{"title":"James Patterson &amp; Marshall Karp - NYPD Red 2","uid":11105277,"size":234438558,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:e6f6381329858d38df1908429d43e9c988ad0570&amp;dn=James+Patterson+%26amp%3B+Marshall+Karp+-+NYPD+Red+2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":-1,"time":1411716410,"description":"Written by James Patterson, Marshall Karp\nRead by Edoardo Ballerini, Jay Snyder\nFormat: MP3\nBitrate: 64 Kbps\nUnabridged\n\nWhen NYPD Red arrives at a crime scene, everyone takes notice. Known as the protectors of the rich, famous, and connected, NYPD Red is the elite task force called in only for New York City's most high-profile crimes. And Detective Zach Jordan is the best of the best, a brilliant and relentless pursuer of justice. He puts professionalism above all, ignoring his feelings for his partner, Detective Kylie MacDonald, the woman who broke his heart when they first met in the academy.\n\nBut even with their top-notch training, Zach and Kylie aren't prepared for what they see when they're called to a crime scene in the heart of Central Park. They arrive to find a carousel spinning round and round, its painted horses grinning eerily in the early morning dark. There is only one rider: a brutally slaughtered woman, her body tied up and dressed in a Hazmat suit, on display for the world to see.\n\nThe victim, a woman of vast wealth and even greater connections, is the fourth in a string of shocking murders that have hit the city. As the public pressure mounts, and political and personal secrets of the highest order hang in the balance, Zach and Kylie must find out what's really behind the murderer's rampage. But Kylie has been acting strange recently--and Zach knows whatever she's hiding could threaten the biggest case of their careers.\n\nNYPD Red 2 is the next outstanding novel in James Patterson's newest series, a thriller that careens through New York City and deep into the psyche of a depraved killer you've never seen before.\n","torrent":{"xt":"urn:btih:e6f6381329858d38df1908429d43e9c988ad0570","amp;dn":"James+Patterson+%26amp%3B+Marshall+Karp+-+NYPD+Red+2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e6f6381329858d38df1908429d43e9c988ad0570","infoHashBuffer":{"type":"Buffer","data":[230,246,56,19,41,133,141,56,223,25,8,66,157,67,233,201,136,173,5,112]},"announce":[],"urlList":[]}}