{"title":"Hooked on Phonics (nearly) Complete","uid":12265706,"size":4544334042,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:e749571032e90e17eec1db52878b059bb6ca7596&amp;dn=Hooked+on+Phonics+%28nearly%29+Complete&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":207,"time":1440230414,"description":"Source: Hooked on Phonics 2010 - Complete (PreK to Second Grade)\nMagnet: magnet:?xt=urn:btih:02CAE663C53C9E90AF2F00752C42553479E28156&amp;dn=Hooked%20On%20Phonics%20Source&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80\nHash: 02CAE663C53C9E90AF2F00752C42553479E28156\n\nAll credit should go to the original uploader/seeder. That said, I decided to clean up a few things. \n\nFirst, I used Handbrake to convert all of the DVD videos to mp4 container, h264 codec, with HE-AAC audio. The bitrate's \nlow, but this isn't exactly classic cinema. I've also named and arranged these for Plex, so you can dump them into a \n&quot;tv show&quot; library as-is. There are season posters and artwork that should be autorecognized, but you won't get a show \nsynopsis since this isn't indexed on thetvdb.com (add that manually if it bugs you).\n\nSecond, some of the workbooks were split up into multiple PDFs, and the pages weren't in the correct order. I've went \nahead and got those fixed, as best I can, though I was limited to the quality of the scans as I got them. Nothing has \nbeen OCRed, didn't see the point in that. \n\nFinally, tried to organize these a bit better. There are three root folders, one each for songs, videos, and workbooks.\nThat way, you can choose whichever files you need more easily.\n\nPlease help to seed this, I will try to continue to seed it as best I can, but I've got a datacap with AT&amp;T, and I want \nto ditch this early since I bear the brunt of legal risks as the original uploader.\n\nIssues:\n\n1. The following workbooks are missing pages:\n       Pre-K Level 1 - page 20\n       Pre-K Level 2 - pages 50, 64, 76\n       Kindergarten Bonus Workbook - page 12\n       First Grade Level 2 Workbook - pages 14, 16\n       Second Grade Level 2 Workbook - page 28\n2. There was a video on each disc that was simply the credits rolling. I didn't bother to include it.\n3. None of the PDFs are optimized for black-and-white printing. You'll want to do this on a laserjet (Brother printers \n   are cheap and high quality). Even if you print monochrome so the pretty colors don't waste $10,000 in color printer\n   ink, this will still chew through the black ink like it was a secret plot out of HP printer division headquarters.\n4. These will seem repetitive (isn't that their appeal?). However, it seems like they use the same videos over and over\n   in each level. Aren't you glad you didn't pay $250 for this?\n5. The Pre-K fundamentals iso refused to be transcoded. No idea why. Gave up on that. Get the iso out of the other \n   torrent if you want it.\n6. I didn't include the HOP.iso file either. This contains some Windows (32-bit) executable-slash-software-title. Get it\n   from the original torrent if you want or need it.\n7. Your friends and family will likely ask you why you are bothering, since teaching your children to read is something\n   only trained professionals should attempt","torrent":{"xt":"urn:btih:e749571032e90e17eec1db52878b059bb6ca7596","amp;dn":"Hooked+on+Phonics+%28nearly%29+Complete","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e749571032e90e17eec1db52878b059bb6ca7596","infoHashBuffer":{"type":"Buffer","data":[231,73,87,16,50,233,14,23,238,193,219,82,135,139,5,155,182,202,117,150]},"announce":[],"urlList":[]}}