{"title":"China Gate (1957) DVD5 Uncompressed- War Drama - Gene Barry, Ang","uid":11108566,"size":5259444224,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:e873e2f776066db1e789abcf9c7c27cc8a4654ce&amp;dn=China+Gate+%281957%29+DVD5+Uncompressed-+War+Drama+-+Gene+Barry%2C+Ang&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"SaM","files":-1,"time":1411761489,"description":"China Gate (1957) DVD5 Uncompressed- War Drama - Gene Barry, Angie Dickinson, Nat 'King' Cole [DDR]\n\nChina Gate is a 1957 Hollywood Cinemascope war film written, produced and directed by Samuel Fuller and released through 20th Century Fox.\n\nCAST:- Gene Barry, Angie Dickinson, Nat King Cole, Lee Van Cleef, \n\nDirected by Samuel Fuller\nProduced by Samuel Fuller\nWritten by Samuel Fuller\nMusic by Victor Young\nRunning time 97 min.\n\nMOVIE PLOT:- China Gate (1957)\n\nSergeant Brock (Gene Barry) and Goldie (Nat King Cole) are American Korean War veterans now serving as French Foreign Legion mercenaries in the First Indochina War. Angie Dickinson plays Brock's wife, a &quot;half caste&quot; Chinese Eurasian named &quot;Lucky Legs&quot; who resorts to smuggling to feed her five-year-old son she had with Brock. Brock abandoned her and the child when it was born with Asian features, feeling a &quot;half breed&quot; would not be welcome in America; an attitude towards miscegenation prevalent (in some quarters) at the time. Lucky is recruited by the French high command to use her knowledge to guide a demolition squad of Legionnaires led by Brock to blow up a hidden Viet Minh ammunition dump on the border with Red China. In return for her services, Lucky is promised by the French that they will arrange for her son's evacuation to America.\n\nThe patrol is filled with animosity between the former lovers, booby traps, and Viet Minh patrols. On arrival at the ammunition dump hidden in a mountain, Dickinson discovers the commanding officer is a former friend Major Cham (Lee Van Cleef) who wants to take her and her son to a new life in Moscow. Van Cleef plays his role as a high flyer corporate executive (in the manner of Fuller's gangsters in Underworld USA) marked for great things in the world of international communism. The sabotage mission is successful but at great cost; Lucky dies blowing up the dump. Brock reconciles with his child and is last seen walking along holding his hand in preparation for returning to America, as Cole reprises the title song.\nProduction\n\nFuller selected singer Cole after being impressed with his face on a record album cover. Though Darryl F. Zanuck said Cole received more money in a few weeks than the entire budget of the film, Fuller arranged to meet Cole. Cole and his wife were interested in Goldie as an opposite to the racist Brock and agreed to work at a minimum salary. China Gate was the last score Victor Young composed; the film was finished by his friend Max Steiner. Harold Adamson wrote lyrics to Young's beautiful theme for the film. Though originally not intending to sing in the film, Cole sang China Gate as he walked through a bombed out village making it a memorable tune and a fitting tribute to Young.\n\nAn actual Eurasian actress playing a love interest opposite a white European star was a rarity in Hollywood at the time. Dickinson proves attractive to Brock, and to mainstream audiences of the time. Her character is allowed to express Fuller's view on race relations and is respected both by the French military and by a local priest whose life she had saved. (The character takes a role similar to Fuller's prostitute protagonists in Pickup on South Street and The Naked Kiss). The dangerous patrol allows for a gradual change of heart for Brock.\n\nBefore China Gate was to be released, Fuller received a call from the French Consul-General in Los Angeles, Romain Gary, inviting him to lunch. Gary said the film's prologue was too harsh towards France and asked Fuller to change it. Fuller did not, but the two became firm friends with similar interests. The film was never released in France.\n\nMany years later, Fuller filmed a story of Gary's, White Dog (1982), that Fuller and Curtis Hanson adapted for the screen\n\nTECHNICAL SPECIFICATIONS:-\nVideo Codec: MPEG-2\nVideo Bitrate: 6858 kbps\nVideo Resolution: 720x480\nVideo Aspect Ratio: 1.778:1\nFrames Per Second: 29.970\nAudio Codec:  AC3\nAudio Bitrate: 192kb/s CBR 48000 Hz\nAudio Streams:  1\nAudio Languages: English\nRunTime 97 mins\nSubtitles: None\nRipped by: Trinidad [DDR]","torrent":{"xt":"urn:btih:e873e2f776066db1e789abcf9c7c27cc8a4654ce","amp;dn":"China+Gate+%281957%29+DVD5+Uncompressed-+War+Drama+-+Gene+Barry%2C+Ang","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e873e2f776066db1e789abcf9c7c27cc8a4654ce","infoHashBuffer":{"type":"Buffer","data":[232,115,226,247,118,6,109,177,231,137,171,207,156,124,39,204,138,70,84,206]},"announce":[],"urlList":[]}}