{"title":"Spacewrights Demo V04","uid":11095201,"size":16913791,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:e8d755501a7aec494665e214bfb951fcc8ef9a27&amp;dn=Spacewrights+Demo+V04&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Lamasu","files":-1,"time":1411584190,"description":"Spacewrights is a tactical sci-fi 2D spaceship simulation game where you explore, build, and create a galactic empire.\n\nIf you like FTL: Faster Than Light, you gotta check it out ASAP!\n\n- Explore the galaxy\nThe adventure mode lets you, as the commander, explore the Spacewrights galaxy to pursue your galactic ambitions. Go it alone or invite some friends locally or online to join in your adventure. Build a galactic empire by allying, defeating, and trading with many different alien races and factions. Find secrets and new alien races to contact buried away in the most remote systems of the galaxy, or unravel a galactic conspiracy in the main story. It is your choice and your adventure.\n\n- Engage in personal fleet combat\nControl multiple vessels at once with their unique systems and crew to fight off everything the galaxy can throw at you in real time. Build a carrier style ship that launches smaller fighter ships. Be a space pirate that teleports over to enemy ships to engage their crew in hand to hand combat as you plunder their cargo and steal their ships. You can even suffocate your opponents by hacking their life support systems. The choice is yours commander.\n\n- Discover new alien worlds\nThe galaxy is vast. Humanity and the races it has encountered have only started to scratch the surface of what is out there. Find uncontacted planets and do with them as you see fit. Raise new alien races into great space-faring races. Teleport down to the surface to explore. Search for ancient alien ruins. Hunt the local exotic alien monsters to tame for combat or sell them for profit. You can wipe out all life and mine the planets to their cores, or leave them alone but plant spies in their midst to study them for research. Their worlds are in your hands.\n\n- Negotiate to control\nInteract with different fleets, alien races, and factions throughout the galaxy. Diplomacy, spying, and economic trade can be just as useful to crush your enemies as military strength. Communications are dynamic and ever evolving. Unlock new quests, alliances, and missions to advance the story or be the greatest terror the galaxy has ever seen.\n\n- Customize Your Fleet\nEverything in your fleet can be customized. Unlock and build new ships, space stations, and planetary bases. Choose what systems to install and where by placing the rooms in the vessels by where the blocks fit using a Tetris style system. Ensure your fleet always has a crew by utilizing clones. Research new and exotic technologies for new systems to get the edge in your galactic adventures. Your fleet, your rules.\n\n- Command your crew\nYour crew members are the lifeblood of the vessels you deploy them in. Command your crew to repair ships, control systems, board enemy ships, or go down to explore planets. Each individual being in your crew gains experience which can be used to level up them through their careers and change jobs to gain new abilities and stats to fulfill niches within your fleet.\n\nMore info:  &lt;a href=&quot;\nhttp://spacewrights.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://spacewrights.com&lt;/a&gt;\n\nRead how-to-play.txt for some tips.\n\nChangelog:\nV04:\n- Salvage is easier to find in general\n- Fixed hackers not unhacking at various times\n- Fire will extinguish if air runs out, and it burns air quicker\n- Fixed weapons crashing when firing at dead ships\n- Fixed captured weapons targeting ridicule changing to capturer's color\n- A bunch of other minor tweaks based on feedback\nV03:\n- Teleporting your crew around shouldn't crash the game\n- Fixed telebombs firing twice accidentally\n- Moving teleported crew around should not crash the game\n- Thanks to everyone for reporting these bugs. We're working a quick as possible to fix them for you\nV02:\n- A large number of default unlocks added to new games, 45 instead of 12\n- Fixed a crash when teleporting crew members\n- More spelling fixes\n\nVote for it on Steam Greenlight:  &lt;a href=&quot;\nhttps://www.google.com/search?q=spacewrights+greenlight&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://www.google.com/search?q=spacewrights+greenlight&lt;/a&gt;\n\nSupport it on Kickstarter:  &lt;a href=&quot;\nhttps://www.kickstarter.com/projects/arithmebit/spacewrights&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://www.kickstarter.com/projects/arithmebit/spacewrights&lt;/a&gt;","torrent":{"xt":"urn:btih:e8d755501a7aec494665e214bfb951fcc8ef9a27","amp;dn":"Spacewrights+Demo+V04","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e8d755501a7aec494665e214bfb951fcc8ef9a27","infoHashBuffer":{"type":"Buffer","data":[232,215,85,80,26,122,236,73,70,101,226,20,191,185,81,252,200,239,154,39]},"announce":[],"urlList":[]}}