{"title":"Buttman's Nordic Blondes","uid":12155034,"size":2200784896,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:e96a419fe6d94e4a2a1969735aa5d7c146d80962&amp;dn=Buttman%27s+Nordic+Blondes&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"irealu69","files":3,"time":1437758163,"description":"Buttman's Nordic Blondes\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\n\nSynopsis: Legendary director Stagliano handpicked seven episodes from his voluminous library, with Nordic blonde as the only prerequisite for the ladies fucking and sucking in scenes that range from classic gonzo, such as Dutch beauty Tanya in the seminal Adventures of Buttman, to the fetish exploration in his shot-on-film opus, Fashionistas. The latter isn't from a Buttman movie; however, who could complain about the inclusion of an award-winning scorcher like Stagliano's perfectly captured encounter featuring Rocco Siffredi's old-world domination of towheaded American Kate Frost? The cover shot of Nikki Anderson, perhaps one of the most iconic of Buttman's photo images, is from Buttman in Budapest. A visit to Christoph Clark's hilltop lair exposes the flawless golden blonde sunbathing on the balcony. Christoph coaxes a reluctant Nikki to open up for Buttman's camera and before long, a double penetration fuck with Christoph and Andrew shot from a voyeur's point-of-view. The narration and camera angles reveal the sense of wonder and excitement that is central to everyman's identification with Buttman. Watching Buttman's hand enter the frame so he can squeeze Dora Venter's perfectly round, goose-pimpled ass, held aloft by her white tights creating that spill-over butt flesh effect, is why POV porn succeeds. The viewer is the doer ... fantasy created and filled in the same motion. At this moment, the color of her hair is secondary to the shape of that ass! Young Manuel Ferrara's hotel room romp with statuesque Mandy results in a bountiful facial cumshot basting that would serve as a preview of things to come from Mr. Ferrara. It's called sexual chemistry. The opening close-up shot of Judith Grant's muscular ass distorting the pattern in her white fishnet stockings is a physics lesson Buttman-style. Like Judith, Christy's blonde mane, natural boobs, tight body and sexy accent delight and deliver the hardcore goods with an anything goes attitude that would keep Buttman traveling to Eastern European locations in search of fair-haired, ample-assed women. Do blondes have more fun? Perhaps, but viewers of Buttman's Nordic Blondes have the most fun of all.\n\nCast: Nikki Anderson, Mandy Bright, Dora Venter, Kate Frost, Judith Kostner, Judith Grant, Tanja De Vries, Rocco Siffredi, - (bio), Manuel Ferrara, - (bio), Brandon Iron, - (bio),- (interview), Andrew Youngman, Marc De Bruin, John Stagliano,Director\n\nCategories: Blondes,Anal,DP,Threesome,Outdoor\n\nScreenshots:\n~~~~~~~~~~~~ &lt;a href=&quot;\nhttp://www.picturevip.com/x/clean/X7x&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.picturevip.com/x/clean/X7x&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.picturevip.com/x/clean/X72&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.picturevip.com/x/clean/X72&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.picturevip.com/x/clean/X7G&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.picturevip.com/x/clean/X7G&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.picturevip.com/x/clean/X7L&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.picturevip.com/x/clean/X7L&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.picturevip.com/x/clean/X7V&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.picturevip.com/x/clean/X7V&lt;/a&gt;\n\nVideos Info:\n~~~~~~~~~~~~\nSize: 2.050 GB\nDuration: 3 hrs. 19 mins. \t\nResolution: 512x384","torrent":{"xt":"urn:btih:e96a419fe6d94e4a2a1969735aa5d7c146d80962","amp;dn":"Buttman%27s+Nordic+Blondes","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e96a419fe6d94e4a2a1969735aa5d7c146d80962","infoHashBuffer":{"type":"Buffer","data":[233,106,65,159,230,217,78,74,42,25,105,115,90,165,215,193,70,216,9,98]},"announce":[],"urlList":[]}}