{"title":"Afraid Series (Books 1-4) - J.A. Konrath","uid":11079057,"size":19560810,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ea7e6fa6c4db7e1688b1c8e2c7ef74fc3194428e&amp;dn=Afraid+Series+%28Books+1-4%29+-+J.A.+Konrath&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"DethHolly","files":28,"time":1411375921,"description":"Book #1 - Afraid\n\nARE YOU AFRAID OF THE DARK? YOU WILL BE . . .\n\n\nWelcome to Safe Haven, Wisconsin. Miles from everything, with one road in and out, this peaceful town has never needed a full-time police force. Until now . . . \n\n\nA helicopter has crashed near Safe Haven and unleashed something horrifying. Now this merciless force is about to do what it does best. Isolate. Terrorize. Annihilate. As residents begin dying in a storm of gory violence, Safe Haven's only chance for survival will rest with an aging county sheriff, a firefighter, and a single mom. And each will have this harrowing thought: Maybe death hasn't come to their town by accident . . .\n\n\nFormats: EPUB, MOBI, AZW3, PDF, LIT\nASIN#: B009KA18NO\nISBN#: 0446543543\nISBN13#: 9780446543545\nPublished: April 1st, 2009\nLanguage: English\n\n- - -\n\nBook #2 - Trapped\n\nTERRIFIED...\n\nIt was supposed to be a harmless camping trip. Six wayward teenagers who'd run into trouble with the law, and their court-appointed guardians, Sara and Martin Randhurst. Three nights on a small, deserted island off of Michigan's upper peninsula. A time to bond, to learn, to heal. Then Martin told a campfire story about the island's history. Of the old civil war prison hidden in there, and the starving confederate soldiers who resorted to cannibalism to stay alive. Everyone thought it was funny. They even laughed when Martin pretended to be dragged off into the woods. But Martin didn't come back. And neither did Sara when she went in search of him. Then the laughter stopped.\n\n...TO DEATH\n\nThe group soon began to realize that this deserted island wasn't so deserted after all. And perhaps Martin's ridiculous story had more truth to it than anyone thought. What's the most horrifying thing you can imagine? This is a hundred times worse...\n\n\nFormats: EPUB, MOBI, AZW3, PDF, LIT\nASIN#: B003TFESNS\nISBN#: 0011086424\nISBN13#: 2940011086427\nPublished: June 26th, 2010\nLanguage: English\n\n- - -\n\nBook #3 - Endurance\n\nThe bed and breakfast was hidden in the hills of West Virginia. Wary guests wondered how it could stay in business at such a creepy, remote location, especially with its bizarre, presidential decor and eccentric proprietor.With the event hotel for the national Iron Woman triathlon accidentally overbooked, competitor Maria was forced to stay at the Rushmore. But after checking into her room, she quickly realized she wasn't alone. First her suitcase wasn't where she put it. Then her cell phone was moved. Finally, she heard an odd creaking under the bed. Confusion quickly turned to fear, and fear to hysteria when she discovered the front door was barred and the windows were bricked over. There was no way out.One year later, four new female athletes have become guests of the Inn. Will they escape the horrors within its walls? Or will they join the many others who have died there, in ways too terrible to imagine?\n\n\nFormats: EPUB, MOBI, AZW3, PDF, LIT\nASIN#: B003STD7BO\nISBN#: 001210485X\nISBN13#: 2940012104854\nPublished: June 20, 2010\nLanguage: English\n\n- - -\n\nBook #4 - Haunted House\n\nHAUNTED HOUSE is a sequel to the novels AFRAID, TRAPPED, and ENDURANCE. The survivors from those thrillers are all together, and put through a new kind of hell. Also included is Dr. Frank Belgium, from ORIGIN.\n\nAll characters have back stories. In the case of HAUNTED HOUSE, these back stories exist in other books.\n\nWhile HAUNTED HOUSE can be read as a stand alone, and may be the first Kilborn book read by a lot of people, if a reader enjoys it, he/she can read more about these characters in different novels. And fans of these other novels will enjoy seeing familiar characters show up again in a new novel. \n\n\nFormats: EPUB, MOBI, AZW3, PDF, LIT\nASIN#: B00BOWPZUS\nISBN#: 1484989953\nISBN13#: 9781484989951\nPublished: April 22nd, 2013\nLanguage: English","torrent":{"xt":"urn:btih:ea7e6fa6c4db7e1688b1c8e2c7ef74fc3194428e","amp;dn":"Afraid+Series+%28Books+1-4%29+-+J.A.+Konrath","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ea7e6fa6c4db7e1688b1c8e2c7ef74fc3194428e","infoHashBuffer":{"type":"Buffer","data":[234,126,111,166,196,219,126,22,136,177,200,226,199,239,116,252,49,148,66,142]},"announce":[],"urlList":[]}}