{"title":"Cloud Atlas Sextet - Re-edited To Match The Novel","uid":11125282,"size":1837553071,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:eb20779f87042032288614d7a0051297beae6a4a&amp;dn=Cloud+Atlas+Sextet+-+Re-edited+To+Match+The+Novel&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":1,"time":1411961308,"description":"Hi, movie editing is a hobby of mine and Cloud Atlas is one of my favorite books. I've re-edited the movie to match the structure and ending of the book, as well as removing the bookends that were added for the movie.\n\nOne of the most unique and talked-about aspects of the book was the structure, which is described by Wikipedia as:\n\n&quot;The book consists of six nested stories from the remote South Pacific in the nineteenth century to a distant, post-apocalyptic future. Each tale is read (or observed) by the main character in the next. The first five stories are interrupted at a key moment. After the sixth story, the other five stories are returned to and closed, in reverse chronological order, and each ends with the main character reading or observing the chronologically previous work in the chain. Eventually readers end where they started. Each story contains a document, movie or tradition that appears in a previous story.&quot;\n\n\nI thought the movie version was great, but I think it lost something in the shift from the &quot;Russian nesting doll&quot; structure to the simultaneous one where the narrative constantly jumps between the different stories.\n\nThis was created under the Fair Use exception to copyright laws and is solely a scholarly work designed to promote and teach film-editing techniques by example.\n\n\nEnjoy!","torrent":{"xt":"urn:btih:eb20779f87042032288614d7a0051297beae6a4a","amp;dn":"Cloud+Atlas+Sextet+-+Re-edited+To+Match+The+Novel","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eb20779f87042032288614d7a0051297beae6a4a","infoHashBuffer":{"type":"Buffer","data":[235,32,119,159,135,4,32,50,40,134,20,215,160,5,18,151,190,174,106,74]},"announce":[],"urlList":[]}}