{"title":"The War Between Men and Women (1972) DVD9 Untouched- Jack Lemmon","uid":11243213,"size":7115331584,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:eb74a841a7287efd1e0c6090a91c54b8fe6d5637&amp;dn=The+War+Between+Men+and+Women+%281972%29+DVD9+Untouched-+Jack+Lemmon&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"SaM","files":-1,"time":1413694951,"description":"The War Between Men and Women (1972) DVD9 Untouched- Jack Lemmon, Barbara Harris [DDR]\n\nThe War Between Men and Women is a 1972 slapstick live-cartoon comedy film starring Jack Lemmon, Barbara Harris, and Jason Robards.\nIt is based on the writings of humorist James Thurber, and was released in 1972 by Cinema Center Films. Like many other films in the Cinema Center catalog, it has long been unavailable on home video, with the exception of a brief release on VHS in 2000. Nonetheless, it has been shown on television. The film features animated cartoons interspersed in the story based on Thurber's works.\n\nThe film was directed by Melville Shavelson, creator of the 1969 Thurber-based television series My World and Welcome to It. The screenplay was by Shavelson and by Danny Arnold, who also worked on the 1969 series. Arnold is best known for his later television series, Barney Miller. Lisa Gerritsen, who plays Linda Kozlenko in the film, previously co-starred in My World and Welcome to It as Lydia Monroe.\n\n    CAST:-\n    Jack Lemmon as Peter Edward Wilson\n    Barbara Harris as Theresa Alice Kozlenko\n    Jason Robards as Stephen Kozlenko\n    Herb Edelman as Howard Mann\n    Lisa Gerritsen as Linda Kozlenko\n    Moosie Drier as David Kozlenko\n    Severn Darden as Dr. Harris\n    Lisa Eilbacher as Caroline Kozlenko\n    Lucille Meredith as Mrs. Schenker\n\nDirected by Melville Shavelson\nProduced by Danny Arnold\nMusic by Marvin Hamlisch\nRunning time 110 min.\n\nMOVIE PLOT:- The War Between Men and Women (1972)\nPeter Wilson (Jack Lemmon) is a sarcastic near-sighted cartoonist, author and swinging bachelor living in Manhattan. He detests dogs and children. He is flustered by women's priorities and avoids commitment, much preferring transient physical relationships. At the office of his eye surgeon, Peter meets a leggy, eye-catching brunette named Terri Kozlenko (Barbara Harris). He likes her very much, but discovers later that she is a single mother to three children.\n\nNevertheless, they develop a close friendship that grows into romance, when Peter realizes that Terri is the only woman who can tolerate his strong anti-feminist opinions. When she rejects his plan of a sexual relationship conducted exclusively at his bachelor pad (so that he doesn't have to bond with her demanding family), he reluctantly proposes to her. They get married and he moves into her apartment, but her rogue ex-husband Stephen (Jason Robards) appears to spend more time with their children. Stephen and Peter clash at first, but they soon become good drinking friends, much to Terri's disapproval.\n\nPeter's eyesight gradually worsens and his boss, Howard Mann (Herb Edelman), begins to criticize his work. Peter schedules a risky operation that could cure his problem, and tries to keep it a secret from Terri to avoid worrying her. Howard gets hysterical and inadvertently ruins Peter's alibi of working away from home on a book. Terri tells him that she had known that Peter was going blind when she first met him.\n\nTECHNICAL SPECIFICATIONS:-\nVideo Codec: MPEG-2\nVideo Bitrate: 9032 kbps\nVideo Resolution: 720x480\nVideo Aspect Ratio: 1.778:1\nFrames Per Second: 29.970\nAudio Codec:  AC3\nAudio Bitrate: 192kb/s CBR 48000 Hz\nAudio Streams:  2\nAudio Languages: English\nRunTime 110 mins\nSubtitles: NONE\nRipped by: Trinidad [DDR]","torrent":{"xt":"urn:btih:eb74a841a7287efd1e0c6090a91c54b8fe6d5637","amp;dn":"The+War+Between+Men+and+Women+%281972%29+DVD9+Untouched-+Jack+Lemmon","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eb74a841a7287efd1e0c6090a91c54b8fe6d5637","infoHashBuffer":{"type":"Buffer","data":[235,116,168,65,167,40,126,253,30,12,96,144,169,28,84,184,254,109,86,55]},"announce":[],"urlList":[]}}