{"title":"Dead Can Dance - Within The Realm... (1987) 2008 MFSL-SACD-DFF","uid":11113167,"size":1634552566,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:eb99bc95ef89e72d61d31086c6ea604319fce60d&amp;dn=Dead+Can+Dance+-+Within+The+Realm...+%281987%29+2008+MFSL-SACD-DFF&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"hal4000","files":-1,"time":1411830250,"description":"Dead Can Dance is an English-Australian musical project that formed in 1981 in Melbourne by Lisa Gerrard and Brendan Perry. The band relocated to London, England, in May 1982. Australian music historian Ian McFarlane described Dead Can Dance's style as &quot;constructed soundscapes of mesmerising grandeur and solemn beauty; African polyrhythms, Gaelic folk, Gregorian chant, Middle Eastern mantras and art rock.&quot;\n\nWith its two sides split between Perry and Gerrard's vocal efforts, Within the Realm of a Dying Sun serves as both a display for the ever more ambitious band and a chance for the two to individually demonstrate their awesome talents. Beginning with the portentous &quot;Anywhere Out of the World,&quot; a piece that takes the deep atmospherics of &quot;Enigma of the Absolute&quot; to a higher level with mysterious, chiming bells, simple but effective keyboard bass and a sense of vast space, the album finds Dead Can Dance on a steady roll. Once again a range of assistant musicians provide even more elegance and power to the band's work, with a chamber string quartet plus various performers on horns, woodwind, and percussion. Impressive though the remainder of the first side is, Gerrard's showcase on the second half is even more enveloping and arguably more successful. The martial combination of drums and horns that start &quot;Dawn of the Iconoclast&quot; call to mind everything from Wagner to Laibach, but Gerrard's unearthly alto, at its most compelling here, elevates it even higher. &quot;Cantara&quot; is no less impressive, a swirling, drum-heavy song that sounds equally inspired by gypsy dancing, classical orchestras and any number of Arab musical traditions. &quot;Summoning of the Muse&quot; is perhaps too formal in comparison, though still quite impressive, but &quot;Persephone&quot; is the finer effort and a good way to close.\n\nDFF files extracted with Scarletbook\n   &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/10942620/Scarletbook-SACD-Extractor&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/10942620/Scarletbook-SACD-Extractor&lt;/a&gt;\n\nfrom the 2008 Mobile Fidelity Sound Lab SACD.\n\nSACD-ISO-DFF-1Bit-2.8Mhz.\n","torrent":{"xt":"urn:btih:eb99bc95ef89e72d61d31086c6ea604319fce60d","amp;dn":"Dead+Can+Dance+-+Within+The+Realm...+%281987%29+2008+MFSL-SACD-DFF","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eb99bc95ef89e72d61d31086c6ea604319fce60d","infoHashBuffer":{"type":"Buffer","data":[235,153,188,149,239,137,231,45,97,211,16,134,198,234,96,67,25,252,230,13]},"announce":[],"urlList":[]}}