{"title":"Ivan Marxs  - Big Foot  -1978- (Documentary)","uid":11132751,"size":718119557,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:eb9fbb79df792a4cadac124d370140f182b5f9d4&amp;dn=Ivan+Marxs++-+Big+Foot++-1978-+%28Documentary%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Mooseleg8","files":-1,"time":1412075235,"description":"Ivan Marx was an animal tracker, woodsman, hunting guide, explorer, adventurer, accomplished nature photographer, and dedicated Bigfoot hunter. Ivan first began his Bigfoot research in the 50s. He was involved in the Bossburg, Washington Cripple Foot track finds in November, 1969 and claimed to have shot actual footage of a crippled Sasquatch in October, 1970. Marx briefly worked for three months for renowned Bigfoot researcher Peter Byrne, who later became one of Ivan's biggest and most vehement detractors. Moreover, Ivan also collaborated with famed physical anthropologist Grover Krantz. In 1976 Marx narrated, co-produced, and appeared as himself in the lively and enjoyable documentary &quot;The Legend of Bigfoot.&quot; (Ivan also was a cinematographer on this picture.) He subsequently followed this feature with two more documentaries: &quot;In the Shadow of Bigfoot&quot; and &quot;Bigfoot: Alive and Well in '82.&quot; Marx and his wife Peggy lived in Burney, Shasta County, California. Although widely derided as a fraud by many Sasquatch experts, Ivan always insisted that his movies and photographs of Bigfoot were real. He was a mentor to controversial fellow Bigfoot researcher Tom Biscardi. Ivan Marx died in 1999.","torrent":{"xt":"urn:btih:eb9fbb79df792a4cadac124d370140f182b5f9d4","amp;dn":"Ivan+Marxs++-+Big+Foot++-1978-+%28Documentary%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eb9fbb79df792a4cadac124d370140f182b5f9d4","infoHashBuffer":{"type":"Buffer","data":[235,159,187,121,223,121,42,76,173,172,18,77,55,1,64,241,130,181,249,212]},"announce":[],"urlList":[]}}