{"title":"Stevie Wonder - Innervisions (1973) 2011 SHM-SACD-DFF","uid":11091529,"size":1875998829,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:ed989286aca6dfd43cbdbf1d4101e7653046f741&amp;dn=Stevie+Wonder+-+Innervisions+%281973%29+2011+SHM-SACD-DFF&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"hal4000","files":-1,"time":1411529708,"description":"Stevland Hardaway Morris (born May 13, 1950, as Stevland Hardaway Judkins), known by his stage name Stevie Wonder, is an American musician, singer-songwriter, record producer, and multi-instrumentalist. A child prodigy, he has become one of the most creative and loved musical performers of the late 20th century. Wonder signed with Motown's Tamla label at the age of 11 and continues to perform and record for Motown as of the early 2010s. He has been blind since shortly after birth.\n\nWhen Stevie Wonder applied his tremendous songwriting talents to the unsettled social morass that was the early '70s, he produced one of his greatest, most important works, a rich panoply of songs addressing drugs, spirituality, political ethics, the unnecessary perils of urban life, and what looked to be the failure of the '60s dream -- all set within a collection of charts as funky and catchy as any he'd written before. Two of the highlights, &quot;Living for the City&quot; and &quot;Too High,&quot; make an especially deep impression thanks to Stevie's narrative talents; on the first, an eight-minute mini-epic, he brings a hard-scrabble Mississippi black youth to the city and illustrates, via a brilliant dramatic interlude, what lies in wait for innocents. (He also uses his variety of voice impersonations to stunning effect.) &quot;Too High&quot; is just as stunning, a cautionary tale about drugs driven by a dizzying chorus of scat vocals and a springing bassline. &quot;Higher Ground,&quot; a funky follow-up to the previous album's big hit (&quot;Superstition&quot;), and &quot;Jesus Children of America&quot; both introduced Wonder's interest in Eastern religion. It's a tribute to his genius that he could broach topics like reincarnation and transcendental meditation in a pop context with minimal interference to the rest of the album. Wonder also made no secret of the fact that &quot;He's Misstra Know-It-All&quot; was directed at Tricky Dick, aka Richard Milhouse Nixon, then making headlines (and destroying America's faith in the highest office) with the biggest political scandal of the century. Putting all these differing themes and topics into perspective was the front cover, a striking piece by Efram Wolff portraying Stevie Wonder as the blind visionary, an artist seeing far better than those around him what was going on in the early '70s, and using his astonishing musical gifts to make this commentary one of the most effective and entertaining ever heard.\n\nDFF files extracted with Scarletbook\n &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/10942620/Scarletbook-SACD-Extractor&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/10942620/Scarletbook-SACD-Extractor&lt;/a&gt;\n\nfrom the Japanese 2011 SHM-SACD.\n\nSHM-SACD-ISO-1Bit-2.8Mhz.","torrent":{"xt":"urn:btih:ed989286aca6dfd43cbdbf1d4101e7653046f741","amp;dn":"Stevie+Wonder+-+Innervisions+%281973%29+2011+SHM-SACD-DFF","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ed989286aca6dfd43cbdbf1d4101e7653046f741","infoHashBuffer":{"type":"Buffer","data":[237,152,146,134,172,166,223,212,60,189,191,29,65,1,231,101,48,70,247,65]},"announce":[],"urlList":[]}}