{"title":"Sallustius: Concerning the Gods and the Universe","uid":11086714,"size":22549875,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ee2bb513e06465f79fe4f59437642cd381bf0eae&amp;dn=Sallustius%3A+Concerning+the+Gods+and+the+Universe&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"neoplatonist11","files":1,"time":1411466266,"description":"\nPDF\n\nThis is a &quot;MUST OWN&quot; very rare book\n\n\n\nThe Neoplatonist Sallust more than likely wrote this work, &quot;On the Nature of the Gods and the Universe,&quot; during the reign of the emperor Julian (361-63 AD). It may have been written in reaction to the rising tide of Christianity, in order to promote the pagan reforms of Julian. Nevertheless, the reader will find here a compendium of the Platonic philosophy, as Sallust comprehended it through the works of his predecessor, Iamblichus. The student of Plato will find several ideas to play with in this treatise; and the assiduous collector of Greeco-Roman literature could hardly go without this on the shelf. Although Platonism during this time was becoming an esoteric sect full of commentators bent on orthodoxy rather than free thought, Sallust's work is still unique if taken into context. &quot;On the Nature of the Gods and the Universe,&quot; is interesting as a piece of religious propaganda and enlightening as a brief compilation of Platonic thought. Also included here in Thomas Taylor's volume are the wise sayings of Pythagoras as recorded by Demophilus, several hymns by the great Proclus, and five hymns by the scholar Thomas Taylor himself. This is a definite piece of Hellenism for the philosophical and literary enthusiast, and it is thoroughly recommended. ","torrent":{"xt":"urn:btih:ee2bb513e06465f79fe4f59437642cd381bf0eae","amp;dn":"Sallustius%3A+Concerning+the+Gods+and+the+Universe","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ee2bb513e06465f79fe4f59437642cd381bf0eae","infoHashBuffer":{"type":"Buffer","data":[238,43,181,19,224,100,101,247,159,228,245,148,55,100,44,211,129,191,14,174]},"announce":[],"urlList":[]}}