{"title":"My Journey: Transforming Dreams Into Actions [A.P.Z Abdul Kalam]","uid":12170792,"size":721630,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:efc409745bc6e48578a76ed5f8435b351c278851&amp;dn=My+Journey%3A+Transforming+Dreams+Into+Actions+%5BA.P.Z+Abdul+Kalam%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Cquark","files":1,"time":1438175218,"description":"Book Description:\nFrom a small boy growing up in Rameswaram, to becoming the country s eleventh President, A.P.J. Abdul Kalam s life has been a tale of extraordinary determination, courage, perseverance and the desire to excel. In this series of anecdotes and profiles, Dr Kalam looks back on key moments in his past some small and some momentous and tells the reader how each of them inspired him profoundly. With warmth and affection, he talks about the people who left a deep impression on him as he was growing up and as an adult, and the lessons he drew from his interactions with them. He describes those who have been the closest to him his father with his deep love of God, his mother and her great kindness, his mentors who helped shape his thoughts and outlook. There are heart-warming accounts here of his childhood years spent in a small town by the Bay of Bengal and the many struggles and sacrifices made on the path to becoming a scientist and then the President of India. Dr Kalam also writes about the times when failure and dejection nearly overtook him and how he prevailed over those obstacles by drawing strength from books and spirituality","torrent":{"xt":"urn:btih:efc409745bc6e48578a76ed5f8435b351c278851","amp;dn":"My+Journey%3A+Transforming+Dreams+Into+Actions+%5BA.P.Z+Abdul+Kalam%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"efc409745bc6e48578a76ed5f8435b351c278851","infoHashBuffer":{"type":"Buffer","data":[239,196,9,116,91,198,228,133,120,167,110,213,248,67,91,53,28,39,136,81]},"announce":[],"urlList":[]}}