{"title":"Britain.At.The.Bookies.s01e02.ENG.SUBS.WEBRIP.[MPup]","uid":12169439,"size":652472411,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:f1c76795f2528b9fd3f50efedceb35155fb6f6b9&amp;dn=Britain.At.The.Bookies.s01e02.ENG.SUBS.WEBRIP.%5BMPup%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"makinapufterpup","files":4,"time":1438108715,"description":"Britain.At.The.Bookies.s01e02.ENG.SUBS.WEBRIP.[MPup]\n\nFormat: MPEG-4\nSize: 832x468\nDisplayAspectRatio: 16:9\nFrameRate: 25.000 fps\nAudioCodec: AAC\nChannels: 2 channels\nSamplingRate: 48.0 KHz\n\nDocumentary examining the winners and losers in Britain's gambling revolution. The battle between punter and bookie plays out over one big race day at Doncaster.\n\n[img]http://extraimago.com/images/2015/07/28/6163a770bb973360eda0800a72fd2926.png[/img]\n\n[img]http://extraimago.com/images/2015/07/28/4ad9380a4393a33c53c7ce5bc8a4d444.jpg[/img]\n\nSaturday is the biggest day of the week for bookmakers and the day for up to four million regular punters to try their luck against the industry's experts - the traders. The second episode of this three-part series takes the viewer through the unfolding drama of one big race day at Doncaster from completely opposing points of view, as we see the battle between punter and bookie play out.\n\nWith unprecedented access to Coral's betting HQ, we see traders set the odds that will attract the most punters. The trick is to spot the horses they think will win and then offer less attractive odds than rival bookies. They want to set the most favourable odds on the horses they think will lose. Many of the traders are punters too, putting their own bets on with other bookmakers to make sure they don't miss out.\n\nTrackside at Doncaster, independent bookmaker Keith Johnson tries to offer better odds than the high-street giants like Coral. And we are with passionate race-goers like Andy and his girlfriend Gosia, who study every tiny detail of the horses and trainers before placing their bets. The same races, filmed from very different perspectives, will mean very different things depending on whether you are punter or bookie, whether you have bet small, or bet big.\n\nCoral could lose half a million pounds on a favourite romping home, but if the traders have done their job well, they could see hundreds of thousands in takings for each big race. As the day at Doncaster unfolds, will Andy's nous and eye for detail mean he can spot a 20-1 outsider as the winner?","torrent":{"xt":"urn:btih:f1c76795f2528b9fd3f50efedceb35155fb6f6b9","amp;dn":"Britain.At.The.Bookies.s01e02.ENG.SUBS.WEBRIP.%5BMPup%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f1c76795f2528b9fd3f50efedceb35155fb6f6b9","infoHashBuffer":{"type":"Buffer","data":[241,199,103,149,242,82,139,159,211,245,14,254,220,235,53,21,95,182,246,185]},"announce":[],"urlList":[]}}