{"title":"Desk Encyclopedia of Microbiology 1st &amp; 2nd Edition - Gooner","uid":12136929,"size":94970750,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f228cd575384c605ffa3a4857452f53923812937&amp;dn=Desk+Encyclopedia+of+Microbiology+1st+%26amp%3B+2nd+Edition+-+Gooner&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"GoonerTPB","files":2,"time":1437178258,"description":"Publisher: Academic Press; 1 edition (December 18, 2003)\nLanguage: English\nISBN-10: 0126213615\nISBN-13: 978-0126213614\n\nThe Desk Encyclopedia of Microbiology aims to provide an affordable and ready access to a large variety of microbiological topics within one set of covers. This handy desk-top reference brings together an outstanding collection of work by the top scientists in the field. Covering topics ranging from the basic science of microbiology to the current &quot;hot&quot; topics in the field. \n\n* Provides a broad, easily accessible perspective on a wide range of microbiological topics\n* A synthesis of the broadest topics from the comprehensive and multi-volumed Encyclopedia of Microbiology, Second Edition \n* Helpful resource in preparing for lectures, writing reports, or drafting grant applications[/b]\n\nPublisher: Academic Press; 2 edition (September 2, 2009)\nLanguage: English\nISBN-10: 0123749808\nISBN-13: 978-0123749802\n\nThe Desk Encyclopedia of Microbiology, Second Edition is a single-volume comprehensive guide to microbiology for the advanced reader. Derived from the six volume e-only Encyclopedia of Microbiology, Third Edition, it bridges the gap between introductory texts and specialized reviews. Covering topics ranging from the basic science of microbiology to the current &quot;hot&quot; topics in the field, it will be invaluable for obtaining background information on a broad range of microbiological topics, preparing lectures and preparing grant applications and reports. \n\n* The most comprehensive single-volume source providing an overview of microbiology to non-specialists\n* Bridges the gap between introductory texts and specialized reviews. \n* Provides concise and general overviews of important topics within the field making it a helpful resource when preparing for lectures, writing reports, or drafting grant applications","torrent":{"xt":"urn:btih:f228cd575384c605ffa3a4857452f53923812937","amp;dn":"Desk+Encyclopedia+of+Microbiology+1st+%26amp%3B+2nd+Edition+-+Gooner","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f228cd575384c605ffa3a4857452f53923812937","infoHashBuffer":{"type":"Buffer","data":[242,40,205,87,83,132,198,5,255,163,164,133,116,82,245,57,35,129,41,55]},"announce":[],"urlList":[]}}