{"title":"The Environment and Landscape in Motorway Design","uid":12182862,"size":17666789,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f23a9d00e1b27fa3d6b3f45410c7574c3c52bbbc&amp;dn=The+Environment+and+Landscape+in+Motorway+Design&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"mdusanjay","files":1,"time":1438491224,"description":"The Environment and Landscape in Motorway Design by Guochao Qian and Shuyu Tang\n\nEnglish | 2014 | ISBN: 1118332970 | 384 pages | PDF | 16,8 MB\n\nThe construction and operation of highways has a significant impact on the environment. While such impact is impossible to avoid, modern highways are constructed and landscaped to minimise these impacts as far as possible. Good landscaping minimises the impact on those living or working close to the highway, while at the same time regenerating the natural landscape disturbed during construction.\n\nUsing as its background the successful landscape design of the Nanjing-Hangzhou Expressway in Jiangsu Province, China, which opened to traffic in 2007, Highway Landscape Design includes reference to all aspects of the landscaping of highways, including interchanges, embankments, central reservations, bridges, service and toll station areas, and drainage systems. Appropriate consideration is given to the negative impact on the surrounding environment during the process of construction and it discusses the ecological evaluation and conservation strategy for the highway route. China is in some respects at the forefront of highway landscape design as a result of rapid growth and development coupled with the financial resources to implement major infrastructure works, and the concepts, technologies and methods developed for this Expressway provide valuable experience for sustainable development strategies for such infrastructure","torrent":{"xt":"urn:btih:f23a9d00e1b27fa3d6b3f45410c7574c3c52bbbc","amp;dn":"The+Environment+and+Landscape+in+Motorway+Design","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f23a9d00e1b27fa3d6b3f45410c7574c3c52bbbc","infoHashBuffer":{"type":"Buffer","data":[242,58,157,0,225,178,127,163,214,179,244,84,16,199,87,76,60,82,187,188]},"announce":[],"urlList":[]}}