{"title":"Mahatma Gandhi - Nonviolent Power in Action - Dennis Dalton","uid":12144775,"size":7097703,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f2a3b9f618d3c7b6f3860c8571b8a5e18ab51379&amp;dn=Mahatma+Gandhi+-+Nonviolent+Power+in+Action+-+Dennis+Dalton&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Mohammad_AT","files":3,"time":1437442997,"description":"Mahatma Gandhi's ideas and achievements rank preeminent among leaders of the twentieth century. Dennis Dalton's study of Gandhi's life and thought identifies the crucial link between his political philosophy and his activism and sets forth new ideas about Gandhi's inclusive style of politics.  \n\nDalton begins by tracing Gandhi's formative experiences in South Africa between 1893 and 1914 where his method of nonviolent resistance, or satyagraha, was born and melded with his concept of swaraj - personal and political liberation. After examining Gandhi's emergence as a national leader in India between 1919 and 1922, Dalton provides an indepth analysis of two of his signal triumphs: the 1930 civil disobedience campaign against the British and the 1947 Calcutta fast for Hindu-Muslim unity. Dalton brings fresh insight to these important years by culling information from unpublished sources and interviews with numerous participants, including those who joined Gandhi's Salt March to the sea.  \n\nDalton places Gandhi's ideas within the historical context of his interaction with the British government and with the religious communities of India. He pays particular attention to the role of religious faith in Gandhi's social reform, how his views on the caste system affected his political activism, and his debates with the Marxist theoretician M. N. Roy and the Nobel laureate Rabindranath Tagore.  \n\nDalton concludes with a stirring comparison of Gandhi to Martin Luther King, Jr. and Malcolm X and assesses the lasting importance of Gandhi's ideas. &quot;His claim to uniqueness rests both on the originality of his thought and even more on his uncanny ability to put his theory into practice,&quot; writes Dalton.  \n\n&quot;Because key ideas like freedom and power so concerned him, the creative ways that he translated them into action remain exciting today, almost fifty years after his death.&quot;","torrent":{"xt":"urn:btih:f2a3b9f618d3c7b6f3860c8571b8a5e18ab51379","amp;dn":"Mahatma+Gandhi+-+Nonviolent+Power+in+Action+-+Dennis+Dalton","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f2a3b9f618d3c7b6f3860c8571b8a5e18ab51379","infoHashBuffer":{"type":"Buffer","data":[242,163,185,246,24,211,199,182,243,134,12,133,113,184,165,225,138,181,19,121]},"announce":[],"urlList":[]}}