{"title":"Calibre - 2.4 - Linux (x64)","uid":11107481,"size":58518072,"categoryP":"applications","categoryS":"unix","magnet":"?xt=urn:btih:f2bd6613da14e8841e3a22ae3b7f5f71852792d0&amp;dn=Calibre+-+2.4+-+Linux+%28x64%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"The_Doctor-","files":1,"time":1411745055,"description":"Version 2.4 (Released 25 September 2014) of Calibre licensed under the GNU GPL v.3 for Linux (x64).\n\nCalibre is a free and open source e-book library management application developed by users of e-books for users of e-books.\n\nOfficial site: calibre-ebook.com\n\nPlease rate and comment and seed for as long as you can.\n\nChanges in 2.4\n\nNew Features\n\n    An all new random cover generation algorithm, which generates covers using many different color schemes and cover styles\n    Now when you click the Generate cover button in the Edit Metadata dialog a cover based on the book metadata is generated using random colors and styles. You can customize the random cover generation by long clicking the Generate Cover button, which will popup a dialog where you can create new color schemes and customize other aspects of the generated cover as well.\n    Edit Book: Redesign the saved searches pop-up as a dockable window. Editing saved searches now happens inline and the global search/replace keyboard shortcuts work in the saved searches window\n    Edit book: Change the text of the 'Mark selected text' menu entry depending on whether it will mark or unmark the text\n    Edit metadata dialog: Allow undoing a metadata download by long-clicking the Download metadata button and choosing &quot;Undo last metadata download&quot;\n    Edit metadata dialog: Allow undoing the changes to individual fields by right clicking on the field and selecting Undo after a metadata download.\n    Download metadata dialog: Allow using Enter key to select cover and left/right keys to move between metadata results.\n    Fix the row numbers in the book list remaining wide when switching libraries if some books were marked before the switch.\n    Fix keyboard focus not going to cover grid after doing a search.\n    DOCX Input: Support for the keepNext paragraph property to keep successive paragraphs on the same page.\n    Template language: New template functions: raw_list() to return the items in a list such as tags without any sorting/formatting applied to them; author_sorts() to return the author sort strings from the authors table for the authors in the book.\n\n\n\nBug Fixes\n\n    Fix a regression in 2.3 that broke creation of collections on the device when metadata management was set to manual.\n    E-book viewer: Fix displaying multiple pages per screen not working in calibre 2.x with some books, due to a change in Qt 5.\n    E-book viewer: Fix unintuitive behavior of back and forward buttons when going all the way back to the first item in the history.\n    Conversion: Do not allow default (user-agent) style rules to ever override style rules defined in the input document, regardless of CSS selector specificity\n    Workaround for Qt 5 regression that broke selecting multiple icons in Preferences-&gt;Column icon rules\n    Fix tags with angle brackets not being displayed in the Book Details panel\n\n\n\nNew news sources\n\n    Hurriyet Daily News and Al Monitor by spswerling\n    VICE News by Adrian Tennessee\n    Jagran Josh by Krittika Goyal\n\n\n\nImproved news sources\n\n    Today's Zaman\n    Wall Street Journal\n    High Country News","torrent":{"xt":"urn:btih:f2bd6613da14e8841e3a22ae3b7f5f71852792d0","amp;dn":"Calibre+-+2.4+-+Linux+%28x64%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f2bd6613da14e8841e3a22ae3b7f5f71852792d0","infoHashBuffer":{"type":"Buffer","data":[242,189,102,19,218,20,232,132,30,58,34,174,59,127,95,113,133,39,146,208]},"announce":[],"urlList":[]}}