{"title":"Knights (1993) DvDRip","uid":11125620,"size":734089019,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:f35d5647ad7a0ee083a9613ff082cf757c5a4764&amp;dn=Knights+%281993%29+DvDRip&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"dbuck53","files":2,"time":1411963916,"description":"Knights is a B-grade post-apocalypse movie staring kick-boxing champion \n\nKathy Long in her film debut. Kathy plays rescued protege to Kris Pros: \n\nKris Kristofferson in an unusual role. Martial artist Kathy Long not as \n\nbad as might have been expected. Some supporting cast shine in spots.\n\nCons: Lance Hendrickson phoned it in. His character and role are silly. \n\nThank goodness he has minions to do most of the action.\n\nKristofferson is in one of his more unusual roles as a cyborg-killer \n\ncyborg. Lance Hendrickson, better known for his portayal of artificial \n\nperson Bishop in the Alien series plays evil cyborg leader Job, who leads \n\nhis band of Cyborgs across the wasteland harvesting and consuming human \n\nblood for fuel.\n\nKnights was originally intended by director Albert Pyun as a sequel to his \n\n1989 movie Cyborg, starring Jean-Claude Van Damme, but eventually became \n\nand stand-alone feature.\n\nThough the plot and acting are weak, Kristofferson's natural screen \n\npresence holds the movie together. There are moments when you could close \n\nyour eyes and see him as Whistler of the later Blade movie series. Long \n\nactually pulls off some shining moments and her character seems at least \n\nas credible as many modern female action roles. Most of the main \n\ncharacter's fight scenes are well done and Long's genuine fighting skills \n\nimpress as she barrels through man and machine alike in the climactic \n\nconflict. Overall it is fun to watch without being impressive in any way.  \n\nThe strange open-ended finish reveals the fact that sequels were planned \n\nbefore the movie failed financially.\n\nThis is the only copy I could find. It is a rather low-quality rip, and \n\nhas verbal translation over the default audio track. Be sure to change \n\nyour veiwer to the second choice audio track.","torrent":{"xt":"urn:btih:f35d5647ad7a0ee083a9613ff082cf757c5a4764","amp;dn":"Knights+%281993%29+DvDRip","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f35d5647ad7a0ee083a9613ff082cf757c5a4764","infoHashBuffer":{"type":"Buffer","data":[243,93,86,71,173,122,14,224,131,169,97,63,240,130,207,117,124,90,71,100]},"announce":[],"urlList":[]}}