{"title":"Graham Oppy &amp; N. N. Trakakis - Nineteenth-Century Philosophy","uid":11110326,"size":2240657,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f3c9f03d268f073c2fb09dec20b2f25be82aa537&amp;dn=Graham+Oppy+%26amp%3B+N.+N.+Trakakis+-+Nineteenth-Century+Philosophy&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"philosophi","files":-1,"time":1411783868,"description":"Graham Oppy &amp; N. N. Trakakis - Nineteenth-Century Philosophy of Religion: The History of Western Philosophy of Religion (Volume 4)\n\nThe nineteenth century was a turbulent period in the history of the philosophical scrutiny of religion. Major scholars - such as Hegel, Fichte, Schelling, Newman, Caird and Royce - sought to construct systematic responses to the Enlightenment critiques of religion carried out by Spinoza and Hume. At the same time, new critiques of religion were launched by philosophers such as Schopenhauer and Nietzsche and by scholars engaged in textual criticism, such as Schleiermacher and Dilthey. Over the course of the century, the work of Marx, Freud, Darwin and Durkheim brought the revolutionary perspectives of political economy, psychoanalysis, evolutionary theory and anthropology to bear on both religion and its study. These challenges played a major role in the shaping of twentieth-century philosophical thought about religion. &quot;Nineteenth-Century Philosophy of Religion&quot; will be of interest to scholars and students of Philosophy and Religion, and will serve as an authoritative guide for all who are interested in the debates that took place in this seminal period in the history of philosophical thinking about religion.","torrent":{"xt":"urn:btih:f3c9f03d268f073c2fb09dec20b2f25be82aa537","amp;dn":"Graham+Oppy+%26amp%3B+N.+N.+Trakakis+-+Nineteenth-Century+Philosophy","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f3c9f03d268f073c2fb09dec20b2f25be82aa537","infoHashBuffer":{"type":"Buffer","data":[243,201,240,61,38,143,7,60,47,176,157,236,32,178,242,91,232,42,165,55]},"announce":[],"urlList":[]}}