{"title":"Jet Set Radio HD [v.1.1]","uid":12252274,"size":1103806544,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:f3dcb4eeee6a5315584cdbef782309dd18d9983a&amp;dn=Jet+Set+Radio+HD+%5Bv.1.1%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"shikibane","files":12,"time":1440036278,"description":"\nDescription:\n\nThis is an actual working release of Jet Set Radio HD. I uploaded this since it seems every release on the internet as of right now is not working properly or has some sort of save game issue. Hopefully you guys can appreciate the effort it took hunting this down, although I take no credit for this upload i simply put together a torrent with all the proper updates and files you need to get this game running correctly.\n\n\n\n\n\nGame Description: \n\nJet Set Radio is devoted to the swashbuckling adventures of a street gang GG's, fighting in the vast futuristic city of Tokyo, the (Tokyo-to) for a place in the sun with rival gangs and police forces, which meanwhile hunting for bullies. To prove its superiority over other gangs members of GG's have using roller skates, bestowing the ability to make crazy acrobatics and dancing skedaddle from the custodians of the law, and cans of paint, allowing paint the sterile streets of Tokyo, some juicy graffiti and incidentally - to reveal one of the conspiracy corporation Rokkaku who ran the affairs of the city","torrent":{"xt":"urn:btih:f3dcb4eeee6a5315584cdbef782309dd18d9983a","amp;dn":"Jet+Set+Radio+HD+%5Bv.1.1%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f3dcb4eeee6a5315584cdbef782309dd18d9983a","infoHashBuffer":{"type":"Buffer","data":[243,220,180,238,238,106,83,21,88,76,219,239,120,35,9,221,24,217,152,58]},"announce":[],"urlList":[]}}