{"title":"Posture and Ergonomics: Improve your posture, stop back pain","uid":12240560,"size":1206420194,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:f3e369e10f057aff9b4698fed6d08916a65fce1b&amp;dn=Posture+and+Ergonomics%3A+Improve+your+posture%2C+stop+back+pain&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Ace11892","files":63,"time":1439783406,"description":"Posture and Ergonomics: Improve your posture, stop back pain\n\n\nCourse Description\n\n\nDo you spend your days hunched over a computer keyboard? Have hours spent looking down at your smartphone ruined your posture? If so, you're not alone--poor posture resulting from our high-tech lifestyles has become a worldwide epidemic.\n\nBut the good news is you can transform your posture, and it's surprisingly easy, using the techniques in this comprehensive posture and ergonomics course!\n\n\n\nIn this comprehensive, fun course, you will:\n\n\n\nLearn the importance of good posture by discovering many aspects of your health that poor posture negatively affects.\nFind out why your poor posture is continually broadcasting bad body language and may be making you appear less likable.\nLearn how poor posture could be making you depressed.\nFind out why your workspace may be ruining your posture and how you can fix it today.\nDiscover a simple, easy 3-step system to transform your posture starting right now.\nLearn powerful, effective stretches that will open you up and help you to keep your shoulders back and head up\nSee exercises that you can do starting today that will help you to improve your posture\nLearn simple, easy-to-do exercises and stretches that you can do at work, at your desk to keep your posture straight all day long!\nLearn how to improve your ergonomics at work AND in your car\nDiscover how good posture will make you feel amazing, and look even better!\nIn this class you'll discover proven, actionable tips and techniques to increase your flexibility and improve strength to support the long-term habit of good posture. Additionally, you'll learn how configuring your desk in an ergonomically correct fashion will enable you to reinforce your new good-posture habits all day long, while you're working (where most of us have terrible posture habits).\n\n\nIn the class bonus sections, you'll learn easy tips and techniques to help you improve your posture in your daily life, and you'll discover how to correctly configure your car seat so that driving doesn't have to ruin your posture. There are also some fun, actionable tips which will help you keep your good posture top-of-mind, so that you can continually enjoy the transformative power of great posture! Join the class now and start improving your posture today.\n\n\nWhat are the requirements?\n\n\nA desire to fix your posture quickly and easily\nA willingness to learn multiple methods and techniques for posture improvmeent\nNo special equipment or materials are needed at any point during this course.\nWhat am I going to get from this course?\n\n\nOver 63 lectures and 1.5 hours of content!\nLess pain, more energy and increased vitality that comes with good posture\nProven, easy techniques to quickly improve posture using the S.EI.S. system for posture improvement\nLearn to correctly configure your workspace for optimal ergonomics, based on the latest OSHA recommendations\nOver 30 stretches and exercises specifically targeted for fast and permanent posture improvement\n\n\nWhat is the target audience?\n\n\n\nBusy professionals whose constant interaction with computers and technology has ruined their posture\nStudents and professionals who spend more than one or two hours a day working on a computer\nGraphic designers, software developers, web developers, and others who make a living using a computer\nThose who have serious, chronic back problems resulting from years of poor posture should not take this course\nWhat you get with this course?","torrent":{"xt":"urn:btih:f3e369e10f057aff9b4698fed6d08916a65fce1b","amp;dn":"Posture+and+Ergonomics%3A+Improve+your+posture%2C+stop+back+pain","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f3e369e10f057aff9b4698fed6d08916a65fce1b","infoHashBuffer":{"type":"Buffer","data":[243,227,105,225,15,5,122,255,155,70,152,254,214,208,137,22,166,95,206,27]},"announce":[],"urlList":[]}}