{"title":"Heaven is for Real - Il Paradiso per Davvero (2014) [DVD9 - Mult","uid":12142741,"size":6525454374,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:f67203f11361b7c580e6f25b1a980e889fcd1b36&amp;dn=Heaven+is+for+Real+-+Il+Paradiso+per+Davvero+%282014%29+%5BDVD9+-+Mult&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"JackieALF","files":68,"time":1437385468,"description":"\n\nHeaven is for Real - Il Paradiso per Davvero\n\n\n\n\n\nThx to the Original Uploader (?)\n\nOriginal Title: Heaven is for Real\nCountry: Usa\nYear: 2014\nGenres: Drama\nDirector: Randall Wallace\nScreenplay: Randall Wallace, Christopher Parker\nPhotography: Dean Semler\nProduction: Roth Films\n\nGregg Kinnear -&gt; Todd Burpo\nKelly Reilly -&gt; Sonja Burpo\nConnor Corum -&gt; Colton Burpo\nLane Styles -&gt; Cassie Burpo\nMargo Martindale -&gt; Nancy Rawling\nThomas Haden Church -&gt; Jay Wilkins\nJacob Vargas\n\nFour-year-old Colton Burpo is the son of Todd Burpo, pastor of Crossroads Wesleyan Church in Imperial, Nebraska. Colton says he experienced Heaven during emergency surgery. He describes to his incredulous family about having looked down to see the doctor operating, his mother calling people to pray in the waiting room, and his father in another room yelling at God not to let him die. He also spoke of meeting his great-grandfather, who died long before he was born, his unborn sister that died in a miscarriage and whom no one had told him about, and meeting Jesus, describing his physical appearance.\n\nAs Colton continues to speak about his experiences in Heaven, Todd is faced with the dilemma of determining if his son's experience was genuine or a hallucination based on a near-death experience. His wariness about discussing the situation erodes the confidence of the board members of his church, and he is contacted by several members of the media. When Todd is called by a radio station for an impromptu interview on the air, he invites them to attend his sermon the following Sunday. At church, he preaches about his son's experiences and reveals his support for him.\n\nFollowing the events at the church, Todd is doing research on the internet and finds a story about a Lithuanian girl who had a similar experience. She painted a portrait of Jesus and Colton stated that her portrait was similar to how Jesus looked when he visited Heaven. Todd tries to speak to Colton further about the picture but he is interrupted by his wife revealing to him that she is pregnant with another child. The movie concludes with photos of Colton and his family in the present day.\n\n\nGeneral Info\n\n\nCompression: No\nMovie Quality: DVD9\nSize: 6373 Mb\nLanguages: English, English (Audio Descriptive service), French, Italian, Spanish Ac3 5.1\nSubtitles:  English, English (SDH), Dutch, French, Hindi, Italian, Spanish\nColors\nRuntime: 95 min\nMenu:Yes\nExtra: Delete scenes, Colton goes to Heaven\n\n\n\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt1929263/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt1929263/&lt;/a&gt;","torrent":{"xt":"urn:btih:f67203f11361b7c580e6f25b1a980e889fcd1b36","amp;dn":"Heaven+is+for+Real+-+Il+Paradiso+per+Davvero+%282014%29+%5BDVD9+-+Mult","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f67203f11361b7c580e6f25b1a980e889fcd1b36","infoHashBuffer":{"type":"Buffer","data":[246,114,3,241,19,97,183,197,128,230,242,91,26,152,14,136,159,205,27,54]},"announce":[],"urlList":[]}}