{"title":"Silent Killers: Submarines and Underwater Warfare","uid":11119779,"size":11393626,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f7413cdab2e14dd3186217f51b302604a9dc7694&amp;dn=Silent+Killers%3A+Submarines+and+Underwater+Warfare&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"JinRohEX","files":-1,"time":1411899857,"description":"Silent Killers: Submarines and Underwater Warfare (General Military)\nby  James Delgado, Clive Cussler\n\nDESCRIPTION:\n\nJames P Delgado, President and CEO of the Institute of Nautical Archaeology and author of Nuclear Dawn (Osprey), presents a detailed, stunningly visual, examination of the history and development of the submarine and its role in naval warfare, from the first practical experiments with submersible craft to the development of the modern nuclear submarine. \n\nCalling on his training as a nautical archaeologist who was among the first explorers to dive the Titanic, Delgado recreates the story of the sub from the bottom up--that is, through eerie photographs of subs at the bottom of the sea. In addition, he explores submarine technology, from wooden to iron to steel hulls, from hand-cranked to nuclear powered propulsion, from candle light to electricity, from gunpowder &quot;torpedoes&quot; to nuclear missiles Since the time of Jules Verne, submarines have been a topic of great interest to maritime and military fans and Delgado's new book explores all of the submarine's triumphs and tragedies, successes and failures in this fascinating and compelling illustrated history.","torrent":{"xt":"urn:btih:f7413cdab2e14dd3186217f51b302604a9dc7694","amp;dn":"Silent+Killers%3A+Submarines+and+Underwater+Warfare","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f7413cdab2e14dd3186217f51b302604a9dc7694","infoHashBuffer":{"type":"Buffer","data":[247,65,60,218,178,225,77,211,24,98,23,245,27,48,38,4,169,220,118,148]},"announce":[],"urlList":[]}}