{"title":"An Introduction to Astronomy and Astrophysics Pankaj Jain-2014","uid":12129399,"size":4372318,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f8a1a07477b97c05d35d8267da1071da009f0c48&amp;dn=+An+Introduction+to+Astronomy+and+Astrophysics+Pankaj+Jain-2014&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Cquark","files":1,"time":1436998715,"description":"Torrent created by : Charm-Quark\nAuthor : Pankaj Jain, 2014\nBook Description:\nAstronomy is the field of science devoted to the study of astronomical objects, such as stars, galaxies, and nebulae. Astronomers have gathered a wealth of knowledge about the universe through hundreds of years of painstaking observations. These observations are interpreted by the use of physical and chemical laws familiar to mankind. These interpretations supply information about the nature of these astronomical objects, allowing for the deduction of their surface and interior conditions. The science associated with these interpretations is called astrophysics.\n\nAn Introduction to Astronomy and Astrophysics offers a comprehensive introduction to astronomy and astrophysics, complete with illustrative examples and illuminating homework problems. Requiring a familiarity with basic physics and mathematics, this undergraduate-level textbook:\n\nAddresses key physics concepts relevant to stellar observations, including radiation, electromagnetic spectrum, photometry, continuous and discrete spectrum, and spectral lines\nDescribes instruments used for astronomical observations as well as how the radiation received is characterized and interpreted to determine the properties of stars\nExamines the structure of stars, the basic equations which explain stars in equilibrium, and the fusion reactions occurring in stellar cores\nDiscusses the evolution of stars, the solar system, the dynamics of galaxies, and the fundamentals of modern cosmology","torrent":{"xt":"urn:btih:f8a1a07477b97c05d35d8267da1071da009f0c48","amp;dn":"+An+Introduction+to+Astronomy+and+Astrophysics+Pankaj+Jain-2014","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f8a1a07477b97c05d35d8267da1071da009f0c48","infoHashBuffer":{"type":"Buffer","data":[248,161,160,116,119,185,124,5,211,93,130,103,218,16,113,218,0,159,12,72]},"announce":[],"urlList":[]}}