{"title":"Broadway's Lost Treasures I - DVD5 Uncompressed - 22 Tony Award ","uid":11108554,"size":4369625088,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:f9327827ace123a4187ed1394888a91227932642&amp;dn=Broadway%27s+Lost+Treasures+I+-+DVD5+Uncompressed+-+22+Tony+Award+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"SaM","files":-1,"time":1411761128,"description":"Broadway's Lost Treasures I - DVD5 Uncompressed - 22 Tony Award Performances [DDR]\n\nCAST INCLUDES:- Julie Andrews , Vivian Blaine , Yul Brynner , Betty Buckley , Carol Channing, Joel Grey, Bob Gunton, Steven Hack, Richard Kiley, Angela Lansbury, Patti LuPone , Andrea McArdle, Patricia Morison,Zero Mostel,  Jerry Orbach\n\nBroadway's Lost Treasures is a four-volume DVD set that contains rare footage from past Tony telecasts. Among the musical gems are Gwen Verdon performing &quot;All That Jazz&quot; and &quot;Nowadays&quot; from Chicago and &quot;Whatever Lola Wants&quot; from Damn Yankees; John Raitt singing &quot;Hey There&quot; from The Pajama Game, several decades before Harry Connick, Jr. took on the role; and a very young Jerry Orbach performing &quot;She Likes Basketball&quot; from Promises, Promises. There's also Andrea McArdle (Annie), Angela Lansbury (Sweeney Todd), Yul Brynner (The King and I), Zero Mostel (Fiddler on the Roof and A Funny Thing Happened on the Way to the Forum), Patti LuPone (Evita), as well as production numbers from Ragtime, 42nd Street, Guys and Dolls, and many more.\n\nThe Broadway's Lost Treasures Collection consists of three individual volumes previously released on DVD, as well as a fourth disc that covers dramatic performances. The Best of the Tony Awards: The Plays showcases such talent as James Earl Jones and Jane Alexander in The Great White Hope, Maggie Smith and Margaret Tyzack in Lettice and Lovage, John Lithgow and B.D. Wong in M. Butterfly, Joan Allen and Peter Friedman in The Heidi Chronicles, and Joe Mantegna and Ron Silver in Speed-the-Plow.\n\nThese discs are the brainchild of Christopher A. Cohen, a producer/director who literally grew up with the Tonys. His father, Alexander H. Cohen, was the executive producer of the Tony telecasts from 1967 to 1986. His mother, Hildy Parks, wrote and produced those television landmarks.\n\nThe DVDs feature color-corrected footage and digitally re-mastered sound. While much of the material has been broadcast in a series of PBS specials, a number of segments are seen here for the first time since they were telecast.\n\nBroadway's Lost Treasures is a two-hour collection of musical highlights, culled from 19 years (1967-1986) of Tony Awards telecasts by Christopher A. Cohen, son of the original telecasts' producers, Alexander H. Cohen and Hildy Parks. The program is divided into four self-explanatory segments -- &quot;Broadway Divas,&quot; &quot;Leading Men,&quot; &quot;Dancin',&quot; and &quot;Record Breakers&quot; -- and presented by hosts Angela Lansbury, Jerry Orbach, and Chita Rivera. Musical numbers include the &quot;Broadway Divas&quot;: Vivian Blaine (&quot;Adelaide's Lament&quot; from Guys and Dolls), Patti LuPone(&quot;A New Argentina&quot; from Evita), Angela Lansbury (&quot;The Worst Pies in London&quot; from Sweeney Todd), Carol Channing (&quot;Before the Parade Passes By&quot; from Hello Dolly), and Julie Andrews (&quot;Send in the Clowns&quot; from A Little Night Music). Next up are the &quot;Leading Men&quot;: Zero Mostel (&quot;If I Were a Rich Man&quot; from Fiddler on the Roof), Yul Brynner (&quot;Shall We Dance?&quot; from The King and I), John Raitt (&quot;Hey There&quot; from The Pajama Game), Robert Preston (&quot;Trouble&quot; from The Music Man), and Paul Lynde(&quot;Kids&quot; from Bye Bye Birdie). Now for the &quot;Dancin'&quot;: Joel Grey (&quot;Wilkommen&quot; from Cabaret), Tommy Tune and Twiggy (&quot;Chasin' the Clouds Away&quot; from My One and Only), Chita Rivera and Gwen Verdon perform &quot;All That Jazz&quot; and &quot;Nowadays&quot; from Chicago, and Jerry Orbach from 42nd Street (&quot;Lullaby of Broadway&quot;). Then there are the &quot;Record Breakers&quot;: Andrea McArdle and cast (&quot;Tomorrow&quot; from Annie), the cast of Annie (&quot;You're Never Fully Dressed Without a Smile&quot;), and Betty Buckley and the cast of Cats) (&quot;Jellicle Songs&quot; and &quot;Memory&quot;). This also includes the bonus performances not seen on the PBS pledge-special broadcasts: Ann Miller and Mickey Rooney (&quot;McHugh Medley&quot; from Sugar Babies), Patti LuPone (&quot;Buenos Aires&quot; from Evita), Barbara Harris (&quot;Movie Star Gorgeous&quot; from The Apple Tree), Bonnie Franklin (&quot;Applause&quot; from Applause), and Dorothy Loudon and cast (&quot;Easy Street&quot; and &quot;Tomorrow&quot; (reprise) from Annie). \n\nTECHNICAL SPECIFICATIONS:-\nVideo Codec: MPEG-2\nVideo Bitrate: 5020 kbps\nVideo Resolution: 720x480\nVideo Aspect Ratio: 1.778:1\nFrames Per Second: 29.970\nAudio Codec:  AC3\nAudio Bitrate: 192kb/s CBR 48000 Hz\nAudio Streams:  2\nAudio Languages: English\nRunTime 109 mins\nSubtitles: None\nRipped by: Trinidad [DDR]","torrent":{"xt":"urn:btih:f9327827ace123a4187ed1394888a91227932642","amp;dn":"Broadway%27s+Lost+Treasures+I+-+DVD5+Uncompressed+-+22+Tony+Award+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f9327827ace123a4187ed1394888a91227932642","infoHashBuffer":{"type":"Buffer","data":[249,50,120,39,172,225,35,164,24,126,209,57,72,136,169,18,39,147,38,66]},"announce":[],"urlList":[]}}