{"title":"Creativity City.iso","uid":11091818,"size":78546944,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:f9483ce7bd7057182fd858c705c6ed3ed28b66e5&amp;dn=Creativity+City.iso&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Justadoo444","files":-1,"time":1411534212,"description":"\nWhat can I say? This ISO contains the installation disc for VeggieTales Creativity City. The game came out in 2003, moreso the first half of it.\n\nFor fonts commonly seen in past VeggieTales releases, go to the &quot;Fonts&quot; folder in the program's folder after you install. Please use them only for personal stuff.\n\nAlso, it doesn't require the disk to run! YAY!\n\nRequires 64 Mb RAM, 60 MB Hard Disk Space, Windows 98 or higher\n\n     ----------Description----------\n\nThere's So Much To Do in Creativity City!\nVisit Larry's Sign Shack, the Post Office and even Junior's Toy Box to create and print your own pictures, games and hilarious activities.\n\n\nArt's Gallery - See your work you've made\n\nVeggiePlex - Posters\n\nSign Shack (L. Cucumber Proprietor): Think Banners, Awards, Doorknob Hangers, Growth Charts, Etc.!\n\nPost Office - Stuff you can Mail to friends, family and so on\n\nJunior's Toy Box - Stuff for you to play, including nifty Connect-the-Dots and Maze Makers\n\nBob's Bookworks - Reading/Writing Material. Includes an E-Book maker which makes a file out of a book you can send to another friend who has the game and have them use the included E-Book reader to view (Icon: Larry, program also in program folder if shortcut deleted). Complicated, I know, but it's fun!","torrent":{"xt":"urn:btih:f9483ce7bd7057182fd858c705c6ed3ed28b66e5","amp;dn":"Creativity+City.iso","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f9483ce7bd7057182fd858c705c6ed3ed28b66e5","infoHashBuffer":{"type":"Buffer","data":[249,72,60,231,189,112,87,24,47,216,88,199,5,198,237,62,210,139,102,229]},"announce":[],"urlList":[]}}