{"title":"Essentials: Deathlok the Demolisher (1974-1981)","uid":12156293,"size":258970102,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:f97c64e9e05c1fe03d7e8a50295c873ffbd5d363&amp;dn=Essentials%3A+Deathlok+the+Demolisher+%281974-1981%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Archivist_of_the_Damned","files":24,"time":1437789797,"description":"Deathlok the Demolisher, the original cybernetic anti-hero.  The tragic tale of Luther Manning is groundbreaking from beginning to the end of his adventures.  How many times has this series been ripped off in other comics, television, and movies?  James Cameron's Termimator movies are such a blatant rip that it is still shocking to believe Marvel never threatened legal action!  \n\nCyborgs were nothing new to science fiction in 1974, but they were few and far between in comics, much less headlining their own feature.  Deathlok presented a tortured protagonist who was literally fighting to retain a sense of humanity after being transformed into a cyborg.  He is the, now, atypical tortured machine questioning his humanity, but there's a twist, he was dead several years before his cybernetic enhancements.  He is a rotting, reanimated political assassin fighting a corrupt military-industrial complex.  Good stuff.  Manning's world has gone to hell  and the cause is never made totally clear throughout the run is Astonishing Tales. Where are all the Marvel heroes?  A lot of movies influenced the series such as the Parallax View, the Conversation, and Rollerball (a link made even more clear with the 2010 Deathlok mini-series). The initial run ended with the cancellation of Astonishing Tales, but the cyborg traveled back in time to Marvel-616 and the whole story mutated. His adventures in the mainstream Marvel universe culminate in Captain America 286-289 where Roger Stern explains the origins of Deathlok's timeline.  It should be said the Roger Stern was also writing the Amazing Spider-Man concurrently with Cap and both runs dovetail beautifully with prior plotlines created by Steve Englehart in the Avengers and Mark Gruenwald in Marvel Two-in-One. The climax of the Deathlok storyline ended a slew of plotlines from the seventies and set the stage for the eighties.  \n\nNow, to be clear, this collection doesn't contain all appearances of Luther Manning's Deathlok in mainstream Marvel continuity.  Dwayne McDuffie's brilliant update of Deathlok still has strong influences and continuity associated with Manning.  This collection merely covers Deathlok's story from 1974-1981.  Enjoy!","torrent":{"xt":"urn:btih:f97c64e9e05c1fe03d7e8a50295c873ffbd5d363","amp;dn":"Essentials%3A+Deathlok+the+Demolisher+%281974-1981%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f97c64e9e05c1fe03d7e8a50295c873ffbd5d363","infoHashBuffer":{"type":"Buffer","data":[249,124,100,233,224,92,31,224,61,126,138,80,41,92,135,63,251,213,211,99]},"announce":[],"urlList":[]}}