{"title":"Brian Setzer Orchestra 1994 08 19 Bimbos 365 Club, San Francisco","uid":11062892,"size":446490517,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:f99749f631373cc591e5c7174be62d00c221ce03&amp;dn=Brian+Setzer+Orchestra+1994+08+19+Bimbos+365+Club%2C+San+Francisco&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"johnny39","files":-1,"time":1411190738,"description":"(not my comments)\n\nThe Brian Setzer Orchestra 1994 08 19 Bimbos 365 Club, San Francisco, CA\n\nSource: FM Broadcast over KFOG\nLineage: CD-R from trade &gt; EAC &gt; FLAC Level 8\nSound Quality: A/A-\n\n\nI've dowloaded this many years ago, and here the original seeder notes:\n\n____________________________________________________________________________________________________________________________________________\n\nHere's another BSO show from my collection that I must admit is a perennial favorite.  Even though Brian and the band over the years have seasoned like fine wine and become more accomplished with this style of music, the early days hold the allure for me.  They've yet to cement any critical acclaim and there's still a certain edginess and determination of something to prove.  You can clearly hear this on the officially released live double cd set entitled The Ultimate Collection.  The first disc is from the early years recorded in Montreal and the second cd is a more recent show recorded in Japan.  Both are in keeping with Setzer's professionalism never to play a 'bad' show but that certain hunger is evidenced on the earlier (Montreal) concert as it is with this one recorded at the famous Bimbos 365 Club in San Francisco.\n\nIn trying to keep this shorter than my normal long winded reviews, I still feel compelled to point out a few items of interest:\n\nThis concert is so early in the band's live career that this pre-dates their usual fabulous opening with either The James Bond '007' Theme (for some reason a favorite with me), or the kitschy Hawaii Five-O.  Stay tuned as other BSO shows that I have include those!\n\nThere's quite a bit of interaction between Brian and the audience for the entire set.  Another indication that he and the band are enjoying the moment.\n\nThis is the only live BSO I own where he sings a tune that sleighs me, 'Drink That Bottle Down'.  Do enjoy.\n\nI received this in a trade where most of disc two are various other live BSO tracks and even a few Honeydripper tunes from the SNL episode (Eddie Murphy was the host during Christmas in 1984 I believe) with Bob Plant.  I decided to strip out all the excess and just present the set list at Bimbos 365 Club as it was that night.  As I said earlier, stay tuned for more.\n\nFinally, I have no artwork!  SO sorry!  I'm not creative enough nor was I able to snag any on the few sites that I know to check.  Perhaps someone can assist?\n\nAs always, please have fun listening and don't convert to MP3 or sell.  That's not cool and is the very essence of bad karma.\n\nRegards,\n\nDWP\n\n\n\nSet List:\n\n1.  Lady Luck\n2.  Good Rockin' Daddy\n3.  Your True Love\n4.  A Nightingale Sang In Berkeley Square\n5.  Brand New Cadillac\n6.  Sittin' On It All The Time\n7.  Stray Cat Strut\n8.  Straight Up\n9.  Route 66\n10. There's A Rainbow 'Round My Shoulder\n11. Drink That Bottle Down\n12. Rock This Town\n13. As Long As I'm Singing\n\n_____________________________________________________________________________________________________________________________________________\n\n\nIncluded an artwork i've found in the web.\n","torrent":{"xt":"urn:btih:f99749f631373cc591e5c7174be62d00c221ce03","amp;dn":"Brian+Setzer+Orchestra+1994+08+19+Bimbos+365+Club%2C+San+Francisco","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f99749f631373cc591e5c7174be62d00c221ce03","infoHashBuffer":{"type":"Buffer","data":[249,151,73,246,49,55,60,197,145,229,199,23,75,230,45,0,194,33,206,3]},"announce":[],"urlList":[]}}