{"title":"Hypocrisy by D.M. Annechino {dwg}","uid":11101800,"size":2066208,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:fa57376091df77c4b48f4020347723c1c2649797&amp;dn=Hypocrisy+by+D.M.+Annechino+%7Bdwg%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"gratefuldawg77","files":6,"time":1411677592,"description":"Dr. Lauren Crawford is a brilliant research scientist who discovers a revolutionary treatment for cancer that not only extends life, but much improves the quality of life for terminal cancer patients. The treatment, in some instances, can even cure certain cancers. On the evening before Dr. Crawford holds a press conference to announce that the FDA has given preliminary approval of her new cancer treatment, somebody follows her to her car and puts three bullets in her head. Was it a planned murder with a motive, a mugging gone badly, or merely a random act of violence? Two New York City homicide detectives, Amaris Dupree and T.J. Brown, are assigned to the investigation. The detectives evaluate the circumstances surrounding Dr. Crawford's death, and follow a trail of clues that exposes a sequence of startling facts. One by one, the detectives carefully examine each suspect and piece together a puzzle with unimaginable implications. As the investigation gets more intense, and the detectives get closer to solving the murder mystery, someone threatens Dupree's life. The detectives now realize that Dr. Crawford's murder was much more than a homicide. And if they don't arrest the murderer soon, Dupree might be the next victim.","torrent":{"xt":"urn:btih:fa57376091df77c4b48f4020347723c1c2649797","amp;dn":"Hypocrisy+by+D.M.+Annechino+%7Bdwg%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fa57376091df77c4b48f4020347723c1c2649797","infoHashBuffer":{"type":"Buffer","data":[250,87,55,96,145,223,119,196,180,143,64,32,52,119,35,193,194,100,151,151]},"announce":[],"urlList":[]}}