{"title":"The Bankers' New Clothes by Anat Admati and Martin Hellwig eBook","uid":12233135,"size":1282157,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:fa8ff810201e1a2907222a8218b280e3502ab574&amp;dn=The+Bankers%27+New+Clothes+by+Anat+Admati+and+Martin+Hellwig+eBook&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"lakilook","files":1,"time":1439616068,"description":"Publisher: Princeton University Press; Updated edition with a New Preface by the authors edition (March 23, 2014)\nLanguage: English\nISBN-10: 0691156840\nISBN-13: 978-0691156842\n\nRequirements: EPUB or .MOBI Viewer, 2 MB.\nOverview: What is wrong with today's banking system? The past few years have shown that risks in banking can impose significant costs on the economy. Many claim, however, that a safer banking system would require sacrificing lending and economic growth. The Bankers' New Clothes examines this claim and the narratives used by bankers, politicians, and regulators to rationalize the lack of reform, exposing them as invalid.\n\nAdmati and Hellwig argue we can have a safer and healthier banking system without sacrificing any of the benefits of the system, and at essentially no cost to society. They show that banks are as fragile as they are not because they must be, but because they want to be--and they get away with it. Whereas this situation benefits bankers, it distorts the economy and exposes the public to unnecessary risks. Weak regulation and ineffective enforcement allowed the buildup of risks that ushered in the financial crisis of 2007-2009. Much can be done to create a better system and prevent crises. Yet the lessons from the crisis have not been learned.\n\nAdmati and Hellwig seek to engage the broader public in the debate by cutting through the jargon of banking, clearing the fog of confusion, and presenting the issues in simple and accessible terms. The Bankers' New Clothes calls for ambitious reform and outlines specific and highly beneficial steps that can be taken immediately.\n\nGenre: Non-Fiction: General.\n\nWebsite: http://bankersnewclothes.com/","torrent":{"xt":"urn:btih:fa8ff810201e1a2907222a8218b280e3502ab574","amp;dn":"The+Bankers%27+New+Clothes+by+Anat+Admati+and+Martin+Hellwig+eBook","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fa8ff810201e1a2907222a8218b280e3502ab574","infoHashBuffer":{"type":"Buffer","data":[250,143,248,16,32,30,26,41,7,34,42,130,24,178,128,227,80,42,181,116]},"announce":[],"urlList":[]}}