{"title":"Corpse of Discovery-RELOADED","uid":12298398,"size":3007288897,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:fb23b0964df01b16660813b269e97b29b0a4eb6b&amp;dn=Corpse+of+Discovery-RELOADED&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"OvoJeKraj","files":3,"time":1440663341,"description":"1. Burn or mount the image.\n2. Install the game.\n3. Copy over the cracked content from the /Crack directory on the image to\nyour game install directory.\n4. Play the game.\n\nYou wake up on a base in a new, unexplored planet. Your landing craft is\ntorn to pieces and your gear is scattered. Why are you here? What is your\nmission? How will you ever get back home to your family?\n\n\nCorpse of Discovery is a thought-provoking first-person planetary\nexploration game located on a myriad of unexplored planets. As the player,\nall you know is that to return home, you must complete the mission at-hand\nfor the Corps of Discovery. However, with each mission completed, you're\nleft with unresolved questions and zero answers.\n\n\nThe Gameplay\nWhile contending with extreme and harsh conditions, such as intense storms\nand unbearable heat, you must remain determined while completing missions\nfor the Corps of Discovery. You'll meet AVA, an AssistBot who will\naccompany you on your journey and make sure you're constantly reminded of\nyour importance to the Corps. However, you have only one goal in mind: to\nget back home to your loved ones.\n\n\nFinding What Matters\nCorpse of Discovery looks at our lives under a symbolic microscope and\nexamines the inner workings of the choices we make, ultimately culminating\nin the crucial question, What sacrifices will we make to be successful? As\nyou struggle to complete each mission for the Corps, you are forced to\ngrapple with your humanity, who you are as a parent, a spouse, an employee,\nand a human being.\n\n\nFeatures\n\n\n* Mature and Deep Narrative: A thought-provoking exploration game, set\nin space, about life's revelations, misguided expectations,\ndisappointments and self-discovery.\n* Fantastic Alien Landscapes: Explore undiscovered worlds that go on for\nmiles, each world more astounding and beautiful than the last.\n* Immersive Investigative Gameplay: Examine your environment to\nunderstand new lifeforms, appreciate history, and re-live your precious\nmemories.\n* Environmental challenges: Experience unique planetary hazards and\ngameplay mechanics like deadly solar radiation, powerful wind storms,\nlava oceans, and floating islands only reachable by jetpack","torrent":{"xt":"urn:btih:fb23b0964df01b16660813b269e97b29b0a4eb6b","amp;dn":"Corpse+of+Discovery-RELOADED","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fb23b0964df01b16660813b269e97b29b0a4eb6b","infoHashBuffer":{"type":"Buffer","data":[251,35,176,150,77,240,27,22,102,8,19,178,105,233,123,41,176,164,235,107]},"announce":[],"urlList":[]}}