{"title":"Arm Candy - Jill Kargman","uid":12121131,"size":1368380,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:fb99eea7f4db8c2e1a00d20655a0d803fc563412&amp;dn=Arm+Candy+-+Jill+Kargman&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Mohammad_AT","files":4,"time":1436824204,"description":"&quot;Queen of the beach read&quot; (Washington Post Express) Jill Kargman, returns with an uproarious tale about searching for love and starts anew on the cusp of forty.\n\nFor two decades, thirty-nine-year-old Eden Clyde has been enjoying wealth and glamour as the muse and lover of Otto Clyde, the ultrafamous and much older king of the art world. Genetically, she hit the lottery, but Eden is unlucky in love: eighteen years ago she put aside her dream of true love and marriage and turned a blind eye to Otto's philandering in exchange for a life without want. In her younger days this seemed like a fair bargain, but as forty looms overhead-and as the beauty for which she's known begins to fade-she feels the cost of the arrangement finally taking its toll on her happiness.\n\nEden leaves their cozy downtown loft for New York's frostier upper east Side, where she begins to search for the girl and the life she left so many years ago. With the encouragement of a raucous but lovable group of girlfriends, Eden soon finds herself embroiled in a heated love affair with Gotham's most eligible bachelor: the much younger Chase Lydon. But just as their relationship is getting serious, an old flame resurfaces. Does Eden want the life she's living-and loving-right now, or the love she left behind? On the brink of her fortieth birthday, it's time for Eden to follow her heart, but this time not even Eden is sure where that will lead.\n\nPoignant and laugh-out-loud funny, and written with heart and humor, Arm Candy shows that although forty may sometimes feel like the ultimate F word, its never too late to find true love.\n\n**","torrent":{"xt":"urn:btih:fb99eea7f4db8c2e1a00d20655a0d803fc563412","amp;dn":"Arm+Candy+-+Jill+Kargman","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fb99eea7f4db8c2e1a00d20655a0d803fc563412","infoHashBuffer":{"type":"Buffer","data":[251,153,238,167,244,219,140,46,26,0,210,6,85,160,216,3,252,86,52,18]},"announce":[],"urlList":[]}}