{"title":"tycoon","uid":12292395,"size":225366,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:fca24218f83a86207095636d28a1a69e4634801a&amp;dn=tycoon&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"blkswrds","files":1,"time":1440572181,"description":"&quot; I couldn't hold or make gold to save my life. [Tycoon] helped me go from 2,000 gold to 100,000 in less then a month. &quot;&quot; Tycoon gives a player a plan or approach to making gold, a player isn't left trying to find what works, and what doesn't. The work has been done for you. &quot;Find Huge Deals on the Auction House\nControl the supply and demand on your server. Find hot items to buy for insanely low prices, then turn around and sell for a huge markup.Fill Your Bags With Insanely Profitable Mats\nFind low-competition farming spots packed full of squishy mobs with crazy high droprates for cloth, essences, &amp; more. All you have to do is pick up the loot.Get Paid Crazy Prices for the Right Herbs, Ore, &amp; Hides\nRake in the profits selling the lower level mats crafters need that no one else is supplying. Follow optimized gathering routes that take you through tightly-packed, resource-dense nodes so you can fill your bags fast, Craft the Items Your Server Will Pay a Premium For\nSee which professions are making a killing on your server. Discover the most profitable, in-demand items so you make a massive profit every time you push the &quot;Craft&quot; button.Steamroll Dungeons and Collect Tons of Valuable Loot\nDestroy dungeons for the ultimate in low-effort gold-making. Instantly see which will make you the most gold per hour and track your progress as the loot rolls in","torrent":{"xt":"urn:btih:fca24218f83a86207095636d28a1a69e4634801a","amp;dn":"tycoon","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fca24218f83a86207095636d28a1a69e4634801a","infoHashBuffer":{"type":"Buffer","data":[252,162,66,24,248,58,134,32,112,149,99,109,40,161,166,158,70,52,128,26]},"announce":[],"urlList":[]}}