{"title":"Indestructible You: Building a Self that Can't be Broken","uid":12128365,"size":1947615,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:fe09e86a992599918791f83c447d0526d7082b11&amp;dn=Indestructible+You%3A+Building+a+Self+that+Can%27t+be+Broken&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"mdusanjay","files":1,"time":1436980806,"description":"Shai Tubali, Tim Ward, &quot;Indestructible You: Building a Self that Can't be Broken&quot;\n\nISBN: 1782799400 | 2015 | EPUB | 207 pages | 2 MB\n\nIndestructible You is a practical guidebook for making yourself so strong inside that life's relentless ups and downs cannot shake you and cannot break you. It will help you uncover the powerful, driving force of your true self, and let go of everything that holds you back. The book is based exercises and practices developed by Shai Tubali through his research and work guiding several hundred individuals through psycho-transformational processes. In essence: Life is like an eternal seesaw. At every given moment you're either up - getting what you want and feeling powerful, or down - finding yourself rejected, weakened and frustrated. We are forever hoping to bend the laws of this 'unfair game' so that we stay on the up-side of life. But this unrealistic insistence is why we suffer. Indestructible You reveals the way to step down from the eternal seesaw and build an unbreakable self, a self that remains fearless and strong no matter what life throws at you","torrent":{"xt":"urn:btih:fe09e86a992599918791f83c447d0526d7082b11","amp;dn":"Indestructible+You%3A+Building+a+Self+that+Can%27t+be+Broken","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fe09e86a992599918791f83c447d0526d7082b11","infoHashBuffer":{"type":"Buffer","data":[254,9,232,106,153,37,153,145,135,145,248,60,68,125,5,38,215,8,43,17]},"announce":[],"urlList":[]}}