{"title":"Fedora-kickstart","uid":12128591,"size":182288225,"categoryP":"applications","categoryS":"unix","magnet":"?xt=urn:btih:fe4d8c6d8632595d8ba7225471afdda73adde319&amp;dn=Fedora-kickstart&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"RedHatHax","files":1,"time":1436983886,"description":"Fedora kickstart to generate MyOS located at wikis.southernhedgehogs.org.Generates both 21 and 22 images as well as Re-Generates Chapeau21/22 and Free-dora21/22 using &quot;libre&quot; kernel..This is NOT an ISO image. I dont have bandwidth to continually upload 4GB at a time.This is an alternative means to get the ISO regenerated yourself with the latest updates to the ISO.\n\nIncludes Steam,Vlc,3D Games,Skype, etc. etc.\n\nNot responsible for your use of NON-free software, which has penalties and restrictions in the open source community.Not all packages provided are from fedora, so file bugs accordingly.Must adibe by license agreement enclosed before using said software.Not responsible for your violations of RedHat policies.That said, Enjoy.Uses non-free software by default much like using Debian restricted/multiverse repos or similar on Ubuntu.\n\nFedora ships with more current and stable updates than Debian/Ubuntu/Linux Mint (insert Linux distro here) as it ships from RedHat by default.RedHat has been around for some time and is a BILLION dollar a year Linux company.\n\n\nFedora cannot ship this way, so we must rename ourselves and re-spin instead.If you want to contribute to branding and removing the HotDog, feel free to contact me on my website or PM me here.This is a process I am not familiar with and Im not an expert in doing this.Must know how to repack an RPM if you wish to contribute to doing this.\n\nDoes NOT have elliptic curves needed for some software.It appears that RedHat releases MAY contain the fix, which I am working on.Will update when this is fixed.\n\nFollow directions in the zip file.Spinning this is a cakewalk if you do so.You will need Fedora21/22 or any derivative spin of either version to build these images.I have not tested doing so from another release version.This is a software limitation.You need at least a base install of Fedora to use these files.\n\nProcess takes around 3 hours on a good internet connection which is required for this process.You download around 4GB of data and need at a minimum around 18GB of temporary space in /var. Install Fedora accordingly.Installation consumes around 12GB, which is why the temporary space requirements are so high","torrent":{"xt":"urn:btih:fe4d8c6d8632595d8ba7225471afdda73adde319","amp;dn":"Fedora-kickstart","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fe4d8c6d8632595d8ba7225471afdda73adde319","infoHashBuffer":{"type":"Buffer","data":[254,77,140,109,134,50,89,93,139,167,34,84,113,175,221,167,58,221,227,25]},"announce":[],"urlList":[]}}