{"title":"Remember Me Repack","uid":12217471,"size":3868148345,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:feb61788f6fedba585022be7ebcaa1000adad64a&amp;dn=Remember+Me+Repack&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":2,"time":1439267013,"description":"Remember Me is an action-adventure sci-fi video game developed by Dontnod Entertainment and published by Capcom. It was released in June 2013 for Microsoft Windows, PlayStation 3 and Xbox 360. The game's plot focuses on Nilin, a memory hunter working for an underground resistance called the Errorists. When the game starts, she has been stripped of nearly all her memories by mega-corporation Memorize. With the help of a mysterious man named Edge, she goes on a quest to bring down Memorize and recover her lost memories.\n\nRemember Me was developed as the debut project of Dontnod Entertainment, with one of the company's founding members, Jean-Max Moris, as its director. Part of his goal for the game was to create a thought-provoking story, and eventually settled on a female protagonist to help convey the story themes. Originally a PlayStation 3-exclusive titled Adrift, it was cancelled in 2011, then later purchased by Capcom, and resurrected as a multiplatform game. The game received mixed to positive reviews upon release, with general praise going to the story concept, some of the gameplay elements and the general setting","torrent":{"xt":"urn:btih:feb61788f6fedba585022be7ebcaa1000adad64a","amp;dn":"Remember+Me+Repack","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"feb61788f6fedba585022be7ebcaa1000adad64a","infoHashBuffer":{"type":"Buffer","data":[254,182,23,136,246,254,219,165,133,2,43,231,235,202,161,0,10,218,214,74]},"announce":[],"urlList":[]}}