{"title":"The Dangerous Teachings Of Enterthe5t4rz (youtube video)","uid":12155257,"size":281161391,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:fed82d8e142c10ce59f3c32f7644fbf5b66b476a&amp;dn=The+Dangerous+Teachings+Of+Enterthe5t4rz+%28youtube+video%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"one_last_round","files":1,"time":1437766699,"description":"This video would be for you if you are a Christian or if you follow the youtube channel Enterthe5t4rz.  This video is about 45 minutes in duration.  In the video, you will hear what Enterthe5t4rz is teaching, which is disinformation.  There are probably a lot of sponsored CIA youtube Channels.  KJ from the ScariestMovieEver said he has a Hollywood and military Background.  His subscription number is over Hundred Thousand.   R$E or Round Saturn's Eye also comes from Hollywood.  He met the Queen and hung out with Peter Jackson and Jack Black.  R$E has been caught in many lies.  His channel has close to 50,000 subs.  Enterthe5t4rz says the BlackChild Youtube channel has a past in Hollywood.  Enterthe5t4rz has Hollywood connections too.  Then there are channels like the Vigilant Christian.  He has over 200,000 subs.   I did videos exposing some of the concerns with his channel.  I believe somebody would have to be promoting his channel.  So why are they promoting these channels?   Well it seems like they want to control the youtube so smaller channels get no views.  Also, they can lead people a certain way by controlling the bigger channels.   \n\nThis video in this torrent serves as an example of false teaching on youtube","torrent":{"xt":"urn:btih:fed82d8e142c10ce59f3c32f7644fbf5b66b476a","amp;dn":"The+Dangerous+Teachings+Of+Enterthe5t4rz+%28youtube+video%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fed82d8e142c10ce59f3c32f7644fbf5b66b476a","infoHashBuffer":{"type":"Buffer","data":[254,216,45,142,20,44,16,206,89,243,195,47,118,68,251,245,182,107,71,106]},"announce":[],"urlList":[]}}