{"title":"Fake or Fortune S04E02","uid":12117818,"size":653837701,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:ffd29708b58ce2a364cffe0f3f57416d91c2f057&amp;dn=Fake+or+Fortune+S04E02&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"xela_5","files":1,"time":1436760202,"description":"Fake or Fortune?\n\nRenoir - Series 4 Episode 2 of 4\n \n\nNicky Philipps, a portrait artist renowned for her pictures of the royal family, has asked the Fake or Fortune team to investigate a painting which hangs on the walls of Picton Castle, once the Philipps family seat. The work was bought in the 1930s by Nicky's great-grandfather, Sir Laurence Philipps, who believed it to be by celebrated impressionist Pierre Auguste Renoir. But the painting has been dogged by doubt for half a century, and two art world authorities can't agree whether it's genuine or fake.\n\nNicky's late Aunt Gwen used to tell a tantalising story that the painting came from Claude Monet's house in Giverny and was a gift to the artist from Renoir at a time when they painted together. But a family anecdote isn't enough to convince the art world's toughest judges - the team must find hard evidence. \n\nThe trail takes Philip to Argenteuil, a suburb of Paris which was once an impressionist playground. During the 1870s, Renoir and Monet worked here together, often painting the same views side by side. But can Philip find any evidence that Nicky's picture was painted here? \n\nFiona picks up the provenance trail at Monet's house in Giverny, where she tries to find proof that the painting once hung in his personal art collection. To find out, she must access some closely guarded archives in Paris.\n\nPhilip travels to Berlin to see if cutting-edge technology can determine whether the pigments in Nicky's painting match up to those listed by Renoir himself. Can a special camera see through the canvas to reveal clues hidden from view?\n\nAlong the way, Fiona discovers that the picture is caught between two rival art world authorities - the Bernheim-Jeune Gallery and the Wildenstein Institute, who both believe their word is the last word when it comes to Renoir","torrent":{"xt":"urn:btih:ffd29708b58ce2a364cffe0f3f57416d91c2f057","amp;dn":"Fake+or+Fortune+S04E02","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ffd29708b58ce2a364cffe0f3f57416d91c2f057","infoHashBuffer":{"type":"Buffer","data":[255,210,151,8,181,140,226,163,100,207,254,15,63,87,65,109,145,194,240,87]},"announce":[],"urlList":[]}}